{
  "sessions": [
    {
      "intendedAudience": "Anyone involved in software development can get something from this talk. Participants will benefit from a new perspective on their work. It will also satisfy any nerdy interest in aviation and break up a day of more specific/technical sessions.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "What can aviation teach us about software? More acutely, what can aviation disasters teach us? Aviation is an industry that has committed to relentlessly learning from its mistakes, in the name of making the skies safer. Where the cost of the next iteration is potentially counted in human lives, then that relentlessness is not seen as a noble commitment but rather as the bare minimum. As software professionals, we have it easy. The costs of our decisions and failures are far far lower. For now.\n\nAs software permeates ever wider through our lives, the cost of failure gets higher. Societies are becoming cashless, and doctors are carrying a different kind of tablet. Smart phones have led us to smart homes. In a world where everything is connected, it’s time to learn from the industries where disasters are avoided at all costs. And in the face of disaster, instinctively running toward scrutiny rather than away from it.\n\nThis talk is not doom and gloom. It is a practical look at the methods and insights that almost 100 years of investigating commercial aviation disasters can teach us as software engineers.\n\nWhile the utmost care is taken to present the information deliberately and sensitively, please be aware that details and photos of real air crashes will be shared.",
      "title": "Mayday! Software lessons from aviation disasters.",
      "room": "Room 6",
      "startTime": "2021-12-08T15:50",
      "endTime": "2021-12-08T16:35",
      "startTimeZulu": "2021-12-08T14:50:00Z",
      "endTimeZulu": "2021-12-08T15:35:00Z",
      "id": "d0842639-911b-4474-b355-27f463965763",
      "sessionId": "d0842639-911b-4474-b355-27f463965763",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T15:50",
      "startSlotZulu": "2021-12-08T14:50:00Z",
      "speakers": [
        {
          "name": "Adele Carpenter",
          "twitter": "iam_carpenter",
          "bio": "Adele is a software engineer at Trifork Amsterdam (and aviation geek in her spare time), where she is working on backend systems for the educational sector. Most of her work day is spent in the JVM/Spring ecosystems. Adele got the coding bug later in life but since then has been making up for lost time, going from command line noob to employed software engineer in just one year. Her experiences both in and out of tech have given her a unique perspective on the art of programming together with humans, which she hopes is useful to other humans who program with humans."
        }
      ]
    },
    {
      "intendedAudience": "Folk med interesse for react, frontend, eller brukeropplevelse ",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Vi skal ta en titt på react context og hvordan det gir mulighet til å la brukeren styre designet selv. Glemt brillene dine? React context kan hjelpe deg med tekststørrelsen. I dårlig humør? Hvorfor ikke tilpasse siden til å matche ditt dystre indre? Konseptene blir eksemplifisert med en forhåndslagd react-applikasjon. ",
      "title": "Brukerstyrt design med react-context",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T10:40",
      "endTime": "2021-12-08T11:00",
      "startTimeZulu": "2021-12-08T09:40:00Z",
      "endTimeZulu": "2021-12-08T10:00:00Z",
      "id": "2ba3bb9d-d3c5-4074-8881-09a3864b2a35",
      "sessionId": "2ba3bb9d-d3c5-4074-8881-09a3864b2a35",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T10:40",
      "startSlotZulu": "2021-12-08T09:40:00Z",
      "speakers": [
        {
          "name": "Hege Haavaldsen",
          "twitter": "",
          "bio": "Hege har jobbet som IT-konsulent i 1.5 år og har siden hun begynte å jobbe vært veldig interessert i React og å lage frontendapplikasjoner med fokus på brukeropplevelse "
        }
      ]
    },
    {
      "intendedAudience": "Utviklere intressert av deling och læring. ",
      "length": "10",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Livet som utvikler innebærer at man hele tiden må lære seg nye ting. Den andre siden av det er at for at vi skal ha noe å lære må noen også dele det de kan og de erfaringene de har gjort seg.\n\nDessverre er det i praktiken få utviklere som egentlig ønsker å bidra med talks i større eller mindre sammenhenger.\n\nHvorfor er det slik? SpareBank 1 Utvikling ønsker å være en lærende organisasjon og vi har forsøkt å komme til bunns med problemstillingen.\n\nKom og hør hva det er som gjør at folk unngår å holde talks og hvorfor du burde ta steget selv!",
      "title": "Mer enn gode talks og kald pils - derfor burde Du snakke på JavaZone!",
      "room": "Room 2",
      "startTime": "2021-12-09T13:30",
      "endTime": "2021-12-09T13:40",
      "startTimeZulu": "2021-12-09T12:30:00Z",
      "endTimeZulu": "2021-12-09T12:40:00Z",
      "id": "d0194881-cb03-45fe-b15f-056593184fbd",
      "sessionId": "d0194881-cb03-45fe-b15f-056593184fbd",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T13:30",
      "startSlotZulu": "2021-12-09T12:30:00Z",
      "speakers": [
        {
          "name": "Jonas Nordstrand",
          "twitter": "",
          "bio": "Utvikler/generalist i SpareBank 1 Utvikling. "
        }
      ]
    },
    {
      "intendedAudience": "Anyone who uses Maven. Anyone interested in Open Source. No experience required, although it may help if you've used Maven before.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Have you ever used Maven, ran into a bug and thought: \"How on earth can a project this old have this bug?\". Then join this session! Maven, although a well-known and well-trusted project, is run by a relatively small bunch of people. There's simply more work to do than these people can do!\n\nSo instead of getting angry, or looking for alternatives, you can contribute to Maven yourself and work on making it even better. Join us on our journey from \"how on earth\" to \"works like heaven\". We'll discuss how we did it, what we did, and most importantly: how you can start contributing to Maven as well!\n\nAs you walk out the room, better reserve some time in your calendar to start working on that bug ;-).",
      "title": "Making Maven Marvellous",
      "room": "Room 1 (Prerecorded)",
      "startTime": "2021-12-08T13:30",
      "endTime": "2021-12-08T14:30",
      "startTimeZulu": "2021-12-08T12:30:00Z",
      "endTimeZulu": "2021-12-08T13:30:00Z",
      "id": "b72469a9-091e-433a-abc0-3a080c43eb05",
      "sessionId": "b72469a9-091e-433a-abc0-3a080c43eb05",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T13:30",
      "startSlotZulu": "2021-12-08T12:30:00Z",
      "speakers": [
        {
          "name": "Maarten Mulders",
          "twitter": "mthmulders",
          "bio": "Passionate architect, senior developer and trainer at Info Support. Also Oracle Groundbreaker Ambassador. I'm eager about \"building the right thing\" and \"building the thing right\". I focus on lean and elegant solutions, and I love to share new ideas and knowledge. Outside work, I appreciate crafting and eating good food, photography, and music, in no particular order."
        },
        {
          "name": "Martin Kanters",
          "twitter": "MartinKanters",
          "bio": "Senior Developer at JPoint and Apache Maven committer. Working together in teams on complex applications keeps me going to work every morning with a big smile. I get a lot of energy from sharing the knowledge I learn during the job. After work hours I can often be found playing the piano, either at home or at jam sessions."
        }
      ]
    },
    {
      "intendedAudience": "Backend developers, software architects, and database administrators looking to improve availability, performance, and scalability without increasing operating costs.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Command Query Responsibility Segregation (CQRS) has been a trending architectural pattern the last decade, with multiple presentations at various conferences describing the pattern and how to implement it.\n\nThis isn’t one of those presentations.\n\nInstead, it is the story of how Inspera Assessment accidentally reinvented CQRS, implementing the pattern without knowing about it. To improve the availability, performance, and scalability of our service, without spending our entire operating budget on database licenses or increasing server capacity, we offloaded almost all read and search operations from the database to Elasticsearch. The resulting architecture is now comfortably handling 2 million digital exams a year, submitted from 160 countries across the world, with a reasonable AWS bill.\n\nJoin this session to learn what made us choose this architecture, what tradeoffs we had to make to pull it off, how we benefited, and what we would have done differently if we were to do it again or knew about CQRS before discovering the pattern independently.",
      "title": " CQRS by Accident - Database Acceleration with Elasticsearch",
      "room": "Room 4",
      "startTime": "2021-12-09T13:30",
      "endTime": "2021-12-09T14:30",
      "startTimeZulu": "2021-12-09T12:30:00Z",
      "endTimeZulu": "2021-12-09T13:30:00Z",
      "id": "cd423c37-5058-47e5-875f-30f33afa0b63",
      "sessionId": "cd423c37-5058-47e5-875f-30f33afa0b63",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T13:30",
      "startSlotZulu": "2021-12-09T12:30:00Z",
      "speakers": [
        {
          "name": "Markus Krüger",
          "twitter": "@markusbk",
          "bio": "Markus Krüger is the team lead of the Infrastructure team at Inspera, building solutions for online assessments. He has held several presentations at JavaZone and other venues previously, on various subjects such as performance testing, scheduling, scaling systems, and cloud architectures. He likes making large things go fast."
        }
      ]
    },
    {
      "intendedAudience": "This session is open to all levels with an experience in building and deploying applications! I will cover the evolution of applications architecture and the thinking behind service meshes, covering its foundation, architecture and advantages. By the end of the session, attendees should have a clear understanding of what is a service mesh, when you need/not it.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Over the past year, Service Mesh has emerged as a critical component of the cloud native stack. It makes communication between service instances flexible, reliable, and fast, so developers can focus on adding business value and letting the mesh does all the complex non-functional work like service discovery, load balancing, encryption, authentication, authorization, support for the circuit breaker pattern, and other capabilities.\n\nIn this session we’ll provide an introduction to service mesh, starting with somehow the philosophical questions: do we really need a service mesh? what it can do and why people are interested in it ? Going it really to make all our problems disappear ? We’ll also explore how it simplifies application design and also where it adds complexity. All with some demos that highlights how the new microservices architectures as well as legacy monolith applications could benefit from service mech!",
      "title": "What the hell is service mesh anyway !?",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-09T13:30",
      "endTime": "2021-12-09T14:30",
      "startTimeZulu": "2021-12-09T12:30:00Z",
      "endTimeZulu": "2021-12-09T13:30:00Z",
      "id": "3a541e5b-fc42-4c28-90b0-baa1dc4d852c",
      "sessionId": "3a541e5b-fc42-4c28-90b0-baa1dc4d852c",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T13:30",
      "startSlotZulu": "2021-12-09T12:30:00Z",
      "speakers": [
        {
          "name": "Mohammed Aboullaite",
          "twitter": "laytoun",
          "bio": "Mohammed is a community catalyst, a true open source believer and has contributed to various open source projects. He currently works at Spotify."
        }
      ]
    },
    {
      "intendedAudience": "Developers with/ and-or co-workers interested in Autism.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Are all software developers the same? Do all software developers make the same choices? Or are some of them having more worries or just think in a unique way? Yes! of course. There is a group of software developers who are autistic. It can be people with an ASD (Autism Spectrum Disorder) diagnose. But there also a lot of people with autism missing an official diagnose. Some people are just fighting more than others for getting things done.\n\nIn this talk, I cover how the tech world is for me, as a person with autism. I am in tech for +10 years. In fact, sometimes I feel differences between me and other people in tech. Besides my tech roll in life, I was responsible for a self–support group of people with autism for a long time, and I am still active in the self-support group but handed the responsibility over, to focus more on my nonprofit DDSoft.\n\nOf course, I am not only telling about myself. I cover also lessons learned from other people with autism in tech. I talk about unique thoughts, strict decisions and anxiety for changes like updating an environment or trying to complete new classes can be hard for people like me. And of course I tell you about 'autistic experiences, needs and solutions' during current times of pandemic.\n\nFasten your seatbelt and have a flight into the world of autism in tech.",
      "title": "Autism in Tech",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-09T10:40",
      "endTime": "2021-12-09T11:40",
      "startTimeZulu": "2021-12-09T09:40:00Z",
      "endTimeZulu": "2021-12-09T10:40:00Z",
      "id": "2221b667-5c7b-455c-8aa8-bb6c7f0665c4",
      "sessionId": "2221b667-5c7b-455c-8aa8-bb6c7f0665c4",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T10:40",
      "startSlotZulu": "2021-12-09T09:40:00Z",
      "speakers": [
        {
          "name": "Dennie Declerq",
          "twitter": "@DennieDeclercq",
          "bio": "Dennie is Microsoft MVP Developer Technologies and has experience in accessibility in with Microsoft technologies. In daily life Dennie is president and developer at DDSoft, a nonprofit in function of People With Disabilities. Dennie invented technical solutions and systems to help people with disabilities to participate in their daily life. Thanks to his autism he's the right man at the right spot to contribute as a volunteer in function of people with disabilities."
        }
      ]
    },
    {
      "intendedAudience": "If you know some JavaScript or want to catch up with the latest.",
      "length": "10",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Every year new features are added to the language JavaScript. Let me walk you through this year's changes.",
      "title": "What's new in JavaScript - ES2021",
      "room": "Room 2",
      "startTime": "2021-12-09T11:50",
      "endTime": "2021-12-09T12:00",
      "startTimeZulu": "2021-12-09T10:50:00Z",
      "endTimeZulu": "2021-12-09T11:00:00Z",
      "id": "51e186dc-1c43-4a14-b5e8-81bd035a5774",
      "sessionId": "51e186dc-1c43-4a14-b5e8-81bd035a5774",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T11:50",
      "startSlotZulu": "2021-12-09T10:50:00Z",
      "speakers": [
        {
          "name": "Gaute Meek Olsen",
          "twitter": "GauteMeekOlsen",
          "bio": "Gaute is a software developer from Norway. He always likes to learn new technology and create hobby projects from what he has learned. He mostly programmes in JavaScript, C#, Java, and Kotlin."
        }
      ]
    },
    {
      "intendedAudience": "Relevant for alle utviklere, ferske som erfarne med mulig forskjellig utbytte av presentasjonen.",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "I tillegg til blomster på første dag, får nye team-tilskudd ofte utdelt fiendtlige footguns. Samme footgun som resten av teamet har: Implisitt prosjektkunnskap. Eller prosjektnormer om du vil. Den kunnskapen de som har vært i kodebasen for alltid bare kjenner på kroppen. Ting du absolutt må unngå å gjøre, men er vanskelig å fange opp og krever alle konstant på alerten. Vi kan være gode på Code Reviews og ha gode rutiner, men all manuell sjekk vil være sårbart. All denne implisitte kunnskapen tilrettelegger for et minefelt. Som i all programmering er eksplisitt kunnskap bedre enn implisitt kunnskap. Ingen kommer på å lese dokumentasjon i tilfelle det kan stå noe relevant, og kommentarer har for liten kontrast i editoren. Vi trenger noe bedre system for a fange opp dette!\n\nDet finnes allerede veldig gode mekanismer for å håndheve implisitte regler i en kodebase, slik det har gjort i et par ti-år: Linting! Statisk analyse av kodebasen og validering opp mot et definert sett med regler. Men implisitt prosjektkunnskap kan være kode- eller domenespesifikt og ofte veldig spesialisert for akkurat din kodebase. Eller for ditt team. Men vi kan bruke samme system og mekanikk for å lage våre egne regler, som kun gjelder for oss. Og heldigvis lever vi i en tid hvor disse verktøyene er enklere tilgjengelig enn noen gang.\n\nI denne presentasjonen utforsker vi linting, abstrakte syntaks trær og tre-traversering for hvordan du kan skrive dine prosjektspesifikke regler! Konseptene og tankesettet er gjenbrukbart i flere programmeringsspråk men fleste eksempler vil være med bruk av TypeScript og eslint. ",
      "title": "Bli kvitt implisitt prosjektkunnskap med snevre linting-regler",
      "room": "Room 5",
      "startTime": "2021-12-09T10:40",
      "endTime": "2021-12-09T11:25",
      "startTimeZulu": "2021-12-09T09:40:00Z",
      "endTimeZulu": "2021-12-09T10:25:00Z",
      "id": "ad6030f1-8e75-4e88-bad5-0d4b0eee4a71",
      "sessionId": "ad6030f1-8e75-4e88-bad5-0d4b0eee4a71",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T10:40",
      "startSlotZulu": "2021-12-09T09:40:00Z",
      "speakers": [
        {
          "name": "Mikael Brevik",
          "twitter": "mikaelbrevik",
          "bio": "Mikael Brevik har lang erfaring som utvikler og foredragsholder i store nasjonale og internasjonale konferanser. Mikael har 2 programmeringspodcaster på Norsk og arrangerer Trondheims JavaScript-meetup og jobber til det daglige som Variants Chief Community Officer. Mikael er opptatt av kommunikasjon, teams og programmeringsspråk."
        }
      ]
    },
    {
      "intendedAudience": "Alle som er involvert i utvikling av software i offentlig sektor; utviklere, prosjektledere, fag- og forretningsfolk, produkteiere og alle andre som er opptatt av moderne softwareutvikling.",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "I kontroversen rundt appen Smittestopp ble åpen kildekode diskutert på Stortinget. Det må vel kalles et gjennombrudd! Dette ble også heftig diskutert i IT-miljøet. Jeg argumenterer for at all offentlig kode bør være åpen, med et par forbehold. På tide å lande denne diskusjonen en gang for alle!",
      "title": "Året da åpen kildekode ble diskutert på Stortinget!",
      "room": "Room 6",
      "startTime": "2021-12-09T11:50",
      "endTime": "2021-12-09T12:35",
      "startTimeZulu": "2021-12-09T10:50:00Z",
      "endTimeZulu": "2021-12-09T11:35:00Z",
      "id": "d1f4e5ef-da01-40f8-969e-b15a0810e797",
      "sessionId": "d1f4e5ef-da01-40f8-969e-b15a0810e797",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T11:50",
      "startSlotZulu": "2021-12-09T10:50:00Z",
      "speakers": [
        {
          "name": "Trond Arve Wasskog",
          "twitter": "ilmyggo",
          "bio": "Trond Arve er utvikler og arkitekt med et spesielt engasjement for offentlig sektor. Han har jobbet for flere offentlige virksomheter, inkludert NAV og Skatteetaten. Han er også CTO i Bekk Consulting."
        }
      ]
    },
    {
      "intendedAudience": "- Dyktige teknologer som er interessert i å utvikle tjenester på en moderne applikasjonsplattform.\n- Alle som synes politi er litt kult og lurer på hvordan teknologer kan bidra til å understøtte politiets samfunnsoppdrag.\n",
      "length": "60",
      "format": "presentation",
      "language": "no",
      "abstract": "Politiet satser på bruk av sky og skybaserte løsninger. Vi har nylig har etablert en moderne applikasjonsplattform, som er bygget med det ypperste innenfor teknologi (Kubernetes mm). Våren 2021 migrerte politiet de første større egenutviklede og samfunnskritiske løsningene til den nye plattformen. Foredraget er en slags retrospektiv knyttet til reisen til et av produktutviklingsteamene. Hva lærte vi - kulturelt, metodisk og utviklingsfaglig? Verdien som er tilført norsk politi i form av økt evne til bekjempelse av ulovlig opphold og terror, avdekking av falske og doble identiteter, samt avdekking av ofre for menneskehandel, er blant gevinstene. \n",
      "title": "Hvordan reisen til kontinuerlige leveranser har bidratt til å bekjempe ulovlig opphold og terror",
      "room": "Room 5",
      "startTime": "2021-12-09T14:40",
      "endTime": "2021-12-09T15:40",
      "startTimeZulu": "2021-12-09T13:40:00Z",
      "endTimeZulu": "2021-12-09T14:40:00Z",
      "id": "bb592238-a320-4c32-b60f-69b6b96bf195",
      "sessionId": "bb592238-a320-4c32-b60f-69b6b96bf195",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T14:40",
      "startSlotZulu": "2021-12-09T13:40:00Z",
      "speakers": [
        {
          "name": "Ragnhild Sandberg",
          "twitter": "",
          "bio": "Ragnhild Sandberg  har hovedfag i informatikk, med fordypning i innovasjon, programmering og databaseteori fra Cornell University NY og Universitetet i Oslo. Hun har tidligere startet og ledet sin eget høyteknologi gründerbedrift, selskap og jobbet åtte år internasjonalt for Telenor med blant annet tjenesteinnovasjon. De siste årene har hun ledet flere produktutviklingsteam i politiet.  Hun er lidenskapelig opptatt av høyteknologi forretningsutvikling og digital transformasjon. \nLes mer her: https://www.linkedin.com/in/ragnhildsandberg/\n"
        }
      ]
    },
    {
      "intendedAudience": "Developers who are familiar with Infrastructure as Code, typically DevOps team members.",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Som utvikler skriver du (forhåpentligvis) tester når du utvikler kode. Men når du skal gjøre det samme for infrastruktur som kode, for eksempel med Terraform, så tipper jeg du sluntrer unna. Det er ikke så uvanlig.\n\nMen det finnes måter å gjøre det på, og det finnes gode grunner til å gjøre det.\n\nJeg vil gå gjennom ulike tilnærminger til testing, hvordan man kan skrive tester med Terratest, og vise eksempler på hvordan de kan automatiseres og kjøres som del av en pipeline.\n\nI tillegg vil jeg peke på noen av utfordringene man støter på underveis, og hvordan de fleste kan løses. Og hvilke som kan være litt vanskeligere å løse.",
      "title": "Terratesting Terraform",
      "room": "Room 2",
      "startTime": "2021-12-09T12:05",
      "endTime": "2021-12-09T12:25",
      "startTimeZulu": "2021-12-09T11:05:00Z",
      "endTimeZulu": "2021-12-09T11:25:00Z",
      "id": "4bf0aa49-75f9-4d34-9b5d-9f5948d7e2f7",
      "sessionId": "4bf0aa49-75f9-4d34-9b5d-9f5948d7e2f7",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T11:50",
      "startSlotZulu": "2021-12-09T10:50:00Z",
      "speakers": [
        {
          "name": "Sindre Lindstad",
          "twitter": "@sindreli",
          "bio": "Sindre Lindstad is a die-hard automation enthusiast. He currently works as a DevOps Evangelist at Entur AS, and once set a record as the fastest 60 meter runner in primary school."
        }
      ]
    },
    {
      "intendedAudience": "Alle som er interessert i forvaltning av et stort offentlig softwareprosjekt.",
      "length": "60",
      "format": "presentation",
      "language": "no",
      "abstract": "Skatteetatens skatteprosess styrer skatteplikt, skattekort og skatteberegning for Norges befolkning. Prosessen er implementert som et samspill av over hundre tjenester. Tjenestene krever kontinuerlig oppetid mens det underliggende regelverk og tekniske krav er under fortløpende forandring. En så levende hverdag med mange oppgaver for daglig drift skaper dessverre perfekte betingelser for oppbygging av teknisk gjeld og utsettelse av større refaktoreringsjobber. I dette foredraget ønsker vi å diskutere utfordringer i forvaltning av et moderne og omfangsrikt software-system.\n\nUnder foredraget diskuteres:\n- hvordan vi forholder oss til overgangen fra stor arbeidsstyrke i prosjektfasen og overgang til lavere bemanning når systemet går inn i ordinær forvaltning \n- gjennomføring av tekniske oppdateringer som påvirker både samfunn og innbyggere parallelt med høyt press i den daglige driften\n- langsiktige problemer vi opplever med å endre et stort system av mikrotjenester og hvordan vi organiserer arbeid i store tverrfaglige team med kontinuerlig utskiftning",
      "title": "Når festen er over - erfaringer fra forvaltning etter et storprosjekt",
      "room": "Room 7",
      "startTime": "2021-12-09T09:30",
      "endTime": "2021-12-09T10:30",
      "startTimeZulu": "2021-12-09T08:30:00Z",
      "endTimeZulu": "2021-12-09T09:30:00Z",
      "id": "9a1aa38f-4067-4b1e-84a0-1064f7bccdce",
      "sessionId": "9a1aa38f-4067-4b1e-84a0-1064f7bccdce",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T09:30",
      "startSlotZulu": "2021-12-09T08:30:00Z",
      "speakers": [
        {
          "name": "Jon Sølvberg",
          "twitter": "",
          "bio": "Currently working in Skatteetaten (Norwegian revenue authorities) since June 2015. Prior to this, long-standing experience in development of complex and critical business systems within the financial sector (Stock Exchange and CSD field) - both as a developer and acting as technical lead (since 2000). "
        },
        {
          "name": "Rafael Winterhalter",
          "twitter": "rafaelcodes",
          "bio": "Rafael works as a software consultant at Scienta in Oslo, Norway and has been at Skatteetaten for the past three years. He is a proponent of static typing and a JVM enthusiast with particular interest in code instrumentation, concurrency and functional programming. Rafael blogs about software development, regularly presents at conferences and was pronounced a JavaOne Rock Star. When coding outside of his work place, he contributes to a wide range of open source projects and often works on Byte Buddy, a library for simple runtime code generation for the Java virtual machine. For his work, Rafael received a Duke's Choice award, an Oracle groundbreaker award and was elected a Java Champion."
        }
      ]
    },
    {
      "intendedAudience": "Java developers with an interest in new and upcoming features.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "At first it seemed to be just a small enhancement: the addition of \"Pattern Matching for instanceof\" (JEP 305) in Java 14. No more unnecessary casting after an `instanceof`, that ought to save us a few seconds a day! However, upon further investigation you'll quickly discover that pattern matching is not just an enhancement, but rather a vital puzzle piece in the grander scheme of things.\n\nWhy were switch expressions added to Java, for example? To make them support pattern matching in a later release! And why did Java 14 bring us records and will Java 15 contain sealed types? Because they could work really well with pattern matching in a later release! These new concepts are the foundation upon which advanced pattern matching features will be built.\n\nSo attend this session to get all caught up! You'll hear about type patterns, deconstruction patterns, nested patterns and even how pattern matching could improve serialization in the future. Live coding included, of course!",
      "title": "Pattern Matching: Small Enhancement or Major Feature?",
      "room": "Room 1 (Prerecorded)",
      "startTime": "2021-12-09T14:40",
      "endTime": "2021-12-09T15:25",
      "startTimeZulu": "2021-12-09T13:40:00Z",
      "endTimeZulu": "2021-12-09T14:25:00Z",
      "id": "e63c4f79-a0d6-4ab6-972c-6c1335e0c9be",
      "sessionId": "e63c4f79-a0d6-4ab6-972c-6c1335e0c9be",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T14:40",
      "startSlotZulu": "2021-12-09T13:40:00Z",
      "speakers": [
        {
          "name": "Hanno Embregts",
          "twitter": "hannotify",
          "bio": "Hanno Embregts is a Java Developer, Speaker and Teacher at Info Support (the Netherlands). He has over 14 years experience with both front- and back-end development, with a special interest in automating the software development process to the fullest. He likes his work best when it is fast-paced and versatile, which is why he juggles Java development, public speaking and teaching courses at Info Support’s Knowledge Centre. When Hanno doesn’t have access to any kind of computer - which can only be called the most desperate of times - he plays in a band as a lead singer and guitar player. He is also a passionate fan of alternative rock band Switchfoot and Dutch football club Feyenoord. Last but not least: he has been told off repeatedly for using Star Wars quotes at work (things didn’t improve much by replying “I find your lack of faith disturbing”)."
        },
        {
          "name": "Peter Wessels",
          "twitter": "PeterWessels",
          "bio": "Peter Wessels is an IT Consultant and Teacher at Info Support. His aim as a Java Developer is to use the code he writes to make a positive impact. Apart from his technical interests he is passionate about bringing tech and humans closer together, which is why he likes Domain Driven Design, Specification by Example and Domain Specific Languages."
        }
      ]
    },
    {
      "intendedAudience": "Anyone interested in learning how a human mobility dataset can help for good,  building software, running serverless in the cloud, and/or the ones interested in getting to market fast.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "At Unacast we spend all our days trying to understand how people move in the real world. When COVID-19 struck we started to look into how we as a company can contribute to fighting the virus. We came up with the idea of a social distancing scoreboard. The concept is to grade the different geographies after how good they are at social distancing. This dataset was created and made publicly available at Tableau, causing the public Tableau servers to go down.\nThis is the story of how we in 3 days went from taking down the Tableau servers to having a running front-end serving 1 million users from day one. It’s all about leveraging the cloud, taking shortcuts, making mistakes, and never sleep.",
      "title": "Creating an app in 3 days to handle 1 million daily users ",
      "room": "Room 6",
      "startTime": "2021-12-08T09:30",
      "endTime": "2021-12-08T10:15",
      "startTimeZulu": "2021-12-08T08:30:00Z",
      "endTimeZulu": "2021-12-08T09:15:00Z",
      "id": "141ae293-2c34-4ccc-b0d9-dab39b40ae69",
      "sessionId": "141ae293-2c34-4ccc-b0d9-dab39b40ae69",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T09:30",
      "startSlotZulu": "2021-12-08T08:30:00Z",
      "speakers": [
        {
          "name": "Tor Åge Ballo",
          "twitter": "",
          "bio": "Tor Åge is working as a director of software engineering at Unacast. Handling enormous amounts of location data to try to understand how people move in the real world. Tor Åge loves creating stuff, systems, front-ends, apps, agile teams, and music."
        }
      ]
    },
    {
      "intendedAudience": "Developers and architects",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "In this talk we will go back a bit and discuss secure code. We will look at the constructs we are using (and not using) and why changing some of the ways we typically write our code, can have security benefits. We will grab some elements from (modern) Domain Driven Design and see how we can use this to avoid or limit vulnerabilities.",
      "title": "Secure coding - back to basics",
      "room": "Room 5",
      "startTime": "2021-12-08T13:30",
      "endTime": "2021-12-08T14:15",
      "startTimeZulu": "2021-12-08T12:30:00Z",
      "endTimeZulu": "2021-12-08T13:15:00Z",
      "id": "48bf3a72-849c-4b79-93ce-506bac06a661",
      "sessionId": "48bf3a72-849c-4b79-93ce-506bac06a661",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T13:30",
      "startSlotZulu": "2021-12-08T12:30:00Z",
      "speakers": [
        {
          "name": "Erlend Oftedal",
          "twitter": "webtonull",
          "bio": "Erlend works as a developer and security tester and mainly works on security related products and projects. He is involved in OWASP and also builds open source security tools."
        }
      ]
    },
    {
      "intendedAudience": "Learning these methods and patterns is useful to both developers and designers, and I encourage all who work with web development in any role to participate. There will be code, but the focus will be on the functionality provided by the code, so that we all have the same building blocks in mind when co-operating.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "Have you ever been tasked with making something accessible, so you checked for color contrast and sprinkled some ARIA-tags on it (which you got from a stackoverflow-page from 2011)? You are not alone!\n\nBut making the web accessible is so much more, and in some cases much simpler! It is about learning fundamentals and following standards. It is about knowing who to ask for advice and how to properly test your designs and implementation.\n\nIn this presentation, you will learn how to make your website more accessible by diving into common, well-known components, like semantic sectioning, skip-links, different ways of using “open-close”-functionality, displaying complex data, and more. You will learn about useful patterns, and which to avoid. You will learn how to figure out if your component works for everyone and what you need outside help to test.",
      "title": "Accessible Components for developers and designers",
      "room": "Room 4",
      "startTime": "2021-12-09T11:50",
      "endTime": "2021-12-09T12:35",
      "startTimeZulu": "2021-12-09T10:50:00Z",
      "endTimeZulu": "2021-12-09T11:35:00Z",
      "id": "eff171ab-0d11-46ce-8d60-cd4cd78543d9",
      "sessionId": "eff171ab-0d11-46ce-8d60-cd4cd78543d9",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T11:50",
      "startSlotZulu": "2021-12-09T10:50:00Z",
      "speakers": [
        {
          "name": "Vegard Haugstvedt",
          "twitter": "@it_vegard",
          "bio": "Frontend developer and accessibility specialist. Passionate about establishing accessibility as the minimum quality metric for web development. Currently digitizing and making sure over 250 forms at Norwegian Labour and Welfare Administration (NAV) are accessible to everyone."
        }
      ]
    },
    {
      "intendedAudience": "De fleste utviklere i Java som har fått OutOfMemoryError. :) Det er som regel minst én av de som er på grunn av dette.",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Fått OutOfMemoryError før? Økte du minnet? Ofte burde du ikke det. 512MB er faktisk veldig mye minne! Du kan til og med klare deg med mindre. Vi kjørte pålitelig med 300MB heap i produksjon. Jeg tipper du kan gjøre det og. :)\n\nStrømming er svaret. Helt siden Java 8 kom med Streams har jeg håpet at det skulle være en måte å kunne hente litt og litt. Det reduserer minnnebehovet drastisk og gir bedre ytelse dersom man trenger å hente mye.\n\nOg endelig fant jeg en måte. :) En kontinuerlig strøm fra databasen til browseren! Det er ikke spesielt vanskelig og burde være den vanlige måten å hente lister på. Bli med så skal jeg vise deg hvordan. :)\n\nEksemplene er fra Kotlin, men lett overførbare til Java og Spring.\n",
      "title": "Minne <3 Streams (i Kotlin)",
      "room": "Room 2",
      "startTime": "2021-12-09T16:10",
      "endTime": "2021-12-09T16:30",
      "startTimeZulu": "2021-12-09T15:10:00Z",
      "endTimeZulu": "2021-12-09T15:30:00Z",
      "id": "cfbef9b2-1e94-4264-9ca8-0bbaef3679e7",
      "sessionId": "cfbef9b2-1e94-4264-9ca8-0bbaef3679e7",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T15:50",
      "startSlotZulu": "2021-12-09T14:50:00Z",
      "speakers": [
        {
          "name": "Anders Sveen",
          "twitter": "anderssv",
          "bio": "Anders har lang erfaring med utvikling, devops og kontinuerlige leveranser. Han elsker å lage løsninger som løser problemer for brukerne på en effektiv og kjapp måte. Helst gjennom hyppig feedback med releaser til produksjon hver dag. Slik at vi kan se hva som tas i bruk, og hva som faktisk fungerer.\n\nHan har vært konsulent i mange år og vært med på mange prosjekter før han gikk videre til start up verdenen med pakkeleveranser i Porterbuddy. Akkurat nå jobber han innen fintech med å revolusjonere B2B betalinger i ZTL Paymentsolutions AS.\n"
        }
      ]
    },
    {
      "intendedAudience": "Game devs, web devs, Rust and WASM enthusiasts. ",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Rust. WASM. Video games. I don't know about you, but that's pretty much all I need to get really excited. So excited, in fact, that I'm itching to put them together. ... but how? \n\nThis talk is about building and bundling Rust* games for the browser, starting from \"h-h-how do I even get started?!\" and \"this will never work\" to \"no way! It's actually running\". \n\n* no Rust experience needed ",
      "title": "Rust games ... in your browser",
      "room": "Room 4",
      "startTime": "2021-12-09T15:50",
      "endTime": "2021-12-09T16:50",
      "startTimeZulu": "2021-12-09T14:50:00Z",
      "endTimeZulu": "2021-12-09T15:50:00Z",
      "id": "08128ad9-0c1d-45a1-b4d2-d4585212cf84",
      "sessionId": "08128ad9-0c1d-45a1-b4d2-d4585212cf84",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T15:50",
      "startSlotZulu": "2021-12-09T14:50:00Z",
      "speakers": [
        {
          "name": "Thomas Heartman",
          "twitter": "@thomasheartman",
          "bio": "Thomas Heartman is a developer, speaker, and blogger based in Oslo. He is into pretty much anything he can get his hands on: web development, accessibility, Rust, Kubernetes, functional programming, and so much more. Thomas is also a co-organizer of the Rust Oslo meetup group and occasionally writes about Rust for LogRocket.\n\nWhen not doing tech, Thomas works as a group fitness instructor and also enjoys playing and writing music. "
        }
      ]
    },
    {
      "intendedAudience": "Software Engineers of all levels. If you have ever searched through code in your editor, with grep or on GitHub then you might be interested in this talk.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "This talk makes the case that you're probably navigating Java codebases too much inside your IDE, and too little in the browser. While it's comfortable to stay within IntelliJ, you're missing out on features from online code browsers that you didn't know you needed.\n\nIn this talk we cover the story of building a Java indexer (https://sourcegraph.github.io/lsif-java/) for Sourcegraph (https://about.sourcegraph.com/), a universal code search engine. You will learn why we built this Java indexer and how it’s different from alternatives such as GitHub’s code search. Expect live demos.",
      "title": "Rest your IDE and browse Java code online",
      "room": "Room 7",
      "startTime": "2021-12-09T15:50",
      "endTime": "2021-12-09T16:35",
      "startTimeZulu": "2021-12-09T14:50:00Z",
      "endTimeZulu": "2021-12-09T15:35:00Z",
      "id": "4b66f627-c8a8-499c-a88b-2f24f29b9037",
      "sessionId": "4b66f627-c8a8-499c-a88b-2f24f29b9037",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T15:50",
      "startSlotZulu": "2021-12-09T14:50:00Z",
      "speakers": [
        {
          "name": "Ólafur Pall Geirsson",
          "twitter": "olafurpg",
          "bio": "Olafur Geirsson is a software consultant at Scienta AS working on the Code Intelligence team at Sourcegraph. Olafur previously worked on Scala/JVM developer tooling at Twitter. He is the author of several projects including Scalafmt (code formatter), Scalafix (refactoring and linting tool) and Metals (language server)."
        }
      ]
    },
    {
      "intendedAudience": "Alle som jobber et sted der mennesker omtales som ressurser.",
      "length": "10",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "I denne lyntalen vil jeg bruke Ola-Ola og UML klassediagram for å forklare hvorfor det å omtale mennesker som ressurser ikke bare upresist, men også kan være skadelig.",
      "title": "Hvorfor Ola-Ola Ikke Er En Ressurs",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T09:30",
      "endTime": "2021-12-08T09:40",
      "startTimeZulu": "2021-12-08T08:30:00Z",
      "endTimeZulu": "2021-12-08T08:40:00Z",
      "id": "4698cf2a-7465-415a-9cd1-6bd39387f2b0",
      "sessionId": "4698cf2a-7465-415a-9cd1-6bd39387f2b0",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T09:30",
      "startSlotZulu": "2021-12-08T08:30:00Z",
      "speakers": [
        {
          "name": "Kent Inge Fagerland Simonsen",
          "twitter": "",
          "bio": "Kent Inge jobber som sjefskonsulent i TietoEVRY. En del av jobben her går med til å delta i møter og sammtaler der mennesker ofte omtales som ressurser. Kent Inge liker ikke denne ordbruken."
        }
      ]
    },
    {
      "intendedAudience": "Alle som er interessert i praktisk anvendelse av maskinlæring, eller hvorfor trafikktellinger er viktige og hva de kan brukes til. Det er ikke nødvendig med spesielle forkunnskaper, jeg gir en kjapp intro til de viktigste prinsippene i maskinlæring.\n",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Det å telle biler riktig er viktig. Det kan avgjøre om byen din får belønning fra staten fordi trafikken går ned, om bygda di får ny vei, og hvor mye vedlikehold veien får. Men det å telle biler er også overraskende vanskelig. Av og til svikter trafikkregistreringsutstyret, og teller for mange eller for få biler. Hvordan kan vi oppdage dette automatisk, og dermed sikre at trafikktallene blir riktige?\n\nI dette foredraget viser jeg hvordan vi har bygget en maskinlæringsmodell med nevrale nettverk til å oppdage unormale trafikktall. Vi tar utgangspunkt i trafikktall fra Statens vegvesens offentlige API, og bruker modellen til å avdekke avvik som ikke har blitt oppdaget før. Kom for å høre om effekten av koronahytteforbudet på Valdresflya, og hvordan vi løste mysteriet med den skyhøye trafikken på Ring 3 9. oktober 2017. På sikt er målet vårt å integrere modellen i Statens vegvesens trafikkdatasystem, slik at modellen kan bidra til riktigere trafikktall automatisk.",
      "title": "Hva er egentlig normalt? -- Avviksdeteksjon for Trafikkdata",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T14:10",
      "endTime": "2021-12-08T14:30",
      "startTimeZulu": "2021-12-08T13:10:00Z",
      "endTimeZulu": "2021-12-08T13:30:00Z",
      "id": "6bb3cd91-6196-40ac-8a4f-0929df7168c5",
      "sessionId": "6bb3cd91-6196-40ac-8a4f-0929df7168c5",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T13:30",
      "startSlotZulu": "2021-12-08T12:30:00Z",
      "speakers": [
        {
          "name": "Halvor Lund",
          "twitter": "halvorlund",
          "bio": "Halvor Lund works as a software developer in Bekk and in the Saga project at Statens vegvesen, which is building a data platform based on Google Cloud. He has a PhD in physics, and has previously worked as a researcher for ten years. He especially enjoys machine learning since it involves both research and programming. During the last year, he and Bekk's machine learning group in Trondheim have worked on developing a machine learning model for traffic data."
        }
      ]
    },
    {
      "intendedAudience": "For everyone.\nNo prior experience or knowledge required.",
      "length": "20",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "You may be a virtuoso on the keyboard, hacking away all day. But can you hack people?\nModern IT professionals must survive interaction with people every day. This lightning talk introduces some basic people hacks that will transform people around you into happy and forthcoming folks.",
      "title": "Fundamental People Skills",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T10:10",
      "endTime": "2021-12-08T10:30",
      "startTimeZulu": "2021-12-08T09:10:00Z",
      "endTimeZulu": "2021-12-08T09:30:00Z",
      "id": "757e592e-6905-4941-b34d-c59274348ed9",
      "sessionId": "757e592e-6905-4941-b34d-c59274348ed9",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T09:30",
      "startSlotZulu": "2021-12-08T08:30:00Z",
      "speakers": [
        {
          "name": "Kyrre Amanaborg",
          "twitter": "",
          "bio": "Kyrre works as a senior consultant at Experis Ciber, ManpowerGroup. In his 2,5 years there, he has been system administrator for The Norwegian Public Roads Administration system 'Vegvær', and developer for the Norwegian Tax Administration system 'Valutaregisteret'. He has held several presentations about soft skills, internally and externally.\nHe has about 20 years experience in the IT industry, and a master degree in psychology."
        }
      ]
    },
    {
      "intendedAudience": "Utviklere som bruker Grafana og som ønsker å få bedre kontroll på utvikling og forvaltning av dashboard. Lyntalen vil gi deg en oversikt hvordan du setter opp et fungerende utviklingsmiljø for Grafana-dashboards og og en demo av hvordan dette fungerer.\n\nDet kreves ingen spesielle forkunnskaper om Grafana for å høre på talen. ",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "En typisk konfigurering av et Grafana-dashboard består av timer (eller dager!) med pek og klikk. Etterfulgt av testing med ytterlige bruk av pek og klikk til man er fornøyd. Til slutt kan man (aller nådigst) eksportere en mer eller mindre forståelig Json konfigurasjon og legge den i Git.\n\nEtter noen måneder endrer man bare \"litt\" på et produksjonsdashboard for å ut en ny indikator eller endrer et Prometheus filter. Disse endringene blir dessverre aldri lagt inn i test-miljøer eller Git. Så kommer dagen hvor man ved et uhell sletter en del av dashboardet. Siden man ikke har siste versjon i Git eller noe annet sted så må man begynne prosessen forfra med en ny runde med pek og klikk. \n\nAll infrastruktur bør håndteres som kode med versjonsstyring og automatiske tester. Grafana støtter Jsonnet baserte templating. Dashboard-konfigurasjon kodes da med en selvvalgt editor med bruk av Grafonnet-biblioteket, deployes automatisk til et Docker basert utviklingsmiljø og verifiseres av ende-til-ende tester med Puppeter.",
      "title": "Smidig utvikling av Grafana-dashboard",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T14:55",
      "endTime": "2021-12-08T15:15",
      "startTimeZulu": "2021-12-08T13:55:00Z",
      "endTimeZulu": "2021-12-08T14:15:00Z",
      "id": "28f87968-be55-448e-a1b5-b06f9bc7cc78",
      "sessionId": "28f87968-be55-448e-a1b5-b06f9bc7cc78",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T14:40",
      "startSlotZulu": "2021-12-08T13:40:00Z",
      "speakers": [
        {
          "name": "Morten Udnæs",
          "twitter": "",
          "bio": "Morten jobber som TechLead i Fremtind Forsikring. Etter snart 30 år som utvikler lurer han fremdeles på om man blir klokere av erfaring eller bare skadet."
        }
      ]
    },
    {
      "intendedAudience": "Java Developers working with Docker ",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "Docker is the most widely used way to containerize your application.\nWith Docker Hub, it is easy to create and pull pre-created images. This is very convenient as you can use these images from Docker Hub to quickly build an image for your Java application.\nHowever, the naive way of creating custom Docker images for your Java applications comes with many security concerns. So, how do we make security an essential part of Docker images for Java?",
      "title": "5 Tips to Create Secure Docker Containers for Java Developers",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-09T14:40",
      "endTime": "2021-12-09T15:25",
      "startTimeZulu": "2021-12-09T13:40:00Z",
      "endTimeZulu": "2021-12-09T14:25:00Z",
      "id": "698a8b32-151d-4df1-a1a8-23d86cb197fa",
      "sessionId": "698a8b32-151d-4df1-a1a8-23d86cb197fa",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T14:40",
      "startSlotZulu": "2021-12-09T13:40:00Z",
      "speakers": [
        {
          "name": "Brian Vermeer",
          "twitter": "@BrianVerm",
          "bio": "Developer Advocate for Snyk, Java Champion, and Software Engineer with over a decade of hands-on experience in creating and maintaining software. He is passionate about Java, (Pure) Functional Programming and Cybersecurity. Brian is a JUG leader for the Virtual JUG and the NLJUG. He also co-leads the DevSecCon community and is a community manager for Foojay. He is a regular international speaker on mostly Java-related conferences like JavaOne, Devnexus, Devoxx, Jfokus, JavaZone and many more. Besides all that, Brian is a military reserve for the Royal Netherlands Air Force and a Taekwondo Master / Teacher."
        }
      ]
    },
    {
      "intendedAudience": "Foredraget krever ingen spesielle forkunnskaper innen personvern og informasjonssikkerhet. Generell IT-kompetanse er en fordel, men ikke noe krav. Alle med en rolle innen tjenesteutvikling, IKT, interesse for informasjonssikkerhet og personvern,  vil ha stor nytteverdi av dette foredraget.",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "Digitaliseringens tidsalder er her og veien videre blir mer omfattende og sammenvevd. Deling av data, jobbe i skyen og AI roboter/boter som automatiserer beslutninger blir en forutsetning for gode innbyggertjenester. Potensielt kaster også GDPR og Schrems II juridiske skiftenøkler inn dette digitale maskineriet.\n\nDette skaper store utfordringer oss “Guardians of the citizens privacy”; vi skal sørge for godt personvern og god informasjonssikkerhet uten å opptre som en “våt klut” i den hurtige digitale omstillingen som skjer i Oslo kommune.\nForedraget handler om gjøre seg forstått på tvers av fagdisipliner (“I Am Groot” - Groot), få folk til bevege seg i takt (\"Dance Off, Bro.\" - Peter Quill) etter en smidig plan (“It's barely a concept.” - Gamora), og ikke minst takle hindringer underveis (“You said it yourself, bitch. We're the Guardians of the Galaxy.” - Peter Quill)\n\nHvordan gjør vi dette? Arsenalet vårt består av tverrfaglig samarbeid, poding av personvern inn i produktteamene, smidig tilnærming og ikke minst en god porsjon selvironi. Med en god cocktail av disse ingrediensene skal vi unngå å realisere de dystoptiske spådommene fra mang en science fiction film.\n\nDette er hva vi forteller om og komme med eksempler som viser både hva vi har gjort, utfordringene, mulighetene og selvfølgelig feilene vi har gjort underveis.",
      "title": "Guardians of the citizens privacy - Det er det vi er",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-09T15:50",
      "endTime": "2021-12-09T16:35",
      "startTimeZulu": "2021-12-09T14:50:00Z",
      "endTimeZulu": "2021-12-09T15:35:00Z",
      "id": "0e3a5b0f-8de4-4f10-9b2c-b7f62f49a4a9",
      "sessionId": "0e3a5b0f-8de4-4f10-9b2c-b7f62f49a4a9",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T15:50",
      "startSlotZulu": "2021-12-09T14:50:00Z",
      "speakers": [
        {
          "name": "Rune Schumann",
          "twitter": "@rune7mann",
          "bio": "Rune Schumann er avdelingsdirektør for JIPI-avdelingen (Jus, Informasjonssikkerhet, Personvern og IKT) i Origo Digi, Oslo kommune. Rune har fra tidligere lang erfaring som rådgiver, virksomhetsarkitekt, løsningsarkitekt og systemutvikler både i konsulentbransjen og innen produktutvikling.\nDen faglige interessen de siste 10 årene har dreid seg mer over mot informasjonssikkerhet og personvern, men med et holistisk syn sikkerhet i virksomheter. Det er samspillet mellom teknologi, mennesker og organisasjon som Rune er opptatt av slik at forutsetningene for god informasjonssikkerhet og et godt personvern kan være tilstede."
        },
        {
          "name": "Kathinka Fjærli",
          "bio": "Jurist i JIPI-avdelingen (Jus, Informasjonssikkerhet, Personvern og IKT) i Origo Digi, Oslo kommune. Kathinka har lang erfaring fra offentlig sektor og har jobbet både i Tolletaten og Skatteeaten som jurist. De senere årene har hun jobbet spesifikt med personvern som jurist i større IT prosjekt. Hun har stort engasjement for digitalisering og samspillet mellom juss og teknologi. Tverrfaglig arbeid og fokus på å forstå hverandre, gir de beste løsningene for fremtiden."
        }
      ]
    },
    {
      "intendedAudience": "Alle som er interessert i datadreven utvikling, datavitenskap, lingvistikk, semantikk, lovdata og offentlige data. Ingen forkunnskaper påkrevd, men en liten fordel om publikum kan lese Python og Java.",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "Tenk deg at du har et virrvarr av ustrukturere filer du gjerne skulle hentet data ut av. Og når du først har disse dataene, så ønsker du kunnskap! Ved å kombinere språkprosesseringsteknikker og kunnskapsgrafer kan vi åpne dører vi ikke visste eksisterte. Særlig innenfor offentlig sektor og lovdata. Dette foredraget vil vise deg hvordan Capgemini tar i bruk slike teknologier, implementert i Python og Java, for Sjøfartsdirektoratet til å dra data ut fra forskrifter og transformerer disse til semantiske kunnskapsgrafer. Der kunnskapsgrafene utgjør datagrunnlaget for direktoratets applikasjoner. Du vil også få høre om hvilke fabelaktige muligher som ligger i kunnskapsgrafer og hvilke beregninger vi kan gjøre rett i grafen.",
      "title": "Fra tekst til kunnskap",
      "room": "Room 2",
      "startTime": "2021-12-09T09:30",
      "endTime": "2021-12-09T10:15",
      "startTimeZulu": "2021-12-09T08:30:00Z",
      "endTimeZulu": "2021-12-09T09:15:00Z",
      "id": "114c7fae-a69b-4ff4-8b04-345a2e613450",
      "sessionId": "114c7fae-a69b-4ff4-8b04-345a2e613450",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T09:30",
      "startSlotZulu": "2021-12-09T08:30:00Z",
      "speakers": [
        {
          "name": "Veronika Heimsbakk",
          "twitter": "veronikaheim",
          "bio": "Veronika er senior semantikknerd hos Capgemini og har i hele sin yrkeskarriere jobbet som utvikler og informasjonsarkitekt innenfor kunnskapsgrafer. Hun har en forkjærlighet for å finne struktur og kunnskap i kaotiske og ustrukturerte data."
        }
      ]
    },
    {
      "intendedAudience": "Programmers and architects working on a Java/Kotlin stack with http(s) communication",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "So, I decided to make my own Certificate Authority. Kidding. Not kidding.\n\nHTTPS and especially client certificates holds the promise to zero-trust architectures of the future and gives a good way to harden your internal communication paths.\n\nHave you ever gotten the feared error message \"PKIX Path Building Failed\" or just the simple and unhelpful \"SSL error\" in your browser?\n\nYou may have learned about and thought you understood the theory of public-private key encryption. Even so, setting up a server to demand client certificates, issuing certificates and making sure each part knows to trust each other is tricky business.\n\nIn this talk we will explore the necessary code to create certificates, start an app server with https instead of http, making the client trust a self-signed server certificate and make the server request a certificate from the client.\n\nAlong the way, you will learn about trust stores, key stores, SSL context and what the dreaded PKIX path validation failure means.",
      "title": "Master https in your application",
      "room": "Room 7",
      "startTime": "2021-12-09T11:50",
      "endTime": "2021-12-09T12:50",
      "startTimeZulu": "2021-12-09T10:50:00Z",
      "endTimeZulu": "2021-12-09T11:50:00Z",
      "id": "4f28b2e2-8cfe-4215-a4a2-620264e79059",
      "sessionId": "4f28b2e2-8cfe-4215-a4a2-620264e79059",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T11:50",
      "startSlotZulu": "2021-12-09T10:50:00Z",
      "speakers": [
        {
          "name": "Johannes Brodwall",
          "twitter": "jhannes",
          "bio": "Johannes Brodwall works as principal software engineer for Sopra Steria. By day he builds software that on a good day helps save lives. In the evenings he likes to dive deep into the details of the technology underlying secured software. Even though TLS and HTTPS is universally used it is poorly understood. Johannes hopes to change this"
        }
      ]
    },
    {
      "intendedAudience": "Programmerere, prosjektledere, arkitekter",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "Planeten lider, det haster å jobbe mer bærekraftig, og det virker svært abstrakt: Hvordan skal du som programmerer kunne forholde deg til f.eks. FNs bærekraftmål, og gjøre det så konkret at du kan lage systemer som er bærekraftige - for eksempel som en kvalitet i \"Definition of Done\"? I dette foredraget vil jeg gi en kort intro til bærekraft, fortelle om de mest aktuelle strategiske metodene, og gi eksempler på hvordan dette kan påvirke hvordan du programmerer. Målet med foredraget er å gi deg mulighet til å ta del i samtalene hos din arbeidsgiver om hvordan dere kan jobbe mer bærekraftig, og omsette det i systemdesign.",
      "title": "Slik kan du designe og programmere bærekraftig",
      "room": "Room 7",
      "startTime": "2021-12-09T13:30",
      "endTime": "2021-12-09T14:15",
      "startTimeZulu": "2021-12-09T12:30:00Z",
      "endTimeZulu": "2021-12-09T13:15:00Z",
      "id": "f5375387-1c8d-4fa3-b0bd-5f7fd8a748ca",
      "sessionId": "f5375387-1c8d-4fa3-b0bd-5f7fd8a748ca",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T13:30",
      "startSlotZulu": "2021-12-09T12:30:00Z",
      "speakers": [
        {
          "name": "Simen Sommerfeldt",
          "twitter": "@sisomm",
          "bio": "Simen er CTO i Bouvet, og jobber med kunnskapsformidling og forretningsutvikling. Han er en av grunnleggerne av \"Lær Kidsa Koding\", og er medforfatter av boken \"Personvern og GDPR i Praksis\". I det siste har Simen engasjert seg i \"Grønn Utvikling for IT\" (GoForIT): Et samarbeid mellom akademia og arbeidslivet for å innføre bærekraft i utdanningene, på en måte som er anvendelig og forstått i arbeidslivet"
        }
      ]
    },
    {
      "intendedAudience": "Java developers who want to expose metrics from their application.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "Java developers have to choose from a variety of libraries when they want to export metrics in their Java applications. There is the MicroProfile standard that emerged out of the popular Dropwizard library. There is Micrometer which was originally developed as part of the Spring framework. And there is the Java client library provided by the Prometheus project itself.\n\nThis talk gives an overview of the current state of Metrics libraries in the Java ecosystem. We present the differences, pros, and cons of the current options, and highlight some points that should be considered when deciding which library to choose.",
      "title": "State of the Java Metrics Libraries",
      "room": "Room 1 (Prerecorded)",
      "startTime": "2021-12-09T10:40",
      "endTime": "2021-12-09T11:25",
      "startTimeZulu": "2021-12-09T09:40:00Z",
      "endTimeZulu": "2021-12-09T10:25:00Z",
      "id": "78d1e902-a7c7-498b-999f-87c6e0fa24a6",
      "sessionId": "78d1e902-a7c7-498b-999f-87c6e0fa24a6",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T10:40",
      "startSlotZulu": "2021-12-09T09:40:00Z",
      "speakers": [
        {
          "name": "Fabian Stäber",
          "twitter": "fstabr",
          "bio": "Dr. Fabian Stäber is engineering manager and monitoring enthusiast at Instana. In his free time, he is maintainer of the official Prometheus client_java library. His academic work was on decentralized peer-to-peer networks."
        }
      ]
    },
    {
      "intendedAudience": "Everyone who is somehow involved in software development.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "What does it mean to be a good software developer? What story can I tell myself that gives me direction and confidence that I am doing a good job? That provides the psychological safety that we all need as humans to function well and be happy? The narrative offered by the software craftsman metaphor is one such story - by far the most prevalent one in today's industry - but could there be others? What are the implications of the craftsman narrative? Does it have any short-comings or things that it fails to mention? Could it be misleading or even harmful? And most importantly: if I don't feel at home in the craftsmanship narrative, am I still allowed to think of myself as a good developer? What will my peers think of me? Is there life beyond craftsmanship? This is the story of a software developer identity crisis: of feeling increasingly estranged from the craftsmanship narrative and finding a new identity and sense of worth outside that tale.",
      "title": "Death of a Craftsman",
      "room": "Room 7",
      "startTime": "2021-12-08T10:40",
      "endTime": "2021-12-08T11:25",
      "startTimeZulu": "2021-12-08T09:40:00Z",
      "endTimeZulu": "2021-12-08T10:25:00Z",
      "id": "11af84e9-bbda-40d8-8ab5-a3c4b67e01b7",
      "sessionId": "11af84e9-bbda-40d8-8ab5-a3c4b67e01b7",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T10:40",
      "startSlotZulu": "2021-12-08T09:40:00Z",
      "speakers": [
        {
          "name": "Einar W. Høst",
          "twitter": "@einarwh",
          "bio": "Einar W. Høst is not a software craftsman; he is a genuine, PhD-certified ivory tower zealot. His heretic views include thinking away from the keyboard and making drawings to understand things better. He does domain modelling, API design and computer programming at NRK."
        }
      ]
    },
    {
      "intendedAudience": "Alle",
      "length": "60",
      "format": "presentation",
      "language": "no",
      "abstract": "Hundrevis av utviklere i over hundre team kan ikke ta feil: Autonomi er ved siden av sosioteknisk det kuleste ordet i verden. Men vi jobber jo i Norges største byråkrati, med sjefer som fortsatt tror autonomi betyr hjemme alene-fest. Men NAV er ikke en fest. Vi har ansvarlige team som trenger å eie problem og løsning, selv om de har veldig ulike problemer å løse - med ulike utgangspunkt og teknologier. Hvordan får vi disse teamene til å gå i samme retning?\n\nI denne presentasjonen forteller vi hvordan vi skaper en felles retning for team i NAV, og hvordan vi bruker det samme budskapet til å skape forståelse for moderne systemutvikling utenfor teamene.",
      "title": "Alignment in the age of autonomy",
      "room": "Room 7",
      "startTime": "2021-12-08T11:50",
      "endTime": "2021-12-08T12:50",
      "startTimeZulu": "2021-12-08T10:50:00Z",
      "endTimeZulu": "2021-12-08T11:50:00Z",
      "id": "5b3de305-ce4a-46ce-b2e2-d9ecf2ece2e8",
      "sessionId": "5b3de305-ce4a-46ce-b2e2-d9ecf2ece2e8",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T11:50",
      "startSlotZulu": "2021-12-08T10:50:00Z",
      "speakers": [
        {
          "name": "Truls Jørgensen",
          "twitter": "trulsjor",
          "bio": "Truls er principal engineer i NAV. Vil skrive endringsdyktig software, og må derfor også jobbe med å bygge en organisasjon som muliggjør dette."
        },
        {
          "name": "Audun Fauchald Strand",
          "twitter": "audunstrand",
          "bio": "Audun er principal engineer i NAV. Dermed får han oppfylt drømmen sin om å få kode og bestemme samtidig. Han blir glad av utviklingsfart og tullete navn, og elsker å høre om når ting gikk galt.  "
        }
      ]
    },
    {
      "intendedAudience": "Developers and others interested in learning how to write automatic accessbility tests",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Accessibility testing tools are of great help in making an accessible website. Automatic accessibility tests can be of even greater help, freeing up time to focus on the changes that will make your website better for everyone. \n\nIn this talk you'll learn how to set up and write your own automatic accessibility tests. While doing this I will also cover some of the most common accessibility errors that can be discovered automatically and how to fix them. \n\nTechnology covered: axe-core, axe-jest and axe-cypress",
      "title": "Automatic Accessibility Testing for All",
      "room": "Room 6",
      "startTime": "2021-12-09T15:50",
      "endTime": "2021-12-09T16:50",
      "registerLoc": "https://moosehead.javazone.no/#/register/automatic_accessibility_testing_for_all",
      "startTimeZulu": "2021-12-09T14:50:00Z",
      "endTimeZulu": "2021-12-09T15:50:00Z",
      "id": "4012fe25-9319-49ab-8f6f-7891d7c74632",
      "sessionId": "4012fe25-9319-49ab-8f6f-7891d7c74632",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T15:50",
      "startSlotZulu": "2021-12-09T14:50:00Z",
      "speakers": [
        {
          "name": "Cecilie Haugstvedt",
          "twitter": "@chaugstvedt",
          "bio": "Cecilie is an accessibility enthusiast working as a test consultant.  She loves working in agile teams, is a proponent of automating all manual processes, and has a special interest in making applications accessible for all.\n"
        }
      ]
    },
    {
      "intendedAudience": "This session is for anyone interested in how AI and Machine Learning can be used in order to give a better and more humane user experience. In addition I will also cover topics such as ethics in AI and tools that can help reduce bias when using AI in our applications. ",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "Research have shown that emotions play an integral role in decision making, cognition, perception, learning and more. If we want our computers to be intelligent and be able to interact with us we need to ensure that they are able to recognize, understand and express emotions. This is the basic assumption of the field of Affective Computing. In this talk I will give an overview of Affective computing and how it can be applied in order to make our interaction with machines more suitable to us as humans.\n\nFirst I will give an introduction to the field starting with established findings from the field of psychology on how we best can measure emotions.\n\nThen I will describe how the field of Affective Computing has transformed from its origin in the 90’s until now when it is an established research field. I will highlight some of the technology enablers that has made Affective Computing a hot topic nowadays and give some examples of API and services that we as developers can use as of today.\n\nIn the second part of my talk I will give some examples on application scenarios across various fields (retail, medical, education and social). After that I will be show casing what is in the front line now. I will conclude my presentation with some recommendations on how this affects us as developers going forward.\n",
      "title": "Affective Computing – bringing humans and machines closer through emotions",
      "room": "Room 5",
      "startTime": "2021-12-08T14:40",
      "endTime": "2021-12-08T15:25",
      "startTimeZulu": "2021-12-08T13:40:00Z",
      "endTimeZulu": "2021-12-08T14:25:00Z",
      "id": "ebc896c8-1eed-4fd6-aa6d-ff6b9d3e5904",
      "sessionId": "ebc896c8-1eed-4fd6-aa6d-ff6b9d3e5904",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T14:40",
      "startSlotZulu": "2021-12-08T13:40:00Z",
      "speakers": [
        {
          "name": "Håkan Silfvernagel",
          "twitter": "agrevlis",
          "bio": "Håkan holds a Master of Science degree in Electrical Engineering and in addition, he holds a Master’s degree in Leadership and Organizational behavior. He has also taken courses on university level in psychology, interaction design and human-computer interaction. He has 20 years’ experience of software development in various positions such as developer, tester, architect, project manager, scrum master, practice manager and team lead. \n\nHåkan is Chairman of the local chapter of the Norwegian .NET User Group Oslo (NNUG) and is active as an Ambassador for Oslo.AI the local chapter for the global City.AI community. In addition, he is the co-founder of AI42, an online school for learning about AI and Data Science.\n\nHåkan is a Microsoft Most Valuable Professional (MVP) in AI. \n\nCurrently Håkan is working as Manager AI and Big Data at Miles AS, a Norwegian consultancy company.\n"
        }
      ]
    },
    {
      "intendedAudience": "Presentasjonen passer for alle som jobber med andre mennesker og som har opplevd å ikke bli forstått, eller å ha sagt noe som mottaker har misforstått. Målet med presentasjonen er å vise hvordan dette skjer i praksis, også med erfarne mennesker, og gi noen enkle pekere for hvordan unngå det. Presentasjonen passer både for utviklere, designers og folk med slips. ",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Natt til 8. november 2018 kommer «KNM Helge Ingstad»  seilende nordfra inn i Hjeltefjorden, kort tid etter har den et litt ugreit møte med «Sola TS». \n\nHva skjedde i minuttene før de to kolliderte? Og hva har det med oss å gjøre? \n\nDette er historien bak utsagnet “Det blir en kollisjon her da”, og hva vi kan lære fra Helge Ingstad-ulykken om kommunikasjon.",
      "title": "- Ja, da blir det kollisjon, da",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-09T12:50",
      "endTime": "2021-12-09T13:10",
      "startTimeZulu": "2021-12-09T11:50:00Z",
      "endTimeZulu": "2021-12-09T12:10:00Z",
      "id": "96c4a078-bb47-48a4-a459-a5f16e98a6d1",
      "sessionId": "96c4a078-bb47-48a4-a459-a5f16e98a6d1",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T11:50",
      "startSlotZulu": "2021-12-09T10:50:00Z",
      "speakers": [
        {
          "name": "Håvard Hvassing",
          "twitter": "hhvassing",
          "bio": "Håvard is an experienced product- and project manager, who aims to reduce friction"
        }
      ]
    },
    {
      "intendedAudience": "Utviklere som jobber med persondata og ønsker å en kjapp recap av GDPR og en innføring i hvordan situasjonen er akkurat nå.",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Landskapet beveger seg fort også i personvernets verden og GDPR ble \"strengere\" i løpet av 2020 på grunn av rettskjennelser som Schrems II. Kan man faktisk lovlig bruke offentlig sky nå? Hvordan forholder man seg til GDPR som utvikler nå? Dette blir en kjapp recap av hva GDPR er, hva som har endret seg og hvordan det påvirker din hverdag som utvikler.",
      "title": "Personvern i 2021 - Hva må du vite som utvikler?",
      "room": "Room 2",
      "startTime": "2021-12-08T13:30",
      "endTime": "2021-12-08T13:50",
      "startTimeZulu": "2021-12-08T12:30:00Z",
      "endTimeZulu": "2021-12-08T12:50:00Z",
      "id": "3f3b8ee6-2fba-4a46-b65c-d382a3beb99c",
      "sessionId": "3f3b8ee6-2fba-4a46-b65c-d382a3beb99c",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T13:30",
      "startSlotZulu": "2021-12-08T12:30:00Z",
      "speakers": [
        {
          "name": "Nikolai Norman Andersen",
          "twitter": "nikolaiii",
          "bio": "Nikolai er teknologisjef i Variant Oslo. Han har tidligere vært DPO/Personvernsombud i en bedrift som leverte SaaS-tjenester til fastleger i Norge, Danmark og Tyskland. Han er sertifisert av IAPP med personvernsertifiseringene CIPP/E og CIPPM.\n"
        }
      ]
    },
    {
      "intendedAudience": "Anyone running Java in a container environment already or interested to get started easily. The will be a lightning demo of configuring Jib in an existing Java app using Maven.",
      "length": "20",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "Docker has undoubtedly been the most popular choice for building container images since the first version was released back in 2015. A lot has happened since then, and several problems and challenges have surfaced when using Docker in a Kubernetes/cloud native world.\n\nThis session will address the problems building Java applications using Docker, and we will explore a new option for building Java container images using Google's Jib building tool for replacing the old clunky Docker as we know it today.",
      "title": "Building Java container images using Jib",
      "room": "Room 2",
      "startTime": "2021-12-08T12:20",
      "endTime": "2021-12-08T12:40",
      "startTimeZulu": "2021-12-08T11:20:00Z",
      "endTimeZulu": "2021-12-08T11:40:00Z",
      "id": "d7440b82-137a-496e-a345-87e04367f536",
      "sessionId": "d7440b82-137a-496e-a345-87e04367f536",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T11:50",
      "startSlotZulu": "2021-12-08T10:50:00Z",
      "speakers": [
        {
          "name": "Øyvind Ødegård",
          "twitter": "",
          "bio": "Øyvind Ødegård is a passionate DevOps engineer and tech manager at Distribution Innovation. He cares about the whole developer experience; from development to operations and observability. He is also an avid GitHub open sourcer and cloud native tools hippie."
        }
      ]
    },
    {
      "intendedAudience": "Any designer, frontend-developer or developer that touches frontend (html/css/js). ",
      "length": "20",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "tl;dr; A talk on how a design system helps designers and developers to \"speak the same language\"/work better together with a Design System.\n\nToday, more and more development is done in tight relation with designers and \nUX-designer, triggering the need for a design system that is tightly coupled \nwith both design and code. \n\nUp until recent years, the design communication has gone one way, from the \ndesigners to the developers. This talk covers the process I came up with on \nsecuring design/develop communication both ways when building a design system. \n\nWe will cover generation of preprocessor styles with design tokens and how we \ngenerate our design systems continuously",
      "title": "Enabling developers and designers to speak the same language",
      "room": "Room 2",
      "startTime": "2021-12-09T15:20",
      "endTime": "2021-12-09T15:40",
      "startTimeZulu": "2021-12-09T14:20:00Z",
      "endTimeZulu": "2021-12-09T14:40:00Z",
      "id": "d2e76d50-caee-499e-b18e-851efe7e4977",
      "sessionId": "d2e76d50-caee-499e-b18e-851efe7e4977",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T14:40",
      "startSlotZulu": "2021-12-09T13:40:00Z",
      "speakers": [
        {
          "name": "Alexander Vassbotn Røyne-Helgesen",
          "twitter": "phun_ky",
          "bio": "Alexander is a creative frontender, specializing in UX, accessibility, universal design, frontend-architecture and design systems. He is passionate with open source projects and love to dabble with new emerging technologies related to frontend. With over 20 years of frontend experience, he has earned the right to be called a veteran. He is a lover of life, technologist at hear. If he isn't coding, he cooks and love whisky and cigars. Oh, and coffee, he LOVES coffee!"
        }
      ]
    },
    {
      "intendedAudience": "All backend developers, but those with some experience in writing the database schema for their applications will get the most value out of the talk. DBA's that feel uninvolved in application development. Anyone who likes to hear of others making a mess in production. \n\n",
      "length": "20",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "Did you know that an update query to an oracle database will lock access to the table completely? Did you know that updating a database table with several billion rows takes almost half a day? Did you know that cancelling and rolling back such a query midway takes even longer? Well, we do, now. Let us tell you the story, and what we've learned from it.",
      "title": "Dangers of database-upgrades: A Core Banking Mishap",
      "room": "Room 2",
      "startTime": "2021-12-08T16:20",
      "endTime": "2021-12-08T16:40",
      "startTimeZulu": "2021-12-08T15:20:00Z",
      "endTimeZulu": "2021-12-08T15:40:00Z",
      "id": "f20fe5e4-03e1-46b6-9546-00e6d30af89b",
      "sessionId": "f20fe5e4-03e1-46b6-9546-00e6d30af89b",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T15:50",
      "startSlotZulu": "2021-12-08T14:50:00Z",
      "speakers": [
        {
          "name": "Øyvind Svendsen ",
          "twitter": "@oysvendsen",
          "bio": "Software-developer at TietoEVRY, working on core-banking-solution in java/Kotlin for the past three years. Background in astronomy and physics simulations in python. Turned to system development for the fun of it!"
        }
      ]
    },
    {
      "intendedAudience": "The talk is aimed at development teams, which includes project managers, product owners, developers or team leads.\n\nAttendees will get a list of concise actions or changes you can make in a project to improve the quality of your product and reduce technical debt.",
      "length": "20",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "Complexity in projects has steadily increased and with it components and modules have become large and ugly beasts who I know have kept a lot of us up at night. \n\nThis presentation focuses on techniques and process changes to make the monsters a little less scary",
      "title": "Untangling project spaghetti",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T11:50",
      "endTime": "2021-12-08T12:10",
      "startTimeZulu": "2021-12-08T10:50:00Z",
      "endTimeZulu": "2021-12-08T11:10:00Z",
      "id": "e8e2c20c-3a13-4290-bc71-422bd209886d",
      "sessionId": "e8e2c20c-3a13-4290-bc71-422bd209886d",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T11:50",
      "startSlotZulu": "2021-12-08T10:50:00Z",
      "speakers": [
        {
          "name": "Patrick Monslaup",
          "twitter": "",
          "bio": "Patrick Monslaup is a technical manager (fagleder), team lead and full-stack developer in Knowit Experience Bergen. As a technical manager he works on facilitating professional development, onboarding, and collaboration in general. He is especially interested in improving how we work together, often focusing on soft skills, team dynamics, process and code quality."
        }
      ]
    },
    {
      "intendedAudience": "Hvem som helst med interesse for NAV, samfunnet, maskinlæring, analyse, data mining. Får først og fremst en god historie om en aktuell hendelse. Ingen erfaring nødvendig.",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Høsten 2019 ble det kjent at NAV i en årrekke har feiltolket lovverket rundt opphold i utlandet, og at mange derfor hadde fått feilaktig avslag på eller avkorting av ytelser. Dette ble kjent som \"EØS-skandalen\". Det ble lovet fra øverste hold at vi skulle snu hver eneste stein for å finne alle som var berørte av skandalen, slik at feilaktig behandlede saker kunne rettes opp. Dette er historien om hvordan vi gravde gjennom fjell av ustrukturerte data fra flere generasjoner med IT-systemer, databaser og arkiver for å identifisere potensielle \"EØS-saker\".",
      "title": "EØS-skandalen: hvordan vi snudde hver stein",
      "room": "Room 2",
      "startTime": "2021-12-08T13:50",
      "endTime": "2021-12-08T14:10",
      "startTimeZulu": "2021-12-08T12:50:00Z",
      "endTimeZulu": "2021-12-08T13:10:00Z",
      "id": "fe110bd3-49e4-4a47-93ec-c179ea497785",
      "sessionId": "fe110bd3-49e4-4a47-93ec-c179ea497785",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T13:30",
      "startSlotZulu": "2021-12-08T12:30:00Z",
      "speakers": [
        {
          "name": "Gøran Berntsen",
          "twitter": "@gorzan",
          "bio": "Produkteier i NAV for nais.io. Analytikerhode. Liker SQL og Python."
        }
      ]
    },
    {
      "intendedAudience": "Utviklere, driftsfolk og andre nerder.",
      "length": "10",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Egen server hjemme sier du? Og eget domene? Bytter ISPen din IP hele tiden og du trenger en dynamisk DNS-tjeneste?\n\nJeg viser deg hvordan du enkelt og sikkert kan gjøre dette selv på AWS med et lite python-script, shell-script en cron-jobb og noen enkle AWS-tjenester.\n\nNB: Kode i slides.",
      "title": "Dynamisk DNS med AWS Lambda og Route 53",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T15:50",
      "endTime": "2021-12-08T16:00",
      "startTimeZulu": "2021-12-08T14:50:00Z",
      "endTimeZulu": "2021-12-08T15:00:00Z",
      "id": "3efdb3b6-fbbd-4f10-b553-561e31d6ef37",
      "sessionId": "3efdb3b6-fbbd-4f10-b553-561e31d6ef37",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T15:50",
      "startSlotZulu": "2021-12-08T14:50:00Z",
      "speakers": [
        {
          "name": "Jan Henrik Gundelsby",
          "twitter": "@janhenrik",
          "bio": "Jan Henrik har over 20 års erfaring som utvikler, arkitekt og teknologileder i store prosjekter og programmer. Han leder for tiden forskning og utvikling i Knowit, der han jobber med å tette gapet mellom akademia og praksis - med fokus på digitalisering, storskala smidig og plattformtankesett. \n\nMen den iboende nerden i han er ikke borte."
        }
      ]
    },
    {
      "intendedAudience": "Dette foredraget passer for deg som ønsker å komme lettere i kontakt med kreativiteen din. Foredraget er lett og inspirerende, men klarer likevel å gå overraskende dypt inn i flere tema. Du vil forhåpentligvis sitte igjen med noen “aha”-opplevelser, og noen konkrete verktøy du kan ta i bruk med en gang!",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Vi tenker alle kreativt hver dag.\n\nSmå, enkle grep lar oss lettere komme i kontakt med vårt kreative potensiale.\n\nEnkle verktøy vi alt bruker ubevist, sammen med grunnleggende forståelse av hvordan vi tenker, lar oss tenke mer kreativt når vi trenger det.\n\nLa meg dele disse grepene, verktøyene og forståelsen om tenking med deg!",
      "title": "Det skader ikke å tenke kreativt",
      "room": "Room 2",
      "startTime": "2021-12-09T16:30",
      "endTime": "2021-12-09T16:50",
      "startTimeZulu": "2021-12-09T15:30:00Z",
      "endTimeZulu": "2021-12-09T15:50:00Z",
      "id": "435a6055-5733-4b01-818d-bdce3360a0f5",
      "sessionId": "435a6055-5733-4b01-818d-bdce3360a0f5",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T15:50",
      "startSlotZulu": "2021-12-09T14:50:00Z",
      "speakers": [
        {
          "name": "Dag Frode Solberg",
          "twitter": "",
          "bio": "Uansett om det er snakk om treverk, pappmasje, tørr humor eller kode har Dag Frode alltid vært glad i å skape. Han har 3 års erfaring som utvikler i Bekk og mer enn et kvart århundre med kreative prosjekter."
        }
      ]
    },
    {
      "intendedAudience": "Teknologientusiaster",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "På dagtid hjelper jeg organisasjoner med å bygge en DevOps-kultur og å få mest utav moderne applikasjons-plattformer som Kubernetes. På kveldstid gjør jeg det samme, men for min egen familie.\n\nI familien vår kjører vi sprint-review og planning hver søndag og har et serverrom i kjelleren med et stappfullt Kubernetes-cluster som kjører familiens CRM, wiki, streaming, fillagring, databaser, git, og brukerhåndtering for single sign on i tillegg til en hel mengde med smarthus automatisering.\n\nHele infrastrukturen overvåkes med Prometheus, Grafana, og Jaeger med push varsling i det øyeblikket tjenester skulle gå ned. Zero-trust praktiseres ved at ingen tjenester har tilganger til mer enn det de faktisk trenger og er implementert ved å bruke traffikk-regler i Kubernetes, Calico og Istio. Alt ligger selvfølgelig i Git og er satt opp med Terraform.\n\nI dette foredraget går jeg gjennom det tekniske oppsettet for familien, lag for lag; nettverk, hardware, Kubernetes cluster, og applikasjoner. Mine erfaringer, hva som har fungert bra og hvilken hva som har fungert dårligere.\n\nJeg slår også et slag for at man ikke må hoppe i en sky – og at det er fullt mulig å få til mye av den samme smidigheten on-prem om man ønsker det og det uten bruk av dyre og proprietære løsninger.\n\nVelkommen til F Corp – pull requests are welcome 🙌",
      "title": "F(amily) Corp",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T11:20",
      "endTime": "2021-12-08T11:40",
      "startTimeZulu": "2021-12-08T10:20:00Z",
      "endTimeZulu": "2021-12-08T10:40:00Z",
      "id": "26814094-8307-4f0b-af09-dd4edb280730",
      "sessionId": "26814094-8307-4f0b-af09-dd4edb280730",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T10:40",
      "startSlotZulu": "2021-12-08T09:40:00Z",
      "speakers": [
        {
          "name": "Hans Kristian Flaatten",
          "twitter": "Starefossen",
          "bio": " Experienced SRE- and Platform Engineering Team Lead with proven track record of leading engineering teams that build and operate Cloud Native and Kubernetes-based application platforms for customers primarily in public government, telecom, banking and insurance sectors.\n\nChief Consultant and DevOps Practice Lead for TietoEVRY where I drive build culture and competency within DevOps, Site Reliability Engineering (SRE) and Cloud Native practices internally and for our customers.\n\nOpen Source, DevOps, and Cloud Native evangelist. Member of the Node.js Foundation where I manage test and release of official Node.js versions and the official Docker Image for Node.js with 10M+ downloads.\n\nPreviously Systems Developer / Systems Architect at the Norwegian Trekking Association (DNT) where I lead the transition to a microservice oriented architecture on immutable infrastructure with contianers. I was also responsible for DNT’s Open Data initiative through Nasjonal Turbase / UT.no.\n\nOrganiser of DevOps Bergen, Bergen NoSQL User Groups, and Co-Organiser of the DevOps Days Oslo Conference. I speak at various other local, and national, user groups and conferences on Open Source, open data, Cloud Native, and other new and exciting technologies and practices."
        }
      ]
    },
    {
      "intendedAudience": "Sesjonen burde være nyttig for alle med en interesse for maskinlæring og IoT.\n\nLitt erfaring med maskinlæring, TensorFlow, og mikrokontrollerprogrammering vil være nyttig men ikke nødvendig.",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "I dagens samfunn omringer vi oss med sensorer koblet til små mikrokontrollere som samler inn alt mulig av data. Dette åpner for mange spennende muligheter innen maskinlæring og kunstig intelligens, samtidig blir flere og flere mer ops på personvern og sensordata som bilder og lyd kan definitivt være problematisk.\n\nI denne presentasjonen går vi gjennom hvordan man kan bruke TensorFlow Lite til å kjøre TensorFlow-modeller på en mikrokontroller slik at man slipper å sende potensielt sensitiv data over nettverk.",
      "title": "Mikrokontrollere og maskinlæring med TensorFlow Lite",
      "room": "Room 2",
      "startTime": "2021-12-09T12:30",
      "endTime": "2021-12-09T12:50",
      "startTimeZulu": "2021-12-09T11:30:00Z",
      "endTimeZulu": "2021-12-09T11:50:00Z",
      "id": "f74367bf-b567-4ac3-898f-e1c29d5b3cde",
      "sessionId": "f74367bf-b567-4ac3-898f-e1c29d5b3cde",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T11:50",
      "startSlotZulu": "2021-12-09T10:50:00Z",
      "speakers": [
        {
          "name": "Jens Markussen",
          "twitter": "",
          "bio": "Utvikler og konsulent som har jobbet med alt fra bygg til bank, 3D visualisering og maskinlæring, og som liker å tukle med mikrokontrollere på fritiden "
        }
      ]
    },
    {
      "intendedAudience": "Alle som er interessert i konseptutvikling og hvordan man kan gå fra en idé til et produkt med internasjonalt nedslagsfelt.",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "For rundt ti år siden lagde noen utviklere i Kantega en app som gjorde det enklere for dem selv å logge inn i løsninger på Atlassian sin plattform. I 2014 ble den delt på Atlassian Marketplace hvor den raskt ble plukket opp av utviklere i bedrifter verden over med samme problem. Nå er videreutvikling og distribusjon av appen skilt ut i et eget produksjonsselskap med store, internasjonale bedrifter på kundelista. I denne lyntalen vil jeg kort oppsummere historien om selskapet, før jeg lister opp 10 viktige suksessfaktorer og 5 ting vi kunne gjort annerledes. Til slutt vil jeg gi noen konkrete tips om hvordan man kan lansere en integrasjonsapp rettet mot bedriftskunder og teste interessen i et internasjonalt marked uten å måtte bygge opp en egen salgs- og markedsføringsavdeling.",
      "title": "Hvordan vi bygget opp et multimillion-dollar produksjonsselskap med 0 ansatte",
      "room": "Room 2",
      "startTime": "2021-12-08T09:30",
      "endTime": "2021-12-08T09:50",
      "startTimeZulu": "2021-12-08T08:30:00Z",
      "endTimeZulu": "2021-12-08T08:50:00Z",
      "id": "e79c5234-ded2-4024-b319-32ada79fc408",
      "sessionId": "e79c5234-ded2-4024-b319-32ada79fc408",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T09:30",
      "startSlotZulu": "2021-12-08T08:30:00Z",
      "speakers": [
        {
          "name": "Anders Eivind Bråten",
          "twitter": "",
          "bio": "Anders er daglig leder i Kantega SSO AS. Han har en allsidig bakgrunn og har blant annet jobbet med front-end utvikling, systemanalyse, interaksjonsdesign, konseptutvikling, forskning og prosessledelse. Han brenner for tillitsbasert ledelse, og viktigheten av å bygge en teamkultur med stor takhøyde der kommunikasjonen flyter lett mellom alle som er involvert."
        }
      ]
    },
    {
      "intendedAudience": "Utviklere, arkitekter, ledere, og alle som er interessert i sikker software utvikling.",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "NAV har siden 2016 opparbeidet seg en sterk utvikling og dataavdeling. vi har endret utviklingspraksis fra store tunge prosjekter til smidige, autonome og tverrfaglige produktteam. Men hva med sikkerheten? Før i tiden satt det gjerne et team med ansvaret for sikkerheten i de digitale produktene som ble utviklet. Dette fungerte kanskje når prosjektene var store, få og hadde lavere endringstakt, men i dag, med mange autonome team som gjør flere oppdateringer daglig så er umulig for et sikkerhetsteam å holde den fullstendige oversikten. Security Champions er et rammeverk for organisasjoner som ønsker å bygge sikkerhetskultur, i stedet for å tro alt sikkerhet kan løses med krav og regelverk. Det handler om å gjøre sikkerhet til en integrert del av et produktteam, ikke at sikkerhet skal være flaskehals for hele organisasjonen. NAV har siden 2019 jobbet med å innføre et Security Champions program i produktteamene og denne lyntalen vil handle om hva Security Champions er, hvordan vi har tilpasset det vår organisasjon, fallgruvene på veien og hvordan vi vil utvikle initiativet fremover.",
      "title": "Autonome team og Security Champions, hvordan NAV utvikler sikkert i fart",
      "room": "Room 2",
      "startTime": "2021-12-09T14:10",
      "endTime": "2021-12-09T14:30",
      "startTimeZulu": "2021-12-09T13:10:00Z",
      "endTimeZulu": "2021-12-09T13:30:00Z",
      "id": "118b77b6-c1cb-4046-8645-905a527f1b1f",
      "sessionId": "118b77b6-c1cb-4046-8645-905a527f1b1f",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T13:30",
      "startSlotZulu": "2021-12-09T12:30:00Z",
      "speakers": [
        {
          "name": "Sondre Halvorsen",
          "twitter": "",
          "bio": "Mit navn er Sondre Halvorsen og jeg jobber som utvikler hos NAV, og har gjort det siden jeg begynte som sommerstudent hos NAV i 2018. Ved siden av jobben med software utvikling hos NAV så har jeg tatt en mastergrad i informasjonssikkerhet og engasjert meg i security champions initiativet. Noe jeg brenner for er å finne ut av er hvordan vi best kan jobbe autonomt og smidig, samtidig som vi utvikler sikker software."
        }
      ]
    },
    {
      "intendedAudience": "This talk is for anyone who:\n\n- Has trouble choosing what to learn next;\n- Keeps watching tutorial after tutorial but still feel like they haven't learned anything;\n- Have limited time to learn and want to get more value out of that time;",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "Do you also feel like it's hard to keep up with all the new tools and frameworks coming your way? \nYou are not alone! By choosing IT, you are choosing to learn for the rest of your life... not an easy task. \n\nIn this session we'll look into some concepts that will help you get the most out of your efforts to learn new shiny stuff!\n\nWe'll go over a couple of example projects and give you some tools to keep learning without being overwhelmed by the flood of new technologies.",
      "title": "Learning Through Tinkering",
      "room": "Room 1 (Prerecorded)",
      "startTime": "2021-12-08T15:50",
      "endTime": "2021-12-08T16:35",
      "startTimeZulu": "2021-12-08T14:50:00Z",
      "endTimeZulu": "2021-12-08T15:35:00Z",
      "id": "0870ff8d-bb67-4cf5-b7aa-7c452ade669c",
      "sessionId": "0870ff8d-bb67-4cf5-b7aa-7c452ade669c",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T15:50",
      "startSlotZulu": "2021-12-08T14:50:00Z",
      "speakers": [
        {
          "name": "Tom Cools",
          "twitter": "TCoolsIT",
          "bio": "Geek in all facets of the word, including but not limited to boardgames, comic books but most of all programming. Currently active as a consultant with a focus on Java technologies.\n \nNext to that I am a trainer and mentor who loves to share not only knowledge but also passion for our craft. I do this through mentorships (codingcoach.io), guiding students at my alma mater or just helping strangers on Twitter and StackOverflow."
        }
      ]
    },
    {
      "intendedAudience": "Hackers, Software Engineers, Architects, CTOs",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "WAT? No exceptions? No user-defined parametric types? Where are all my FP libs? You crazy man!!\n\nOr perhaps not. Life without those things isn’t as bad as you think. Especially when you throw in some of the other features of the Go programming language and ecosystem: fast compilation, cross-platform targeting, an excellent baked in testing system, Goroutines, channels, trivial interfacing with C libraries, a vast collection of online libraries to use, and perhaps most importantly: a meaningful attempt to recover some of the joy of programming.  Suddenly the tradeoffs don’t seem so bad.\n\nAn honest re-evaluation of what really matters in getting stuff done. Without cutting corners either. The creators of Go have extensive experience with the pains that accompany developing software. Their efforts to bring some joy back to programming has hit the mark in surprising ways. Let us tell you what we, programmers since forever and Scala engineers for the last ~10 years or so, noticed.\n",
      "title": "Scala and the unreasonable effectiveness of Go",
      "room": "Room 1 (Prerecorded)",
      "startTime": "2021-12-09T12:35",
      "endTime": "2021-12-09T13:20",
      "startTimeZulu": "2021-12-09T11:35:00Z",
      "endTimeZulu": "2021-12-09T12:20:00Z",
      "id": "14cd9541-831b-4739-bf29-4a25e0d46abb",
      "sessionId": "14cd9541-831b-4739-bf29-4a25e0d46abb",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T12:35",
      "startSlotZulu": "2021-12-09T11:35:00Z",
      "speakers": [
        {
          "name": "Jim Powers",
          "twitter": "",
          "bio": "Jim Powers has been programming for too long and professionally\nsince 1982.  He has a B.S. in Physics, but couldn't shake the computer\nbug.  He's spent most of his career in various startups and a few\ngrown-ups like AOL and Oracle.  He's had the great fortune of working\nin a variety of problem domains with some truly great people.  A\nsample includes: computational chemistry, OS development for embedded\nsystems, multimedia desktop applications, Web (back end), Web\n(front-end), Web (fixing back and front ends to scale), databases, and\ndistributed systems.  He's Chief Troublemaker at GrandCloud where he\nhelps customers achieve success through thoughtful acerbic humor.\n\nHe's given a few talks at local meetups, but you had to be there."
        },
        {
          "name": "Henrik Engström",
          "twitter": "",
          "bio": "Henrik Engström, M.Sc. CS, has over 20 years of professional development experience and 35 years of computer programming knowledge. During his professional years he has gathered vast domain knowledge in the financial, retail, and online gambling industries. He has worked with everything from low-level machine coding to high flying BPM diagrams, and is currently the CTO at GrandCloud - an independent consulting company based in the US.\n\nHenrik has presented at some leading tech conferences such as JavaOne, OSCON, Scala eXchange, DevNexus, and Jfokus."
        }
      ]
    },
    {
      "intendedAudience": "Utviklere, Arkitekter, Testere",
      "length": "10",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Kafka og distribuert arkitektur med mange små mikrotjenester som skriver og leser meldinger begynner å bli defakto standard i bransjen. Når arkitekturen vokser over tid og flere feature requests kommer inn er det avgjørende å ha god oversikt over dataflyt og sammenheng mellom tjenester og interessenter som er i spill.\n\nVi deler erfaringer fra Ruter på hvordan vi på sanntidsplattformen har automatisert generering av web-basert visualisering av dataflyt og sammenheng mellom Kafka topics og mikrotjenester vha enkle prinsipper som standardisering, bruk av tekstbasert diagramnotasjon og automatisering i CI pipelines.",
      "title": "Automatisert visualisering av dataflyt og konsumenter/produsenter i Kafka",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T09:50",
      "endTime": "2021-12-08T10:00",
      "startTimeZulu": "2021-12-08T08:50:00Z",
      "endTimeZulu": "2021-12-08T09:00:00Z",
      "id": "c6b44bae-7fc7-4982-b06e-88892f8422bb",
      "sessionId": "c6b44bae-7fc7-4982-b06e-88892f8422bb",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T09:30",
      "startSlotZulu": "2021-12-08T08:30:00Z",
      "speakers": [
        {
          "name": "Ismar Slomic",
          "twitter": "ismarslomic",
          "bio": "Ismar har 13 års erfaring som utvikler og teknisk arkitekt og jobber som konsulent i Scelto. For tiden koser han seg som backend utvikler på Sanntidsplattformen hos Ruter med blant annet Kotlin, Kafka, Kubernetes og AWS"
        }
      ]
    },
    {
      "intendedAudience": "Enhver som bryr seg om hvordan vi tenker rundt systemutvikling, eller lurer på om ryktene om FINNs smidig-reise er sanne. ",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "I 2006 kastet FINN.no de tykke spekkene og GANT-chartene, og startet med Scrum. Hvordan startet det, hvordan lyktes vi, og hva har vi lært? \n\nEn blanding av historiefortelling av hvordan IT-utvikling har endret seg siden tidlig 2000-tall, hvilke prinsipper som lå til grunn, hva er forutsetningene - og ikke minst hva er vanskelig idag, og hva vi tror om fremtiden.\n\n",
      "title": "Hvor skadet blir man etter 15 år med smidig? - FINNs reise fra fossefall til spagaten.",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-09T11:50",
      "endTime": "2021-12-09T12:35",
      "startTimeZulu": "2021-12-09T10:50:00Z",
      "endTimeZulu": "2021-12-09T11:35:00Z",
      "id": "0f384cab-fd52-4960-8e50-be4b3c6fe939",
      "sessionId": "0f384cab-fd52-4960-8e50-be4b3c6fe939",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T11:50",
      "startSlotZulu": "2021-12-09T10:50:00Z",
      "speakers": [
        {
          "name": "Henning Spjelkavik",
          "twitter": "@spjelkavik",
          "bio": "Henning Spjelkavik bought the scrum-book in 2003, and have survived all kinds of projects from those with Gantt charts, 4 week sprints and the day-to-day chaos in a startup. He's currently in the architect group at FINN.no, doing workshops, working with the teams to create scalable services that have an impact, but also running tcpdump at night when necessary."
        }
      ]
    },
    {
      "intendedAudience": "This is an introductory talk for testcontainers and microshed testing. Audiences do not need specific testing knowledge or experience, but a basic working understanding of software testing and/or Java would be helpful, especially for the demo in this session.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "Containers are an amazing technology that are revolutionising how we deploy and create applications. Docker and Kubernetes are helping developers and organisations realise the magical potential that container technology and orchestration offer. Enter MicroShed and the Testcontainers framework enabling local test automation that leverages that magical portability containers offer. In this session we'll explore how Testcontainers can help you run and test with true-to-production environments in development with minimal re-writing of your test code.",
      "title": "Replicating production on your laptop using the magic of containers",
      "room": "Room 1 (Prerecorded)",
      "startTime": "2021-12-09T11:50",
      "endTime": "2021-12-09T12:35",
      "startTimeZulu": "2021-12-09T10:50:00Z",
      "endTimeZulu": "2021-12-09T11:35:00Z",
      "id": "364f5c30-3049-4410-87ce-9ebe91243a8c",
      "sessionId": "364f5c30-3049-4410-87ce-9ebe91243a8c",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T11:50",
      "startSlotZulu": "2021-12-09T10:50:00Z",
      "speakers": [
        {
          "name": "Grace Jansen",
          "twitter": "@gracejansen27",
          "bio": "Grace is a Developer Advocate at IBM, working with Open Liberty and Reactive Technologies. She has been with IBM since graduating from Exeter University with a Degree in Biology. Grace enjoys bringing a varied perspective to her projects and using her knowledge of biological systems to simplify complex software patterns and architectures. As a developer advocate, Grace builds POC’s, demos and sample applications, and writes guides and tutorials. She is a regular presenter at international technology conferences and has recently authored a book on reactive systems. Grace also has a keen passion for encouraging more women into STEM and especially Technology careers."
        }
      ]
    },
    {
      "intendedAudience": "Java developers and operations",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "So you just deployed your application to prod like any other day. In a matter of minutes you see the thread pool filling up and clients timing out. First you roll back the code, then you start to investigate the logs and ask the infrastructure guys, but nothing obvious springs to mind. Then you go over every new commit with your team, but nothing really stands out. You are unable to reproduce the problem in either regression tests or load tests. This is the kind of situation where you need the  flight recorder and mission control. It allows you to capture the nitty gritty details out of your JVM at runtime with a minimal amount of overhead.\nGiven that you run java 11 or later, both flight recorder and mission controls are now open source and free to use, even in production.\nUnfortunately,  at the same time that we got access to the tools, our applications moved into the cloud, running in barebone containers stripped of even the most essential tools, and no longer reachable over the network. So a lot of our toolbox just went out the window!\nFear not, we will connect the dots between the JDK tools and JVMs running in the cloud, using only open source tools and standards such as kubernetes and spring boot to achieve this.\nThe presentation is based on live demonstration.",
      "title": "Flight recordings and mission control through thick clouds",
      "room": "Room 5",
      "startTime": "2021-12-08T11:50",
      "endTime": "2021-12-08T12:35",
      "startTimeZulu": "2021-12-08T10:50:00Z",
      "endTimeZulu": "2021-12-08T11:35:00Z",
      "id": "20fef63e-58d5-40e0-854f-15eb38defac8",
      "sessionId": "20fef63e-58d5-40e0-854f-15eb38defac8",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T11:50",
      "startSlotZulu": "2021-12-08T10:50:00Z",
      "speakers": [
        {
          "name": "Martin Skarsaune",
          "twitter": "@MSkarsaune",
          "bio": "Martin Skarsaune is co-owner and developer at Kantega, with a prime interest in programming languages and tools. He is a contributor in several open source projects in the JVM monitoring toolspace."
        }
      ]
    },
    {
      "intendedAudience": "The audience should have a couple years of experience with development to follow our exploitation. We explain concepts of memory, such as the stack and heap, to make sure the audience can follow. These concepts can be hard to understand and some previous understanding of memory is recommended, but not required.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Binary exploitation is a common attack method in memory unsafe programs. Some might think binary exploitation is old news and rarely happens, but that’s wrong - it is highly relevant and common even in 2021!\n\nMarit and Christian introduce the concept of binary exploitation with code examples. They demonstrate how to exploit a recent vulnerability in Sudo by explaining the vulnerability and the exploit, and running it live! Then they show ways to detect and prevent memory corruption vulnerabilities in your software.",
      "title": "Demonstrating binary exploitation with a recent vulnerability",
      "room": "Room 5",
      "startTime": "2021-12-08T10:40",
      "endTime": "2021-12-08T11:40",
      "startTimeZulu": "2021-12-08T09:40:00Z",
      "endTimeZulu": "2021-12-08T10:40:00Z",
      "id": "2d3e7df2-7bf2-410b-9090-1b6a3759d672",
      "sessionId": "2d3e7df2-7bf2-410b-9090-1b6a3759d672",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T10:40",
      "startSlotZulu": "2021-12-08T09:40:00Z",
      "speakers": [
        {
          "name": "Marit Iren Rognli Tokle",
          "twitter": "maritio_o",
          "bio": "Marit is a Senior Software Engineer working with secure development and application security at Sopra Steria. She is engaged in the hacking community in Norway and is the former leader of Norway’s largest CTF, TG:HACK. \n\nTogether, Marit and Christian compete in CTFs with the top Norwegian CTF team, bootplug. At the time of writing bootplug is ranked 6 in the world. In competitions Marit usually starts at the easy end of the binary exploitation challenges, while Christian starts at the advanced end. Together they make a great team!"
        },
        {
          "name": "Christian Resell",
          "twitter": "0xbadcafe1",
          "bio": "Christian is a security engineer working with tracking and analyzing APT actors. He has previously worked with vulnerability research and malware analysis. He is an avid CTF player and regularly solves challenges related to binary exploitation for his team.\n\nTogether, Marit and Christian compete in CTFs with the top Norwegian CTF team, bootplug. At the time of writing bootplug is ranked 6 in the world. In competitions Marit usually starts at the easy end of the binary exploitation challenges, while Christian starts at the advanced end. Together they make a great team!"
        }
      ]
    },
    {
      "intendedAudience": "Utviklere som ønsker å lære om erfaringer med utvikling av serverless løsninger i AWS.",
      "length": "60",
      "format": "presentation",
      "language": "no",
      "abstract": "I Oslo Origo har vi jobbet med AWS Lambda og Serverless Framework i snart tre år. Vi har brukt det for REST APIer, integrasjoner og prosessering av batch- og sanntidsdata. Vi skriver mye Python og en del Kotlin. I dette foredraget deler vi de erfaringene vi har gjort oss så langt og noen tips som kan gjøre veien litt enklere for andre som ønsker å ta dette i bruk. Og ikke minst, ville vi gjort det samme om igjen?\n\nVi går igjennom forskjellige løsninger vi har utviklet og sammenligner med alternativer i AWS. Vi ser også på hvordan vi håndterer forskjellige deler av utviklingen, fra testing via bygg og deploy til overvåkning av kjørende løsninger.",
      "title": "Serverless i skyen - Erfaringer fra Origo Dataplattform",
      "room": "Room 5",
      "startTime": "2021-12-08T09:30",
      "endTime": "2021-12-08T10:30",
      "startTimeZulu": "2021-12-08T08:30:00Z",
      "endTimeZulu": "2021-12-08T09:30:00Z",
      "id": "9448e2a9-ddde-40d9-bdeb-149fc1c2ce08",
      "sessionId": "9448e2a9-ddde-40d9-bdeb-149fc1c2ce08",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T09:30",
      "startSlotZulu": "2021-12-08T08:30:00Z",
      "speakers": [
        {
          "name": "Fredrik Vraalsen",
          "twitter": "@fredriv",
          "bio": "Fredrik er tech lead og arkitekt på dataplattform-teamet i Origo, Oslo kommune sin satsning på mer helhetlig utvikling av digitale innbyggertjenester. Fredrik har tidligere jobbet som data engineer i Schibsted, med fokus på prosessering av sanntidsdata i Kafka Streams, og før det som konsulent med hovedvekt på Java og Scala. Han har holdt workshops og kurs i Kafka Streams, Scala, Java og funksjonell programmering, og liker å dele det han har lært med andre."
        }
      ]
    },
    {
      "intendedAudience": "Everyone who is curious about Artificial Intelligence should attend. It does not matter if they are practitioners or just want to know a bit more. Understanding the past is important to better shape the future.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "Everybody and their aunts talk about AI and want to use it. How many know for how long has humanity been dreaming about it? Let's find out how artificial intelligence has been envisioned, from the Antiquity until today.\n\nBooks, movies, scientists, researchers... We will look at the history of AI with compelling examples and stories taken from some of the most important periods of this journey towards creating intelligent entities. We also address current research topics that will shape the future of AI.\n\nAt the end of this talk, you will have a good understanding of the history and reasons behind the research that led to today's features and tomorrow's advancements.",
      "title": "Artificial Intelligence through the ages",
      "room": "Room 1 (Prerecorded)",
      "startTime": "2021-12-08T11:50",
      "endTime": "2021-12-08T12:35",
      "startTimeZulu": "2021-12-08T10:50:00Z",
      "endTimeZulu": "2021-12-08T11:35:00Z",
      "id": "161dc568-aaf5-414d-9db3-cb4741797232",
      "sessionId": "161dc568-aaf5-414d-9db3-cb4741797232",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T11:50",
      "startSlotZulu": "2021-12-08T10:50:00Z",
      "speakers": [
        {
          "name": "Vasco Veloso",
          "twitter": "vveloso",
          "bio": "Vasco has been developing software for over twenty years. From assembly, through C, C++ and Prolog, to Java, Scala and Kotlin, on big and small computers, from floppy disks to SSDs, on-premises and cloud, he's been there, done that and used it. He loves to learn how things work and then show others what he found: even disassembled his grandfather's watch as a kid. Then grew up to (dis)assemble not only software but also hardware in the form of embedded systems.\n\nHis current challenges come from his work at ING Bank in Amsterdam. He brings teams together to produce well-crafted software. He still enjoys to share knowledge by teaching and learning, and continues to design software and connected devices.\n\nIn his spare time, he’s discovering the city of Amsterdam, loves photography and is very much interested in the aviation industry. Has flown ultralight aircraft and truly believes in the focus necessary to keep flying, reach the destination and still enjoy the scenery along the way.\n"
        }
      ]
    },
    {
      "intendedAudience": "The expected audience is anyone interested in learning about machine learning and handling data. A bit of knowledge about coding would be beneficial, so the target group will be developers, but I also hope that non-coders can come and learn a lot.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "Since the fall of 2020, Entur has been working on a solution to predict the number of passengers in public transportation. The data are provided by Skyss, the public transportation authority of Vestlandet county. The predictions are made by state-of-the-art machine learning algorithms and based on historical data. In order to succeed with such a project, data and training pipelines need to be automated based on ideas and frameworks, such as MLOps, to enhance the productivity of the team and performance of the machine learning models.\n\nThis talk will cover exactly that; the data Entur receives, how to predict passenger count and how to handle machine learning in production. Come join me!",
      "title": "How Entur Predicts Passenger Load in Public Transportation",
      "room": "Room 4",
      "startTime": "2021-12-08T14:40",
      "endTime": "2021-12-08T15:25",
      "startTimeZulu": "2021-12-08T13:40:00Z",
      "endTimeZulu": "2021-12-08T14:25:00Z",
      "id": "7ff69f6e-27de-450a-a5e0-1be2b036e426",
      "sessionId": "7ff69f6e-27de-450a-a5e0-1be2b036e426",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T14:40",
      "startSlotZulu": "2021-12-08T13:40:00Z",
      "speakers": [
        {
          "name": "Malte Loller-Andersen",
          "twitter": "@realMalte",
          "bio": "Malte is a passionate machine learning engineer for the Nordic consultancy company Knowit. Through various projects for big Norwegian companies, he has gathered knowledge about data engineering and machine learning development. Currently, he helps Entur develop their AI and Data platform. In addition to this, he is the founder of Artificial Chapter, Knowits internal group for sharing knowledge related to artificial intelligence.\n\nAside from his consultancy job, Malte enjoys sharing knowledge and holding talks at various conferences. Since starting his career he has held workshops and talks at several international conferences, and he will continue doing exactly that until a global pandemic stops him. If a global pandemic even can stop him!\n"
        }
      ]
    },
    {
      "intendedAudience": "This is a talk directed at developers. Anyone who knows programming can follow along as this is mostly language agnostic. You might get a good laugh and hopefully learn a thing or two.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "There are many ways to solve programming problems, many of which use common data structures and algorithms that everyone is usually familiar with. But sometimes, the solution can be constructed using some properties of exclusive or (XOR), bit shifting and even using prime numbers. In this talk we will touch on a variety of these not so common tricks and algorithms. But beware; these are by no means best practices, so use what you will learn at your own risk!",
      "title": "Fun and controversial programming tricks they don't teach you at school",
      "room": "Room 4",
      "startTime": "2021-12-08T10:40",
      "endTime": "2021-12-08T11:25",
      "startTimeZulu": "2021-12-08T09:40:00Z",
      "endTimeZulu": "2021-12-08T10:25:00Z",
      "id": "1c39c687-fb03-4990-ad00-52a47db348ac",
      "sessionId": "1c39c687-fb03-4990-ad00-52a47db348ac",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T10:40",
      "startSlotZulu": "2021-12-08T09:40:00Z",
      "speakers": [
        {
          "name": "Gunnar Kriik",
          "twitter": "",
          "bio": "More than 15 years of experience in software design and engineering in various industries and companies of all sizes. Interested in everything from Web Content Accessibility to hand-written 6502 assembly. Currently working in SpareBank 1 Utvikling."
        }
      ]
    },
    {
      "intendedAudience": "This talk should be suitable for all audiences. Some will take trips down memory lane, others will just be mindblown by what these kids were able to do. Everyone will have a great time.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Since the dawn of the microcomputer era, kids have been wonderstruck by the amazing things computers can do. Some of these kids went on to write groundbreaking programs pushing their computers way beyond the limits of what their computers were designed for.\n\nIn this talk Anders Norås tell the previously untold stories of these Marvels of Teenage Engineering. We’ll get to see vintage code on vintage computers using black magic programming tricks so advanced that they will amaze even the most seasoned developers.\n",
      "title": "Marvels of Teenage Engineering",
      "room": "Room 6",
      "startTime": "2021-12-08T14:40",
      "endTime": "2021-12-08T15:40",
      "startTimeZulu": "2021-12-08T13:40:00Z",
      "endTimeZulu": "2021-12-08T14:40:00Z",
      "id": "8a0175fe-49b1-40b0-b123-4bbdc68d5842",
      "sessionId": "8a0175fe-49b1-40b0-b123-4bbdc68d5842",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T14:40",
      "startSlotZulu": "2021-12-08T13:40:00Z",
      "speakers": [
        {
          "name": "Anders Norås",
          "twitter": "@anoras",
          "bio": "Originally educated in arts and design, Anders has spent the last twenty years writing code. He currently works for Avanade as the Director of Software Engineering.\n\nHe has given numerous talks and keynotes at conferences such as JavaZone, NDC, J-Fall, Øredev and many more. Have given 100+ conference talks to a variety of audiences including media, design and hardcore computer science. Known for an energetic and highly engaging presentations."
        }
      ]
    },
    {
      "intendedAudience": "Developers or other team members that work on API or documenting them will get an eye-opener of why documenting null or not null is important.",
      "length": "10",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "APIs are everywhere. They are how customers buy your product or service, where your frontend or app talks to your backend. They can be internal APIs for your services and a necessity for automating your processes and few applications have no integration with other services. Common for all APIs are that there is always a developer trying to integrate with and consume them. Documentation can range from nothing to big verbose documents. Where OpenAPI Specification (OAS) is provided, the documentation can be hand-written or generated from tools like Swagger, SpringFox, SpringDoc and the like.\n\tWhatever documentation there is, I often find one particular feature missing or being inaccurate: Will the properties and objects in the response always be there or can they sometimes be null or missing? Same goes for input: is it required or can I leave it out? I will focus on the former as that will give the client a runtime exception when expected data is missing. One can of course always assume everything can be null, but all those if (prop != null) statements don’t make your code more beautiful.\n\nIn this lightning talk I will raise awareness about the pain this missing piece in the documentation causes the client integrator. I will briefly demonstrate how nullability can be documented in OAS. For generated documentation I will show how annotations can be used to document required and not required properties. Some languages like Kotlin have a type system that differentiates nullable from non-nullable types. Some tools can use this type information when generating eg. OAS yaml or json files, which is simple and always correct, but which also comes with a price. \n\nServer-side the nullability for the input data can be enforced by the type system (like Kotlin non-null types), the object mapper (@JsonProperty annotations) or Bean Validation annotations. I will show that each way has advantages and disadvantages eg. content of error messages. In the end it’s up to you what you prefer, as long as you go home from JavaZone, read your API-documentation and make sure you have specified which properties can be null or not (for both request and response data)!\n",
      "title": "To null or not null - that’s the question",
      "room": "Room 2",
      "startTime": "2021-12-09T14:40",
      "endTime": "2021-12-09T14:50",
      "startTimeZulu": "2021-12-09T13:40:00Z",
      "endTimeZulu": "2021-12-09T13:50:00Z",
      "id": "dd1fcb00-ad1c-4617-a28d-15895ee98db3",
      "sessionId": "dd1fcb00-ad1c-4617-a28d-15895ee98db3",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T14:40",
      "startSlotZulu": "2021-12-09T13:40:00Z",
      "speakers": [
        {
          "name": "Bjørn Hamre",
          "twitter": "javaguruen",
          "bio": "Bjørn Hamre is a solutions architect with a passion for API design, implementation and documentation. He is leader of the API technology group in Ambita."
        }
      ]
    },
    {
      "intendedAudience": "This talk is aimed at data scientists, data engineers, software developers and architects, and any others who are interested in ML, ML \"in production\" and what the machine learning team does at Ruter.",
      "length": "20",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "Ruter AS is the public transport authority for Oslo and what was previously Akershus counties in Norway. At Ruter, we are using NLP and machine learning to classify customer inquiries and to forecast the number of passengers on a bus journey. Our journey started about a year ago with manual steps for both training and deployment. We have been gradually moving to an automated solution combining several MLOps best practices. We have set up ML pipelines on AWS with steps for data load and data validation, feature engineering, model training and deployment, publication of batch predictions, and monitoring with model evaluation. These pipelines are maintained using Gitlab CI/CD and Terraform infrastructure-as-code. In this talk, we discuss our journey towards MLOps on AWS and lessons learned.",
      "title": "Machine learning at Ruter: Our journey towards MLOps",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T16:30",
      "endTime": "2021-12-08T16:50",
      "startTimeZulu": "2021-12-08T15:30:00Z",
      "endTimeZulu": "2021-12-08T15:50:00Z",
      "id": "68505422-1c40-4667-9d2e-be1128e0a8ad",
      "sessionId": "68505422-1c40-4667-9d2e-be1128e0a8ad",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T15:50",
      "startSlotZulu": "2021-12-08T14:50:00Z",
      "speakers": [
        {
          "name": "David Skålid Amundsen",
          "twitter": "",
          "bio": "David is a data scientist and machine learning engineer at Ruter."
        },
        {
          "name": "Jawad Saleemi",
          "twitter": "",
          "bio": "Jawad is lead data scientist and head of the machine learning team at Ruter."
        }
      ]
    },
    {
      "intendedAudience": "Utviklere med interesse for NLP. \n",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Med BERT så har man fått en språkmodell og arkitektur som har gitt mulighet for store forbedringer innenfor en lang rekke NLP oppgaver. \n\nLenge har dette fremskrittet vært forbeholdt engelsk, men helt i starten av 2021 tilgjengeliggjorde både Universitet i Oslo (UiO) og Nasjonalbiblioteket (NB) norske versjoner basert på BERT. \n\nDisse modellene er er flott utgangspunkt for å løse et bredt spekter av NLP oppgaver. De trenger bare litt fintuning for den konkrete oppgaven.\n\nI denne presentasjonen går jeg gjennom og viser hvordan BERT enkelt kan benyttes til klassifisering av tekst og spørsmål/svar.\n\nKom for å få en kort innføring og se hvordan disse kan benyttes til å løse to vanlige NLP oppgaver.",
      "title": "Norske byggeklosser - Hands-on bruk av norsk BERT ",
      "room": "Room 2",
      "startTime": "2021-12-09T11:00",
      "endTime": "2021-12-09T11:20",
      "startTimeZulu": "2021-12-09T10:00:00Z",
      "endTimeZulu": "2021-12-09T10:20:00Z",
      "id": "cb465ccd-8ba0-437f-832f-433dfdb7302f",
      "sessionId": "cb465ccd-8ba0-437f-832f-433dfdb7302f",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T10:40",
      "startSlotZulu": "2021-12-09T09:40:00Z",
      "speakers": [
        {
          "name": "Jan Erik Modal",
          "twitter": "",
          "bio": "Utvikler, leder ML-gruppen i SpareBank 1 Utvikling"
        }
      ]
    },
    {
      "intendedAudience": "Open for everyone.",
      "length": "20",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "This talk addresses my experience learning and working with architecture and model-based system development (MBSD). I’ll focus on talking about the importance of learning and teaching architecture and MBSD at the university by familiarising students with modelling techniques and tools through the whole lifecycle of a project, from business architecture, through system architecture and software architecture, to executable models that take advantages of platform-based development, all with a foundation in domain-specific languages developed and supported through model-based language engineering methods and tools. Moreover, I’ll talk about the benefits of having junior architects in the team at work projects based on my personal experience. ",
      "title": "The Architecture Journey - A Beginner's Story",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T16:05",
      "endTime": "2021-12-08T16:25",
      "startTimeZulu": "2021-12-08T15:05:00Z",
      "endTimeZulu": "2021-12-08T15:25:00Z",
      "id": "fb4b7c63-825a-49b6-ae06-838edc1bb3df",
      "sessionId": "fb4b7c63-825a-49b6-ae06-838edc1bb3df",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T15:50",
      "startSlotZulu": "2021-12-08T14:50:00Z",
      "speakers": [
        {
          "name": "Ewa Kabza",
          "twitter": "ewakabza",
          "bio": "IT consultant at Capgemini. Leader of Women in Tech Oslo, member of javaBin (the team behind JavaZone). I have M.Sc in architecture, model-based system development & teaching."
        }
      ]
    },
    {
      "intendedAudience": "Programmers or others with little or no UX skills who want to create better applications but don't really have time for user validation.",
      "length": "20",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "Validating small and big concepts with users in an early stage will improve your designs and will also prevent you from wasting time developing stuff that is not needed. But how do you get there when you have no time and no UX skills?\n\nLearn how to gather insight on your ideas with 10 minute user validation. I practice user validation in every sprint and for every new idea. Yes, we have more channels for insight that help us improve our digital products, but user validation affects both daily design choices and decisions to come. \n\nLearn what benefits you can get from 10 minute user validation and learn how to get started!",
      "title": "10 minute user validation",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T11:00",
      "endTime": "2021-12-08T11:20",
      "startTimeZulu": "2021-12-08T10:00:00Z",
      "endTimeZulu": "2021-12-08T10:20:00Z",
      "id": "d3a54daa-8b2c-49d0-87c8-d1bbab38d8d2",
      "sessionId": "d3a54daa-8b2c-49d0-87c8-d1bbab38d8d2",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T10:40",
      "startSlotZulu": "2021-12-08T09:40:00Z",
      "speakers": [
        {
          "name": "Darija Sapozenkova-Hauge",
          "twitter": "",
          "bio": "Darija is an Oslo based UX/service design expert and team lead for Java developers in Experis. Since 2004 she has delivered digital transformation, innovation and service development with the user in focus. Darija's expertise is within banking, finance, e-commerce and telecom sectors. She leads teams and processes for customers like Nordea Direct, Elkjøp, Gjensidige, Komplett and Telenor. Clients give Darija kudos for bravery and making things happen. Darija publishes articles and blogs, holds presentations and loves dark chocolate. "
        }
      ]
    },
    {
      "intendedAudience": "Java Developers, anyone curious about Kubernetes operators. Some basic knowledge of Kubernetes is helpful, but not required.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "If you've used Kubernetes to deploy your own custom application, you might have come across the annoying part of managing the state of that application. From versioning to backups, someone has to do it.\n\nNow, what if you could automate that management?\n\nWith Kubernetes Operators you can! They allow you to expand Kubernetes-native tools and concepts to your own application and permit you to build in your operational knowledge into your cluster.\n\nLet me introduce you to how Kubernetes Operators work, and how you can get started writing your own Operator in your favourite language (assuming your favourite language is Java).",
      "title": "Kubernetes Operators for Java Developers",
      "room": "Room 5",
      "startTime": "2021-12-09T09:30",
      "endTime": "2021-12-09T10:15",
      "startTimeZulu": "2021-12-09T08:30:00Z",
      "endTimeZulu": "2021-12-09T09:15:00Z",
      "id": "04c3137d-6fc7-45e4-82e0-0c713b8a9aad",
      "sessionId": "04c3137d-6fc7-45e4-82e0-0c713b8a9aad",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T09:30",
      "startSlotZulu": "2021-12-09T08:30:00Z",
      "speakers": [
        {
          "name": "Charlotte Mach",
          "twitter": "@tinydata42",
          "bio": "Charlotte is currently an Engineering Manager at Container Solutions, working on projects using Kubernetes, various CI/CD tools and helping companies to be more cloud native while also managing a team of engineers. After trying out various tech jobs during her studies, which got her a Master’s degree in Computer Science and a love-hate relationship with debugging, she moved on to work with Oracle Cloud in the Netherlands before joining CS. Both at work and outside of it Charlotte is passionate about learning and bad jokes."
        }
      ]
    },
    {
      "intendedAudience": "Every developer should attend. Nowadays nobody is writing metrics, but it's so powerfull to monitor your application! I want to show the simplicity to create them with Micrometer. \nBasic Java knowledge required.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Imagine that you’re part of a (car) race team. You’re the one behind the screens to control the race and make some tough decisions (like changing the team's strategy).\n\nBut you don’t have the insights (or metrics) about your car, opponents, or even the weather. Sounds painful right? But why are we making this mistake when building our software? Why don’t we implement metrics by default?\n\nSLFf4J logging is one side of the story, but we also need to know our application health. That’s where Micrometer comes in! It’s a library that you can use to define your own custom metrics, like: \n- timers (to check the performance of your microservices) \n- counters (to check how many times a certain event is occurring) \n- gauges (to check the current value of a variable) \n- and many more \n\nThese metrics are exposed by REST endpoints (JSON) together with Spring Boot actuator, which can be saved into a database like Prometheus or Graphite. And to visualize the data you can use a tool like Grafana. Pretty interesting right?\n\nIn the demo (live coding!) I will show you how to create such applications using Micrometer, and Spring Boot. Ready to win this race with me? Jump in!",
      "title": "[LIVE CODING] Controlling your race with Micrometer and Spring Boot",
      "room": "Room 7",
      "startTime": "2021-12-08T15:50",
      "endTime": "2021-12-08T16:50",
      "startTimeZulu": "2021-12-08T14:50:00Z",
      "endTimeZulu": "2021-12-08T15:50:00Z",
      "id": "b32f3731-bba6-4db1-81ce-8074b1b554f0",
      "sessionId": "b32f3731-bba6-4db1-81ce-8074b1b554f0",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T15:50",
      "startSlotZulu": "2021-12-08T14:50:00Z",
      "speakers": [
        {
          "name": "Ko Turk",
          "twitter": "@KoTurk77",
          "bio": "Hi! My name is Ko Turk (@KoTurk77), working as a Senior Java Developer for Blue4IT and currently on an assignment at Rabobank. Besides working on creating bad ass software, I’d like to speak at conferences such as JavaZone Oslo, DevNexus Atlanta and of course our own J-Fall. You can find me regularly at the UtrechtJUG."
        }
      ]
    },
    {
      "intendedAudience": "Utviklere og arkitekter som lager applikasjoner og der man har fokus på kostnader som følge av høyt minneforbruk.",
      "length": "10",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Telenor Norge har modernisert en større applikasjon ved å splitte den opp i flere mindre applikasjoner og flyttet disse over til et Kubernetes kjøretidsmiljø. Vi håpet at dette skulle medføre redusert behov for hardware grunnet en bedre utnyttelse av servere. Men særlig minneforbruket har vist seg å skyte i været. Jeg vil presentere hvilke arkitekturvalg vi tok og hvilke konsekvenser det fikk for minneforbruket.",
      "title": "Minneforbruk før og etter oppsplitting",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T14:40",
      "endTime": "2021-12-08T14:50",
      "startTimeZulu": "2021-12-08T13:40:00Z",
      "endTimeZulu": "2021-12-08T13:50:00Z",
      "id": "cdf1c0b0-b220-47ef-a6c7-a9e49b88a9a8",
      "sessionId": "cdf1c0b0-b220-47ef-a6c7-a9e49b88a9a8",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T14:40",
      "startSlotZulu": "2021-12-08T13:40:00Z",
      "speakers": [
        {
          "name": "Roar Audun Myrset",
          "twitter": "",
          "bio": "Utvikler i Telenor Norge sin IT-avdeling siden 1998. Jobber med applikasjoner som tar vare på informasjon om våre kunder og hvilke produkter de har hos oss. Har de siste årene vært med på å modernisere applikasjonene til å kjøre på en Kubernetes plattform."
        }
      ]
    },
    {
      "intendedAudience": "Dette foredraget passer for publikum både med og uten teknisk bakgrunn. Vi vil gi en kort innføring i hvordan kraftbransjen fungerer, og det er rimelig å anta at man ikke trenger spesifikk bakgrunnskunnskap om hverken bransjen eller IT-sikkerhet for å få et utbytte av presentasjonen og forstå utfordringene vi peker på. ",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Hverdagen til enhver utvikler, og nesten alle andre i disse dager, er i dag digital, men har du noen gang tenkt på cybersikkerheten til bransjen som gjør det mulig for oss å ha en digital hverdag? Den norske kraftbransjen leverer strøm rundt om til alle kriker og kroker i landet vårt, noe som gjør den til en av de mest kritiske infrastrukturene vi har i dag. Derfor er det viktig at selskapene som leverer strøm er godt forberedt på cyberangrep, men er de egentlig det?\n\nI denne lyntalen vil vi gi dere en bedre innsikt i den norske kraftbransjen, truslene den står overfor og hva vi som utviklere kan lære av hvordan kraftbransjen håndterer cybersikkerhet. Forhåpentligvis vil dere være bedre forberedt på å håndtere cyberangrep etter å ha hørt på oss.\n\nDenne presentasjonen belyser hvordan den norske kraftbransjen driftes, dens sårbarheter og hva vi som jobber i forskjellige fagfelt, med forskjellige teknologier kan ta med oss av lærdom til prosjektene våre. \n",
      "title": "Hva utviklere kan lære av cybersikkerhet i den norske kraftbransjen",
      "room": "Room 2",
      "startTime": "2021-12-09T15:50",
      "endTime": "2021-12-09T16:10",
      "startTimeZulu": "2021-12-09T14:50:00Z",
      "endTimeZulu": "2021-12-09T15:10:00Z",
      "id": "bf97d412-1830-4b85-99b8-635698f69075",
      "sessionId": "bf97d412-1830-4b85-99b8-635698f69075",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T15:50",
      "startSlotZulu": "2021-12-09T14:50:00Z",
      "speakers": [
        {
          "name": "Sara Waaler Eriksen",
          "twitter": "",
          "bio": "Sara og Sarmilan startet i fjor som utviklere hos Bekk. Begge har en brennende engasjement for sikkerhet og kritisk infrastruktur. De to har en mastergrad i Kommunikasjonsteknologi med spesialisering innenfor informasjonssikkerhet fra NTNU. Masteroppgaven deres  undersøkte hvordan nettselskapene hadde forberedte seg til de forskjellige fasene av en sikkerhetshendelse, da spesielt med leverandører av driftssystemer.  "
        },
        {
          "name": "Sarmilan Gunabala",
          "twitter": "",
          "bio": "Sara og Sarmilan startet i fjor som utviklere hos Bekk. Begge har en brennende engasjement for sikkerhet og kritisk infrastruktur. De to har en mastergrad i Kommunikasjonsteknologi med spesialisering innenfor informasjonssikkerhet fra NTNU. Masteroppgaven deres  undersøkte hvordan nettselskapene hadde forberedte seg til de forskjellige fasene av en sikkerhetshendelse, da spesielt med leverandører av driftssystemer.  "
        }
      ]
    },
    {
      "intendedAudience": "Utviklere, Arkitekter, Ledere",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "Stadig flere organisasjoner ser store gevinster ved å organisere sin digitale utvikling i kryssfunksjonelle autonome team. Ved å samle nødvendig kompetanse i team, samt gi de både myndighet og frihet til å agere raskt på endringer har organisasjoner sett gode resultater. Team som dette får ofte i oppgave å løse problemer snarere enn å levere på en ferdig spesifikasjon, samt at man gjerne benytter data og eksperimentering for å sikre at man løser de riktige problemene.\n\nMen hva skjer når en organisasjon har 20, 50, 100 eller 200 slike team? Vår erfaring er at mange organisasjoner da trekker frem mer tradisjonelle styringsmekanismer, som tar bort mye av den store oppsiden man kan få av å gi frihet og autonomi. Disse tradisjonelle styringsmekanismene kan føre til at man igjen reduserer tipp topp utviklingsteam til samlebåndsarbeidere som leverer på en spesifikasjon. Du får team på tomgang.\n\nI dette foredraget vil vi belyse viktigheten av å gi utviklingsteam frihet og autonomi – og på denne måten utnytte kompetansen og kapasiteten til ansatte i langt større grad. Vi ønsker å peke på utfordringer vi ser når organisasjoner forsøker å skalere opp denne måten å jobbe på, samt trekke frem eksempler fra organisasjoner som ser ut til å få til dette bra.\n\nDet vil bli presentert relevante funn fra forskning, samt eksempler til etterfølgelse fra organisasjoner som Spacemaker, Cognite, Vipps, Finn.no, SpareBank 1 Utvikling, NAV og Tripletex.",
      "title": "Team på tomgang",
      "room": "Room 4",
      "startTime": "2021-12-08T09:30",
      "endTime": "2021-12-08T10:15",
      "startTimeZulu": "2021-12-08T08:30:00Z",
      "endTimeZulu": "2021-12-08T09:15:00Z",
      "id": "074995af-0475-43a5-a060-a995faafc5bc",
      "sessionId": "074995af-0475-43a5-a060-a995faafc5bc",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T09:30",
      "startSlotZulu": "2021-12-08T08:30:00Z",
      "speakers": [
        {
          "name": "Jostein Emmerhoff",
          "twitter": "",
          "bio": "Over middels interessert i organisasjon og prosess. Brenner for lean, smidig. Har en tendens til å endre på ting. Tidligere leder for utviklingsavdelingen til SpareBank 1 og nå på vei inn i rollen som Tech COO i Finn.no."
        },
        {
          "name": "Marius Mikalsen",
          "twitter": "",
          "bio": "Førsteamanuensis på NTNU og seniorforsker i Sintef Nord. Forsker på utvikling og bruk av digitale systemer. Har en hang for teorier og praksiser som kan hjelpe oss å løse tøffe utfordringer sammen. "
        }
      ]
    },
    {
      "intendedAudience": "Passer for alle, litt tekniske detaljer",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "Hvordan vi forbereder oss for store eventer og mye trafikk hos NRK.no - både de vi vet om og de vi ikke vet om. \n\nLurer du på hvordan du kan forberede deg på en god måte for store eventer og mye trafikk? Vi snakker om hvordan vi har rigget oss hos NRK.no slik at vi skal tåle mye trafikk uten å gå ned. Vi vil snakke om både hvordan vi forbereder oss før store eventer som vi vet om, eksempelvis valget eller Melodi Grand Prix, men også hvordan vi rigger oss for ukjente hendelser som fører til plutselig stort trøkk. Og hvordan det noen ganger går galt likevel, som for eksempel under Melodi Grand Prix 2020. \n",
      "title": "Forberedt på det verste – NRK.no under stortingsvalget og MGP",
      "room": "Room 4",
      "startTime": "2021-12-09T14:40",
      "endTime": "2021-12-09T15:25",
      "startTimeZulu": "2021-12-09T13:40:00Z",
      "endTimeZulu": "2021-12-09T14:25:00Z",
      "id": "03c30f21-cd4e-4315-9772-81e457e086f6",
      "sessionId": "03c30f21-cd4e-4315-9772-81e457e086f6",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T14:40",
      "startSlotZulu": "2021-12-09T13:40:00Z",
      "speakers": [
        {
          "name": "John Arne S. Pedersen",
          "twitter": "",
          "bio": "John Arne er tech lead for Java på NRK.no, og var på vakt da MGP gikk ned i 2020."
        },
        {
          "name": "Ingrid Grønlie Guren",
          "twitter": "",
          "bio": "Ingrid er tech lead for Javascript på NRK.no, og har kjørt disaster recovery av forsida klokka tre om natta."
        }
      ]
    },
    {
      "intendedAudience": "Ingen forkunnskaper påkrevd, men en interesse for mysterier og mørke gjerninger kan være nyttig",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "En forsvunnet person, en låst mobiltelefon og tiden som rant ut. Dette er en kort historie om koden som hverken hadde tester eller fulgte SOLID-prinsippene, men som allikevel var viktigere enn all annen kode som ble skrevet den natten.",
      "title": "Good code, bad code - en historie fra virkeligheten",
      "room": "Room 2",
      "startTime": "2021-12-08T14:40",
      "endTime": "2021-12-08T15:00",
      "startTimeZulu": "2021-12-08T13:40:00Z",
      "endTimeZulu": "2021-12-08T14:00:00Z",
      "id": "3d48aab5-688e-464c-b6bf-b0ea1f1a96dd",
      "sessionId": "3d48aab5-688e-464c-b6bf-b0ea1f1a96dd",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T14:40",
      "startSlotZulu": "2021-12-08T13:40:00Z",
      "speakers": [
        {
          "name": "Per Jørgen Walstrøm",
          "twitter": "@pjwalstrom",
          "bio": "Mer innvikler enn utvikler som forteller historier fra tiden da han jobbet i Seksjon for elektroniske spor på Kripos"
        }
      ]
    },
    {
      "intendedAudience": "Anyone interested in how we learn.",
      "length": "20",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "You've heard it so many times before:\n\nYou need 10,000 hours to become an expert. No, you need that just to become a professional. What is myth and what is reality of the 10,000 hour rule? We'll explore that in this lightning talk.",
      "title": "The Expert Rule: 10,000 Hours of Baloney",
      "room": "Room 2",
      "startTime": "2021-12-09T13:45",
      "endTime": "2021-12-09T14:05",
      "startTimeZulu": "2021-12-09T12:45:00Z",
      "endTimeZulu": "2021-12-09T13:05:00Z",
      "id": "3df86458-b559-48bd-87fa-dc58ccba21f2",
      "sessionId": "3df86458-b559-48bd-87fa-dc58ccba21f2",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T13:30",
      "startSlotZulu": "2021-12-09T12:30:00Z",
      "speakers": [
        {
          "name": "Jørn K Baltzersen",
          "twitter": "@jkBaltzersen",
          "bio": "Jorn K Baltzersen is a systems developer, speaker, and trainer. He has spoken at conferences in Norway and the U.S. He is currently pursuing an MSc in digital currency. He works at TietoEVRY."
        }
      ]
    },
    {
      "intendedAudience": "- Front-end developers\n- JavaScript developers\n- Tired TypeScript developers\n- Tech/team leads that want to spend their time on domain problems and not fighting with their language",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "TypeScript has become the de facto front end language for anything more serious than a prototype. But what if I told you there's a new sheriff in town? ReScript looks like JavaScript, but has a behavior that's more reasonable. ReScript makes it easy to write performant, fault-tolerant and maintainable code while at the same time drastically improving developer productivity. In this talk we'll look closer at ReScript, why you should use it and how to get started.",
      "title": "ReScript: TypeScript is not enough",
      "room": "Room 7",
      "startTime": "2021-12-08T09:30",
      "endTime": "2021-12-08T10:15",
      "startTimeZulu": "2021-12-08T08:30:00Z",
      "endTimeZulu": "2021-12-08T09:15:00Z",
      "id": "53936e1e-e5b5-4b82-86df-dd1ad758c1f9",
      "sessionId": "53936e1e-e5b5-4b82-86df-dd1ad758c1f9",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T09:30",
      "startSlotZulu": "2021-12-08T08:30:00Z",
      "speakers": [
        {
          "name": "Wahed Mangal",
          "twitter": "",
          "bio": "Wahed is a developer by trade but a problem solver at heart. He works for Knowit Objectnet in Oslo where he (tries to) builds beautiful user friendly web sites. He has a deep passion for programming languages with impure functional languages taking most of his attention these days."
        }
      ]
    },
    {
      "intendedAudience": "Utviklere, tekniske / funksjonelle testere, QA-ansvarlige, produkteiere. Praktisk erfaring med kode vil være nyttig, men er ikke en forutsetning for å få utbytte av presentasjonen. Konseptene er tekonlogi-nøytrale og ett av formålene med metodikken er å gjøre tester mer forståelige for andre enn utviklerne selv.\n",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "God testdekning kan være en utfordring i distribuerte systemer med mange (mikro)tjenester. Hyppige funksjonelle endringer og tekniske omskrivinger kan gjøre tradisjonelle enhetstester omfattende å skrive og vedlikeholde. \n\nAPI-fokuserte “black-box”-tester kan være en effektiv måte å gi kvalitativt bedre testdekning med lavere vedlikeholdskost i API-sentriske tjenester. Ved å vektlegge funksjonaliteten og API-ene tjenestene tilbyr flyttes test-fokuset fra implementasjon til oppførsel og forenkler en tettere kobling til funksjonelle krav, akseptansekriterier og opprettholdelse av API-kontrakter.\n\nPresentasjonen gir en introduksjon til konseptene og idéene bak API-fokusert “black-box”-testing med konkrete kodeeksempler fra tjenester utviklet i Ruters sanntids-team. Vi ser på ulike bruksområder for API-fokusert testing, som meldingsbaserte API-er, REST API-er, API-tester i enkelttjenester og \"ende-til-ende\"-tester på tvers av tjenester.\n",
      "title": "API-fokusert \"black-box\"-testing av (mikro)tjenester",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T13:45",
      "endTime": "2021-12-08T14:05",
      "startTimeZulu": "2021-12-08T12:45:00Z",
      "endTimeZulu": "2021-12-08T13:05:00Z",
      "id": "22ab786c-599e-4e60-84bf-bd00f29f5866",
      "sessionId": "22ab786c-599e-4e60-84bf-bd00f29f5866",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T13:30",
      "startSlotZulu": "2021-12-08T12:30:00Z",
      "speakers": [
        {
          "name": "Anders Sandvig",
          "twitter": "",
          "bio": "Anders Sandvig er en allsidig utvikler og nysgjerrig tekonlog med lang erfaring fra et mangfold av prosjekter og løsninger, fra store distribuerte virksomhetskritiske sanntidssystemer til sluttbrukerapplikasjoner for web, desktop og mobile plattformer. De siste ti årene har han vært spesielt fokusert på back-end-utvikling, API-design og utvikling av API-sentriske tjenster. Hos Ruter inngår Anders i team Sanntid, som leverer tjenster for sanntidsdata for kollektivtrafikken i Oslo og Viken.\n"
        }
      ]
    },
    {
      "intendedAudience": "Primær målgruppe er arkitekter, prosessledere og utviklingsledere. \nVi vil dele konkrete erfaringer med å bygge opp team og en utviklingsavdeling basert på produktteam og Domain-Driven Design. \nUtviklere vil få konkrete eksempler på hvordan vi har lagt til rette for autonomi og en utviklervennlig hverdag. ",
      "length": "60",
      "format": "presentation",
      "language": "no",
      "abstract": "Etter overgangen fra monopol til konkurranseutsetting trengte Vy (NSB) en moderne utviklingsorganisasjon for å dekke dagens og morgendagens behov for utvikling av skreddersydd programvare. I dette foredraget vil du få høre hvilke valg, erfaringer og gevinster vi har høstet de siste to årene. ",
      "title": "Produktteam - fra Vyer til virkelighet",
      "room": "Room 6",
      "startTime": "2021-12-08T10:40",
      "endTime": "2021-12-08T11:40",
      "startTimeZulu": "2021-12-08T09:40:00Z",
      "endTimeZulu": "2021-12-08T10:40:00Z",
      "id": "e30a4217-48db-4249-a705-fa21aa5617f8",
      "sessionId": "e30a4217-48db-4249-a705-fa21aa5617f8",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T10:40",
      "startSlotZulu": "2021-12-08T09:40:00Z",
      "speakers": [
        {
          "name": "Mads Boye",
          "twitter": "",
          "bio": "Leder Utvikling i Vy siden september 2018"
        },
        {
          "name": "Erik Drolshammer",
          "twitter": "Sherriff1",
          "bio": "Jeg er en teknisk arkitekt som brenner for smidig utvikling, devops/noops og AWS. Utfordringene Vy har stått og står overfor matcher min erfaring og interesser veldig godt og vi har gjort en del grep som nå gir resultater. \n"
        }
      ]
    },
    {
      "intendedAudience": "Foredraget passer for alle som interesserer seg for utfordringene med personvern i IT-løsninger, og ønsker å se en praktisk tilnærming til innebygd personvern i et relevant og høyst aktuelt eksempel (Smittestopp 2).\n\nNoe kryptografi vil bli vist for å forklare hvordan protokollen fungerer, men det aller meste er på et konseptuelt nivå. Du kan helt fint forstå problemstillingene og hvordan anonymiseringen bidrar til å forbedre personvernet, uten å forstå alle detaljene i protokollen. \n\nForedraget passer også godt for de som ønsker å høre om et Open Source-samarbeid mellom utviklere og Folkehelseinstituttet som var 100% remote, og hvor åpenhet, tverrfaglighet og faglig dybdekompetanse var suksessfaktorer.\n\nPublikum som bruker GitHub vil sitte igjen med en forståelse av hvordan man setter opp et GitHub-prosjekt med sikkerhetsmekanismer, enhetstester, dokumentasjon med mer for å produsere pakker som kan konsumeres av et høyprofilert og eksponert prosjekt som f.eks. Smittestopp 2.",
      "length": "60",
      "format": "presentation",
      "language": "no",
      "abstract": "Smittestopp 1 ble avsluttet tidlig på høsten 2020 etter opprop fra fagmiljø og et påfølgende forbud fra Datatilsynet. Da planleggingen av Smittestopp 2 startet, var det basert på Google og Apples rammeverk for kontaktsporing (GAEN). Tilnærmingen med Smittestopp 2 ble radikalt annerledes, med blant annet utvikling som åpen kildekode. Henrik Walker Moe, Tjerand Silde og Martin Strand møttes høsten 2020 gjennom fagdiskusjoner rundt Smittestopp, og ønsket å bidra til å forbedre personvernet i Smittestopp 2 ytterligere.\n\nResultatet av disse diskusjonene ble programvaremodulen “Anonymous tokens” som er basert på anonymiseringsprotokollen “Privacy Pass”. Den fungerer slik at en bruker får utstedt en signert attest, som kan maskeres fullstendig av brukeren først. Det kan likevel kun brukes én gang, hvor hver bruker mottar en attest som brukes som en identitet ved opplasting av smitte-data. Det er denne anonyme attesten sørger for innebygd personvern ved at den ikke er sporbar tilbake til en enkeltperson.\n\nI dette foredraget tar vi dere gjennom reisen Henrik, Tjerand og Martin hadde i Open Source-samarbeidet med FHI. Vi vil forklare hvordan ideen til “Anonymous tokens” oppstod, hvordan implementasjonen fungerer konseptuelt (inkludert noe kryptografi) og til slutt hvordan anonyme attester ble en del av Smittestopp-appen. \n\nI tillegg vil vi belyse andre praktiske bruksområder for en slik anonymisering ut ifra et personvernsperspektiv og dataminimeringsprinsipp, for eksempel logging og anonyme billetter.",
      "title": "Anonym smittesporing – innebygd personvern i Smittestopp-appen",
      "room": "Room 6",
      "startTime": "2021-12-09T13:30",
      "endTime": "2021-12-09T14:30",
      "startTimeZulu": "2021-12-09T12:30:00Z",
      "endTimeZulu": "2021-12-09T13:30:00Z",
      "id": "376fadd8-3029-4e66-a6cf-7f8bf21c7ba9",
      "sessionId": "376fadd8-3029-4e66-a6cf-7f8bf21c7ba9",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T13:30",
      "startSlotZulu": "2021-12-09T12:30:00Z",
      "speakers": [
        {
          "name": "Martin Strand",
          "twitter": "@martinstrand",
          "bio": "Martin har siden 2018 forsket på kryptografi ved Forsvarets forskningsinstitutt, og har de siste årene primært jobbet med kvantesikker kryptografi for ubevoktede enheter. Før det tok han utdanning innen matematikk og kryptologi ved NTNU, noe som kulminerte i en doktorgrad om e-valg og homomorf kryptering.\n\nProgrammeringsmessig trådde Martin sine barnsben i Turbo Pascal 5.5, lærte Delphi 4 med hjelp av bøker fra det daværende høgskolebiblioteket i Bodø, men nøyer seg i dag stort sett med pragmatisk bruk av Python til de daglige behovene."
        },
        {
          "name": "Henrik Walker Moe",
          "twitter": "@henrikwm84",
          "bio": "Henrik jobber i Bekk som fagleder for Sikkerhet og har over 15 års erfaring i bransjen. Når han finner noe han brenner for å dele med bransjen så kommer det gjerne i form av innlegg på en blogg, i sosiale medier eller fra talerstolen på konferanser. Henrik er også styreleder i NNUG og arrangerer Meetups for det norske utviklersamfunnet, bl.a. den årlige Azure Bootcamp i Oslo.\n\nFaglig fokus de siste årene har vært på IT-sikkerhet og Open Source, hvor Henrik bruker fritiden på å bl.a. være en \"White Hat\"-hacker som tester sikkerheten til fiktive nettløsninger i Capture-The-Flag oppgaver, og ved å bidra på Open Source-prosjekter. I rollen som fagleder for Sikkerhet i Bekk har han ansvaret for å skape sikkerhetsbevissthet og bygge opp sikkerhetskompetansen hos kollegaer og kunder."
        }
      ]
    },
    {
      "intendedAudience": "This talk is aimed at intermediate/senior Java Spring developers that would like to squeeze out every last bit of performance from their RESTful services. You have experience building production-grade Spring applications.",
      "length": "20",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "Ever had a task that required concurrent fetching of data from several APIs at once? Doing this task in a synchronous way will add unnecessary waiting time, especially if one of the APIs is slow. \n\nThis presentation will go over migrating from your I/O blocking servlet application into a fully asynchronous, non-blocking service. Transform your HTTP and database requests into callbacks, chain them together or parallelize where possible. Scale your application if needed, as you are no longer bound to only 1 request per thread. The non-blocking model allows you to handle several requests per thread without time loss. ",
      "title": "Spring Webflux: Migrating from Synchronous to Fully Asynchronous",
      "room": "Room 2",
      "startTime": "2021-12-09T11:20",
      "endTime": "2021-12-09T11:40",
      "startTimeZulu": "2021-12-09T10:20:00Z",
      "endTimeZulu": "2021-12-09T10:40:00Z",
      "id": "b38030cf-bb4c-465b-950e-193fc13f5141",
      "sessionId": "b38030cf-bb4c-465b-950e-193fc13f5141",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T10:40",
      "startSlotZulu": "2021-12-09T09:40:00Z",
      "speakers": [
        {
          "name": "German Poljakov",
          "twitter": "",
          "bio": "I have 5 years of experience building production-grade Java applications. My passion is utilizing performance, increasing throughput, optimizing resources and scalability. During the last 2 years of my career I have been using Spring Reactor/Webflux to achieve parallelism and scalability in Java applications. I hope to share my experiences of the pros and cons of this technology.  "
        }
      ]
    },
    {
      "intendedAudience": "Intermediate to advanced Java developers get to see a bunch of features that were added in JDK 12-17 to make them curious about upgrading.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Most projects that updated past Java 8 decided to stick to the LTS release 11.\nThe new cadence created the illusion of not much happening after that, but nothing could be further from the truth - with new language features like switch expressions, text blocks, records, pattern matching, and sealed classes, Java is moving faster than ever.\n\nIn this talk, we'll take a simple Java 11 code base, update it to 17, and refactor it to use the new language features and APIs.\nYou'll be surprised how much the code changes!",
      "title": "Java After Eleven",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-09T09:30",
      "endTime": "2021-12-09T10:30",
      "startTimeZulu": "2021-12-09T08:30:00Z",
      "endTimeZulu": "2021-12-09T09:30:00Z",
      "id": "5b991cb8-5cdc-4c18-980a-4e0191859a5d",
      "sessionId": "5b991cb8-5cdc-4c18-980a-4e0191859a5d",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T09:30",
      "startSlotZulu": "2021-12-09T08:30:00Z",
      "speakers": [
        {
          "name": "Nicolai Parlog",
          "twitter": "nipafx",
          "bio": "Nicolai (aka nipafx) is a Java enthusiast focused on language features and core APIs with a passion for learning and sharing - in articles, newsletters, and books; in tweets, videos, and streams; in demo repos and at conferences - more on all of that on [nipafx.dev]. He's a Java Developer Advocate at Oracle and organizer of [Accento]. That aside, he's best known for his haircut.\n\n[Accento]: https://accento.dev\n[nipafx.dev]: https://nipafx.dev\n"
        }
      ]
    },
    {
      "intendedAudience": "Tekniske forkunnskaper: ha laget et passord en gang.",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "I sånn ca. seks tusen år har vi prøvd å beskytte ting fra uvedkommende med diverse autentiseringsmekanismer. En gang på 1970-tallet dukket passord opp, og fra da av har ting gått fra trist til dystert. Her får du et lite innblikk i historien bak autentisering, og et skråblikk på hvorfor det gikk så galt som det gjorde.\n\nVi går gjennom hvordan får du endelig kontroll på dine, og teamet ditt sine, passord. Forhåpentligvis hvordan du kan lage ditt siste passord - sterkt nok til å beskytte mot selv de beste hackerne i verden (i teorien i alle fall) og mulig å huske.",
      "title": "Hvorfor er passord så ***** vanskelig?",
      "room": "Room 2",
      "startTime": "2021-12-08T10:00",
      "endTime": "2021-12-08T10:20",
      "startTimeZulu": "2021-12-08T09:00:00Z",
      "endTimeZulu": "2021-12-08T09:20:00Z",
      "id": "c0c368b3-0837-4e07-8143-4680102f76a6",
      "sessionId": "c0c368b3-0837-4e07-8143-4680102f76a6",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T09:30",
      "startSlotZulu": "2021-12-08T08:30:00Z",
      "speakers": [
        {
          "name": "Didrik Sæther",
          "twitter": "diddern",
          "bio": "Didrik jobber som utvikler i Bekk og har en brennende engasjement for sikkerhet. Han er glad i å dele sin interesse med bransjen, ofte i sosiale medier eller fra talerstolen. \n\nFaglig så er Didrik en del av sikkerhetsfaggruppen i Bekk og har der fokusert på heliosentrisk sikkerhet, og sikker programvareutvikling og DevOpsSec, som har resultert i flere foredrag for studenter og internt bruk, men også blogginnlegg. "
        }
      ]
    },
    {
      "intendedAudience": "Software developers, developer managers and anyone interested in keeping older developers as developers instead of losing the competence down the management drain.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "Turning old as a developer is hard. It is hard to stay relevant, hard to keep up with the competition of newcomers and hard to know all of those new frameworks, tools, languages and practices.\nHowever, the truth is that we oldies have a big advantage over the younglings. We are slow! Slow is good! So whatever you do, don’t put your programming on the shelf just because someone half as old writes code with twice the speed.\nI really believe that we need to take a step back, embrace the skill of being slow and change the developer culture to understand that the best way to go fast in the long run often is to be “controlled slow” in the short run. \n\nIn this highly interactive talk I will elaborate on the traditional “software developer life cycle” (developer -> team lead -> project leader -> manager) and try to show how we can make those grey hair your biggest asset, just by slowing down.",
      "title": "Get old, go slow, write code!",
      "room": "Room 1 (Prerecorded)",
      "startTime": "2021-12-09T09:30",
      "endTime": "2021-12-09T10:15",
      "startTimeZulu": "2021-12-09T08:30:00Z",
      "endTimeZulu": "2021-12-09T09:15:00Z",
      "id": "978dd0b1-749f-4461-ba1d-d4d9cc32c4e9",
      "sessionId": "978dd0b1-749f-4461-ba1d-d4d9cc32c4e9",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T09:30",
      "startSlotZulu": "2021-12-09T08:30:00Z",
      "speakers": [
        {
          "name": "Tobias Modig",
          "twitter": "@tobiasmodig",
          "bio": "Tobias Modig is a developer, coach, speaker and teacher who values clean code and good habits just as much as a positive work atmosphere. He is passionate about competence sharing and will gladly reveal his tips and tricks as well as confiding his own mistakes to prevent others from repeating them. Tobias has been working as a developer and architect since the late 90s and is currently a Software Development Consultant at Citerus in Stockholm."
        }
      ]
    },
    {
      "intendedAudience": "Presentasjonen er ment for arkitekter og utviklere som driver med hendelses-drevet arkitektur, med fokus på Kafka. Men her er det mye å lære om distribuerte \"garantier\" også.",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "I Ruter bruker vi Kafka til ALT (okey, kanskje ikke alt, men veldig mye). Gjennom de siste årene har vi derfor lært mye om hvordan Kafka kan brukes, og lært en del om hvordan det ikke bør brukes. \n\nVi ønsker å dele erfaringer om hvordan vi bruker Kafka; hvordan vi utvikler mikrotjenester med Kafka som integrasjonsløsning, vår filosofi rundt data på Kafka og hvor langt vi drar strikken. Kan Kafka erstatte databasen for eksempel?\n\nVi setter over Kafkaen, så møt opp da vel!",
      "title": "Sett på kafkaen, vi får gjester.",
      "room": "Room 1 (Prerecorded)",
      "startTime": "2021-12-08T14:40",
      "endTime": "2021-12-08T15:25",
      "startTimeZulu": "2021-12-08T13:40:00Z",
      "endTimeZulu": "2021-12-08T14:25:00Z",
      "id": "ee7a610e-3c07-4b30-9b64-e08c08d15dad",
      "sessionId": "ee7a610e-3c07-4b30-9b64-e08c08d15dad",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T14:40",
      "startSlotZulu": "2021-12-08T13:40:00Z",
      "speakers": [
        {
          "name": "Anders Klever Kirkeby",
          "twitter": "",
          "bio": "Anders er konsulent og partner i Techfolk. Til vanlig jobber han som utvikler i grunnplattform-teamet i Ruter og jobber med kjerne-funksjonalitet rundt kjøp og salg i forbindelse med kollektivtransport i store deler av Norge. "
        },
        {
          "name": "Jørgen Ringen",
          "twitter": "",
          "bio": "Jørgen er seniorkonsulent i Scelto. Til vanlig jobber han som tech-lead i grunnplattform-teamet i Ruter og jobber med kjerne-funksjonalitet rundt kjøp og salg i forbindelse med kollektivtransport i store deler av Norge. "
        }
      ]
    },
    {
      "intendedAudience": "Først og fremst techie folk.\n\nutviklere, arkitekter, teknologer. \n\ngreit med litt kjennskap til tokenbasert autentisering, men ikke et must",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "I NAV har vi mange applikasjoner som kommuniserer med hverandre på vegne av oss borgere. Vi har også et behov for å kontrollere hvilke apper som kan snakke sammen, i tillegg til at vi ønsker å gjøre tilgangskontroll basert på hvem du er.\n\nI en zero-trust arkitektur kan man ikke basere seg på tradisjonelle prinsipper som nettverkssoner, \"security gateways\" og \"servicebrukere\".\nVi har derfor etablert konseptet \"TokenX\" som lar applikasjoner kommunisere sikkert med hverandre ved bruk av tokens samtidig som original sluttbrukerkontekst bevares. \nTokenX er en samling komponenter basert på OAuth 2.0 og Kubernetes i vår applikasjonsplattform NAIS. \n\nKlar for en heftig sesjon med tokens, Kubernetes operatorer, service mesh, og OAuth 2.0 autorisasjonsservere skrevet i Kotlin? Look no further! ",
      "title": "Vi må snakke sammen! (via TokenX og OAuth 2.0)",
      "room": "Room 5",
      "startTime": "2021-12-08T15:50",
      "endTime": "2021-12-08T16:35",
      "startTimeZulu": "2021-12-08T14:50:00Z",
      "endTimeZulu": "2021-12-08T15:35:00Z",
      "id": "6d072992-8fae-44b0-a7bd-2b2434c55bff",
      "sessionId": "6d072992-8fae-44b0-a7bd-2b2434c55bff",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T15:50",
      "startSlotZulu": "2021-12-08T14:50:00Z",
      "speakers": [
        {
          "name": "Youssef Bel Mekki",
          "twitter": "",
          "bio": "Utvikler i 4 år og jobber i NAV og i NAIS plattformen. Brinner for sikkerhet og koding bruker daglig Go og Kotlin.\n"
        },
        {
          "name": "Tommy Trøen",
          "twitter": "",
          "bio": "Tommy er utvikler på NAIS plattformen i NAV og er over snittet interessert i sikkerhet og tokens. Med over 15 års erfaring som utvikler har han fått med seg mye teknologi og sikkerhetsparadigmer som nå heldigvis har endret seg til det bedre. Jobber til daglig med plattformrelaterte dingser og koder mest i Kotlin og Go.\n "
        }
      ]
    },
    {
      "intendedAudience": "Developers and architects who plan their container deployment will get hints how to save disk and traffic with smallest Java containers.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "Have you recently moved to microservices? Your team is deploying the code much faster, but data transfer costs are going up as well, aren’t they? That’s because the size of containers matters the most, and keeping them lightweight means saving on bandwidth usage.\nBellSoft’s engineers have come up with a solution, which is full-fledged Alpine Linux support in OpenJDK. By that, we’ve also invented a real-life TARDIS: Containers that take only a few MB of storage but carry enormous potential. With the release of JDK 16, the Portola Project has been integrated into the OpenJDK mainline as part of our JEP 386. Duct-taping with a glibc layer will become a thing of the past, as all the processes will connect flawlessly. Your company will get to use tiny container images independently of the distribution kit vendor. They have been available for a long time, but the official HotSpot port status for the musl library will expand the scope and simplify related development.\nMy talk is going to touch upon the benefits that Alpine Linux is bringing to the OpenJDK community. It will also explain how to optimize Docker images for free by changing just one or two lines of code. Lastly, I’ll offer a tool for choosing an optimal container that will suit your project perfectly.",
      "title": "Docker Who: Small Containers Through Time and Space",
      "room": "Room 7",
      "startTime": "2021-12-08T14:40",
      "endTime": "2021-12-08T15:25",
      "startTimeZulu": "2021-12-08T13:40:00Z",
      "endTimeZulu": "2021-12-08T14:25:00Z",
      "id": "21e7bc29-7615-471a-812c-b3affdb62fd5",
      "sessionId": "21e7bc29-7615-471a-812c-b3affdb62fd5",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T14:40",
      "startSlotZulu": "2021-12-08T13:40:00Z",
      "speakers": [
        {
          "name": "Dmitry Chuyko",
          "twitter": "dchuyko",
          "bio": "Dmitry Chuyko is a performance architect at BellSoft, one of the most active corporate OpenJDK developers. Before joining BellSoft, he worked on HotSpot JVM in Oracle. His previous experience with Java showed that the most interesting problems in applications find their solutions in the underlying platform. Dmitry is currently mainly optimizing HotSpot for x86 and ARM, and also contributed to the development of JEP 386 to make the smallest Java containers even better.\nDmitry is a committer in OpenJDK and a speaker at conferences such as Oracle Code One, Devoxx, GeeCON or JPoint, as well as at JUG meetups in different countries."
        }
      ]
    },
    {
      "intendedAudience": "Personer med teknisk bakgrunn, trenger ikke være erfaren. Man får nok mest ut av det om man har jobbet med frontend og kanskje spesielt React. ",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Strukturering av filer og komponenter i et prosjekt er en diskusjon man som utvikler helt sikkert kommer til å møte på i løpet av karrieren, og gjerne igjen og igjen. Og som med mye annet er det mange meninger og løsninger på hvordan det kan gjøres.\n\nJeg vil gjerne dele med dere hvordan jeg liker å sette opp prosjektene mine. Garantert en måte å gjøre det på som ikke treffer alle, men hensikten min med foredraget er ikke at alle skal være enige i min måte å gjøre det på, men heller å få frem hvorfor jeg tenker som jeg gjør.",
      "title": "Mapper, komponenter og potensielt kaos - hvordan lager jeg struktur i React-koden min?",
      "room": "Room 2",
      "startTime": "2021-12-08T10:40",
      "endTime": "2021-12-08T11:00",
      "startTimeZulu": "2021-12-08T09:40:00Z",
      "endTimeZulu": "2021-12-08T10:00:00Z",
      "id": "47f65f92-2480-41e3-a59e-28605846ee89",
      "sessionId": "47f65f92-2480-41e3-a59e-28605846ee89",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T10:40",
      "startSlotZulu": "2021-12-08T09:40:00Z",
      "speakers": [
        {
          "name": "Mathilde Wærstad",
          "twitter": "",
          "bio": "Mathilde Wærstad, en 8 år gammel utvikler som vil dele litt av den erfaringen hun har bygget opp i løpet av karrieren."
        }
      ]
    },
    {
      "intendedAudience": "Utviklere, teamledere. Vi vil gi inspirasjon til hvordan man kan jobbe godt i produktteam.",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "Hva er et verdikjedeteam og hvorfor bør man organisere utviklingsteam i verdikjedeteam hvis man er interessert i maksimal verdiskapning? Team Volt var et forsøk fra Statnett å organisere et team annerledes enn det man har gjort før. Nå har teamet eksistert og utviklet seg over flere år. Vi gir en erfaringsrapport fra Statnett, og deler hva vi har gjort - og ikke gjort, for å lykkes. Du vil få høre om hvordan teamet er organisert, hvordan vi jobber og hvilke utfordringer og løsninger vi har.",
      "title": "Verdikjedeteam spiser prosjekter til frokost",
      "room": "Room 6",
      "startTime": "2021-12-08T13:30",
      "endTime": "2021-12-08T14:15",
      "startTimeZulu": "2021-12-08T12:30:00Z",
      "endTimeZulu": "2021-12-08T13:15:00Z",
      "id": "177e3f3b-b01d-485c-b94d-bca2ce027594",
      "sessionId": "177e3f3b-b01d-485c-b94d-bca2ce027594",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T13:30",
      "startSlotZulu": "2021-12-08T12:30:00Z",
      "speakers": [
        {
          "name": "Hanna Lunde Steen",
          "twitter": "",
          "bio": "Hanna Lunde Steen er en Scrum Master som kommer fra forretningssiden innen elkraft, og er opptatt av hvordan et team kan fungere best mulig i sin kontekst. Hun synes det er spennende og viktig å jobbe opp mot organisasjonen rundt teamet, for å skape de beste omgivelsene for å lykkes."
        },
        {
          "name": "John Fjellstad",
          "twitter": "johnfjellstad",
          "bio": "John Fjellstad er en utviklinger til daglig, som har mistet tellinger på antall prosjekter og team han har jobbet med.  Han har lenge vært interessert i hvordan man kan skape en teamkultur skal gjør det mulig for medlemene å yte sitt beste."
        }
      ]
    },
    {
      "intendedAudience": "Utviklere som også er interessert i mennesker og utviklerkultur. ",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "I SpareBank 1 leder utviklere andre utviklere. Da vi etablerte Utvikleravdelingen vår i 2019, var refleksen at vi måtte ha en fulltids leder, slik som de andre avdelingene.\n\nMen måtte vi egentlig det? Flere av oss hadde vært med å bygge opp utviklermiljøet i SpareBank 1 fra vi var en håndfull utviklere. Vi ønkset å fortsette dette arbeidet, men ingen av oss ønsket å slutte å kode.\n\nKom å hør hvordan vi har tatt Utvikleravdelingen vår fra 35 til over 90 personer med ledere som både har hatt tid til å lede, kode og prate på JavaZone - og samtidig finne nye ledere for å erstatte seg selv.",
      "title": "Hvordan lede 86 utviklere og samtidig levere kode hver dag?",
      "room": "Room 7",
      "startTime": "2021-12-09T14:40",
      "endTime": "2021-12-09T15:25",
      "startTimeZulu": "2021-12-09T13:40:00Z",
      "endTimeZulu": "2021-12-09T14:25:00Z",
      "id": "ef97df8e-2b87-4fcc-b9b2-1cc822b6ca8e",
      "sessionId": "ef97df8e-2b87-4fcc-b9b2-1cc822b6ca8e",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T14:40",
      "startSlotZulu": "2021-12-09T13:40:00Z",
      "speakers": [
        {
          "name": "Stian Conradsen",
          "twitter": "",
          "bio": "Utvikler og tidligere leder for utvikleravdelingen i SpareBank 1 Utvikling. Brenner for faget vårt og liker å være med på å utvikle SpareBank 1. Elsker å lese."
        },
        {
          "name": "Vidar Moe",
          "twitter": "",
          "bio": ""
        }
      ]
    },
    {
      "intendedAudience": "Anyone who has to deal with legacy systems in their career should benefit from this. Suitable for beginners.",
      "length": "20",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "A internal service that's vital to the company is left to wither.\nThe people maintaining it has left, and SOMEONE has to deal with it.\nWhat if that someone is you?\nThis talk is the story of how we've managed to reclaim sanity and write off technical debt while keeping the internal stakeholders happy.",
      "title": "Decomissioning an orphaned service",
      "room": "Room 2",
      "startTime": "2021-12-09T14:55",
      "endTime": "2021-12-09T15:15",
      "startTimeZulu": "2021-12-09T13:55:00Z",
      "endTimeZulu": "2021-12-09T14:15:00Z",
      "id": "68b085e4-b426-4a37-a4c6-f80b2a0e38d5",
      "sessionId": "68b085e4-b426-4a37-a4c6-f80b2a0e38d5",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T14:40",
      "startSlotZulu": "2021-12-09T13:40:00Z",
      "speakers": [
        {
          "name": "Kristian Barek",
          "twitter": "",
          "bio": "Kristian Barek has worked as a backend software developer and devops engineer since 2005. Currently working on billing and analytics at Signicat AS."
        }
      ]
    },
    {
      "intendedAudience": "This talk is aimed for developers that want to learn a way to create small and fast containers for Spring projects.\nHaving experience building containers for Java applications would improve the experience but is not a requirement.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "As developers, we aim to use available resources efficiently. This is especially important in the world of containers.\nWorking on the JVM has certain drawbacks relating to memory and CPU consumption at startup.\nThis talk will provide an introduction to how the spring-native project helps create smaller images that are lightning fast with low resource consumption. \nThe talk also covers common challenges and potential drawbacks relating to moving existing projects to spring-native.",
      "title": "Spring Native: Introduction to Native Image for a Spring Boot project",
      "room": "Room 4",
      "startTime": "2021-12-08T15:50",
      "endTime": "2021-12-08T16:50",
      "startTimeZulu": "2021-12-08T14:50:00Z",
      "endTimeZulu": "2021-12-08T15:50:00Z",
      "id": "010da36b-d047-4995-aac3-7aa1ca95b38f",
      "sessionId": "010da36b-d047-4995-aac3-7aa1ca95b38f",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T15:50",
      "startSlotZulu": "2021-12-08T14:50:00Z",
      "speakers": [
        {
          "name": "Geoffrey Rekier",
          "twitter": "@grekier",
          "bio": "I am a senior consultant at JProfessionals with close to 15 years of experience mainly Java and the JVM with a special interest in many Spring projects. "
        }
      ]
    },
    {
      "intendedAudience": "Har du en fin idé? Har du lyst til å lære deg noe nytt? Har du prøvd deg på hobbyprosjekter før, men mistet interessen halvveis? Da er denne talken for deg. \n\nDenne talken passer for alle erfarings- og kunnskapsnivåer.",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "Har du noensinne fått en idé til et hobbyprosjekt, men mista piffen innen du var ferdig med database-designet? Jeg også. Hobbyprosjekt er utrolig gøyale å starte på, men også notorisk vanskelige å komme i mål med.\n\nDet siste året har jeg startet to hobbyprosjekter, som brukes av nesten 3.000 brukere rundt om i landet og har blitt omtalt av en rekke medier. Det har vært noe av det mest givende jeg har gjort på lenge!\n\nDenne talken gir deg noen gode tips til hvordan du kan komme deg fra konsept til kundeverdi før du går lei. Du vil få høre alt fra planlegging og teknologivalg til motivasjon og markedsføring. Og ikke minst, hvordan du bevarer gnisten!",
      "title": "Hvordan lykkes med hobbyprosjektet ditt 🎉",
      "room": "Room 7",
      "startTime": "2021-12-08T13:30",
      "endTime": "2021-12-08T14:15",
      "startTimeZulu": "2021-12-08T12:30:00Z",
      "endTimeZulu": "2021-12-08T13:15:00Z",
      "id": "a7a5bf49-6b2c-4f7e-b4d9-c34156df7c32",
      "sessionId": "a7a5bf49-6b2c-4f7e-b4d9-c34156df7c32",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T13:30",
      "startSlotZulu": "2021-12-08T12:30:00Z",
      "speakers": [
        {
          "name": "Kristofer Giltvedt Selbekk",
          "twitter": "selbekk",
          "bio": "Kristofer Giltvedt Selbekk er 34 år, 186 cm høy og har blitt omtalt som Bekks React-guru - en tittel han synes er både smigrende og utrolig klein.\n\nNår han ikke sitter og programmerer hos Vy, så jobber han med hobbyprosjektene sine Sjau og OPRA, og lever A4-livet til det ytterste."
        }
      ]
    },
    {
      "intendedAudience": "The talk is addressed to Java developers with at least 3 years of experience and basic knowledge of the Spring framework and its inversion of control principle. Listeners will find out how to perform integration testing without deploying to an application server or connecting to other enterprise infrastructure and how to test things like the correct wiring of the Spring IoC container contexts or data access.\n",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "The talk will demonstrate the effective integration testing with Spring: using the Spring TestContext Framework and its annotations; managing dirties contexts and transactions for testing; differentiating the contexts depending on profiles; working with test execution listeners; testing with mock Spring MVCs; reactive testing with WebTestClient.\n",
      "title": "Integration Testing with Spring",
      "room": "Room 6",
      "startTime": "2021-12-09T14:40",
      "endTime": "2021-12-09T15:40",
      "startTimeZulu": "2021-12-09T13:40:00Z",
      "endTimeZulu": "2021-12-09T14:40:00Z",
      "id": "dbbbde58-63b2-4f8c-92e4-ea4f4ec7e9ae",
      "sessionId": "dbbbde58-63b2-4f8c-92e4-ea4f4ec7e9ae",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T14:40",
      "startSlotZulu": "2021-12-09T13:40:00Z",
      "speakers": [
        {
          "name": "Catalin Tudose",
          "twitter": "@CatalinTudose5",
          "bio": "Cătălin Tudose is an experienced software engineer, working with Java since early 2000s. He took part in various telecommunications and financial projects, as a Java senior developer, Java technical team lead, and architect.\n\nHe also developed and delivered trainings for companies and universities on subjects like Java, Spring, Hibernate, Design Patterns, Code Refactoring, Automated Testing, and Software Architecture. Together with Luxoft, he initiated and introduced the \"Advanced Java Programming\" course for the students pursuing their master’s degree at the Faculty of Automation and Computer Science in Bucharest.\n\nHe wrote \"JUnit in Action\" 3rd edition (https://www.manning.com/books/junit-in-action-third-edition) and is the author of 6 courses and 1 project on the Pluralsight platform (https://app.pluralsight.com/profile/author/catalin-tudose).\n\nMore details: \nhttps://www.luxoft-training.com/trainers/tudose/?sphrase_id=11243893 \nhttps://www.linkedin.com/in/catalin-tudose-847667a1/"
        }
      ]
    },
    {
      "intendedAudience": "Java developers and architects\nDevOps engineers\nPerformance engineers",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Java developers today continue to face application performance issues such as long response time or high CPU usage. The usual answer to these problems is tuning the JVM, often by relying on established best practices and lessons learned - but are they effective?\n\nIn this session, I will share some insights I learned by tuning the JVM in a new way: using machine learning to automatically find JVM options that maximize application performance. I will present the new approach and discuss some counterintuitive results and JVM settings ML picked, which show how todays’ tuning practices may actually slow your application down - and what you can do about it. ",
      "title": "We let a machine tune the JVM. Can you guess what happened?",
      "room": "Room 1 (Prerecorded)",
      "startTime": "2021-12-09T15:50",
      "endTime": "2021-12-09T16:50",
      "startTimeZulu": "2021-12-09T14:50:00Z",
      "endTimeZulu": "2021-12-09T15:50:00Z",
      "id": "bb8c48ef-a3e0-424e-8b37-a11afbb55187",
      "sessionId": "bb8c48ef-a3e0-424e-8b37-a11afbb55187",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T15:50",
      "startSlotZulu": "2021-12-09T14:50:00Z",
      "speakers": [
        {
          "name": "Stefano Doni",
          "twitter": "@stef3a",
          "bio": "I have 15+ experience in the performance and capacity planning field, especially working with large enterprise Java applications.\n\nI’ve presented at various conferences and community events about performance like Facebook Performance Summit, CMG and Neotys PAC. In 2015, I won the CMG conference best paper award with a paper on Java performance tuning and capacity planning.\n\nI’m CTO and co-cofounder of akamas.io, where I lead the vision for autonomous performance optimization powered by AI. I’m interested in anything that can improve the performance and efficiency of the stack!"
        }
      ]
    },
    {
      "intendedAudience": "Anyone who's worked in a large organisation with lots of legacy who dreams of transforming it. This talk is suitable both for those who are interested in the technical aspects as well as those who are interested in the organisational ones.",
      "length": "20",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "When you tap your card on the payment terminal, pay an invoice or Vipps your kids pocket money, that transaction passes through an ocean of various banking systems. Many of these systems are made by TietoEVRY and many of them were made in the 80s.\n\nThe “Core Renewal” project is a large project aimed to renew one of the most central parts of the bank infrastructure, the Core Banking part. It is a large project of ~160 people in ~13 teams and it has unfortunately been run as a large project for a long time, resulting in an unknown backlog, untested quality and non-functioning collaboration within the project.\n\nThis is the story of our on-going endeavor to nudge this project into an elite performer. This is our Phoenix Project.",
      "title": "This is our Phoenix Project",
      "room": "Room 2 (Prerecorded)",
      "startTime": "2021-12-08T15:10",
      "endTime": "2021-12-08T15:30",
      "startTimeZulu": "2021-12-08T14:10:00Z",
      "endTimeZulu": "2021-12-08T14:30:00Z",
      "id": "ffa96242-55a4-4d3b-9876-d087c8ac779a",
      "sessionId": "ffa96242-55a4-4d3b-9876-d087c8ac779a",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T14:40",
      "startSlotZulu": "2021-12-08T13:40:00Z",
      "speakers": [
        {
          "name": "Ardit Dika ",
          "twitter": "",
          "bio": "Tech lead at TietoEVRY NX Core. "
        },
        {
          "name": "Moquan Chen",
          "twitter": "moquan",
          "bio": "Chief Practice Lead at Bekk Consulting."
        }
      ]
    },
    {
      "intendedAudience": "Developers who sometimes do manual work, but hate it.\nPeople who want to make their developers' lives better.\nAfter watching this talk you will be able to gradually automate your toil.\nExperience: Basic knowledge of Python",
      "length": "20",
      "format": "lightning-talk",
      "language": "en",
      "abstract": "There are always some parts of work that is manual. You know it can be automated, but creating that automation takes a lot of time.\n\nSo, just this once, you do it manually. You comfort yourself by saying: \"I'll automate it next time. I know I will have time then\". You tell yourself these lies and continue doing the same process manually for a long time.\n\nGradual automation deals with incrementally improving processes. If you can automate just a single step, you are much closer to automation than thinking about fixing it \"some day\".\n\nIn this talk, I'll describe a technique to go from no automation to more automation. We have successfully used this approach in my team over the last months.",
      "title": "Towards a toil-free world. Our gradual automation of manual work",
      "room": "Room 2",
      "startTime": "2021-12-08T11:50",
      "endTime": "2021-12-08T12:10",
      "startTimeZulu": "2021-12-08T10:50:00Z",
      "endTimeZulu": "2021-12-08T11:10:00Z",
      "id": "f91bbfa7-c801-4e17-b1ad-5b19a9c0d1cc",
      "sessionId": "f91bbfa7-c801-4e17-b1ad-5b19a9c0d1cc",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T11:50",
      "startSlotZulu": "2021-12-08T10:50:00Z",
      "speakers": [
        {
          "name": "Peter Stensby Norstein",
          "twitter": "",
          "bio": "Peter works at Kantega AS in central Oslo as a systems developer.\nHe is passionate about developer experience, automation and open source software."
        }
      ]
    },
    {
      "intendedAudience": "Front-end developers who have just started getting to build service workers and PWAs, as well as those who already make or maintain PWAs and want to get acquainted with convenient tools",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "\"I deployed a service worker - now, I need to buy a new domain\" - a well-known joke about the difficulty of implementing your own caching logic. With the arrival of the sixth version of the Workbox library, the trade-off between flexibility and ease of automation of network tasks for PWA is no longer needed. In this talk, I will tell you how to get started with Workbox 6, implement typical functionality for an offline web application, and go further by adding your own caching logic.",
      "title": "Automating a service worker with Workbox",
      "room": "Room 6",
      "startTime": "2021-12-09T10:40",
      "endTime": "2021-12-09T11:25",
      "startTimeZulu": "2021-12-09T09:40:00Z",
      "endTimeZulu": "2021-12-09T10:25:00Z",
      "id": "d13a45b2-b004-406f-b611-a7fd41f3e9ca",
      "sessionId": "d13a45b2-b004-406f-b611-a7fd41f3e9ca",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T10:40",
      "startSlotZulu": "2021-12-09T09:40:00Z",
      "speakers": [
        {
          "name": "Maxim Salnikov",
          "twitter": "webmaxru",
          "bio": "Maxim Salnikov is an Oslo-based cloud and tech community geek. He is a webdev maestro who builds apps since the end of the last century and shares his extensive web platform experience by speaking & training at developer events around the world. Daytime, Maxim is boosting cloud skills at the country scale by leading developer engagement in Microsoft Norway. In the evenings, you'll find him organizing the country's main web & mobile meetups, and two full-scale tech conferences."
        }
      ]
    },
    {
      "intendedAudience": "Developers, operators, builders, architects, SREs, and other engineers.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "While the benefits of distributed computing are undeniable and have revolutionized IT, they do have some challenges. Architectures have grown increasingly complex and can be hard to understand and difficult to debug and test. Chaos engineering is the process of stressing an application in testing or production environments by creating disruptive events, such as server outages or API throttling, observing how the system responds, and implementing improvements. In this session, we'll see how chaos engineering can help improve our application's resilience and performance, uncover hidden issues, expose blind spots, and more.",
      "title": "Improve resiliency and performance with controlled chaos engineering",
      "room": "Room 6",
      "startTime": "2021-12-09T09:30",
      "endTime": "2021-12-09T10:30",
      "startTimeZulu": "2021-12-09T08:30:00Z",
      "endTimeZulu": "2021-12-09T09:30:00Z",
      "id": "34aad425-89db-461b-b666-09a295401a9c",
      "sessionId": "34aad425-89db-461b-b666-09a295401a9c",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T09:30",
      "startSlotZulu": "2021-12-09T08:30:00Z",
      "speakers": [
        {
          "name": "Gunnar Grosch",
          "twitter": "ggrosch",
          "bio": "Gunnar is a Senior Developer Advocate at Amazon Web Services (AWS) based in Sweden. He has previously worked as both a frontend and backend developer, as an operations engineer within cloud infrastructure, and as a technical trainer, in addition to several different management roles. With a focus on building reliable and robust applications, Gunnar has been one of the driving forces in creating techniques and tools for using chaos engineering in serverless. He regularly and passionately speaks at events on these and other topics around the world. Gunnar is also deeply involved in the developer community by organizing user groups, meetups, and conferences."
        }
      ]
    },
    {
      "intendedAudience": "Folk som ikke er eksperter på passord, phishing og webauthn. Man trenger ikke være utvikler, da dette blir et foredrag som ikke viser kode, men som gir den grunnleggende forklaringen som vil hjelpe deg før du tar det i bruk.",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Brukerene våre går daglig i feller der de gir fra seg brukernavn og passord til tredjeparter med onde hensikter i phishingangrep, og alle måtene vi har på å kjempe mot dette går ut på at brukeren må være mer obs eller installere noe som gjør livet litt vanskeligere for brukeren.  Hadde det bare eksistert noe som vi kunne legge inn på nettsidene våre som både stopper phishing òg gjør livet lettere for sluttbrukeren!\n\nI nettlesere som støtter Webauthn kan brukeren logge inn med fingeravtrykket sitt i stedet for passord! Resultatet av dette blir en løsning som kan motvirke phishing samtidig som det oppleves smooooth av brukeren!\n\nJeg skal forklare hvordan dette fungerer, hvorfor det er trygt og vise hvordan denne flyten kan se ut til slutt. Etter foredraget kommer dere til å inneha den grunnleggende forståelsen dere trenger for komme i gang med Webauthn, i tillegg til et brennende ønske om å ta det i bruk!",
      "title": "Kan Webauthn få slutt på phishing?",
      "room": "Room 2",
      "startTime": "2021-12-09T10:40",
      "endTime": "2021-12-09T11:00",
      "startTimeZulu": "2021-12-09T09:40:00Z",
      "endTimeZulu": "2021-12-09T10:00:00Z",
      "id": "e98a0986-5122-4d76-8633-c0439d549713",
      "sessionId": "e98a0986-5122-4d76-8633-c0439d549713",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T10:40",
      "startSlotZulu": "2021-12-09T09:40:00Z",
      "speakers": [
        {
          "name": "Martin Valen",
          "twitter": "",
          "bio": "Martin er en fullstackutvikler i Kantega som tidvis prøver å lære vekk enkle og mindre enkle konsepter."
        }
      ]
    },
    {
      "intendedAudience": "Everyone is welcome with basic understanding of software engineering.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "In the eyes of many people, software engineering and game development are two sides of the same coin. While this is true for some aspects of both fields, there are some key differences that make each an unique experience. During this talk we will discuss these differences between how game developers work and how software engineers work. We will explore some distinctions between methodologies within the two fields and how people handle these. To close it off we will dive into what both fields can learn from each other so that developers can elevate themselves to the next level. ",
      "title": "Five game developer habits that bring software engineers to the next level!",
      "room": "Room 4",
      "startTime": "2021-12-09T10:40",
      "endTime": "2021-12-09T11:25",
      "startTimeZulu": "2021-12-09T09:40:00Z",
      "endTimeZulu": "2021-12-09T10:25:00Z",
      "id": "82d84e80-1e61-46f6-b8b4-5580b522be2c",
      "sessionId": "82d84e80-1e61-46f6-b8b4-5580b522be2c",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T10:40",
      "startSlotZulu": "2021-12-09T09:40:00Z",
      "speakers": [
        {
          "name": "Erik Pronk",
          "twitter": "@erikjpronk",
          "bio": "Erik Pronk is a passionate software engineer that has been working in IT since 2001. During this period he has gained a lot of experience in a variety of technologies, roles, development environments and market segments. His main focus is on implementing enterprise solutions in an agile way. In his spare time, Erik loves to run and experiment with VR and domotics. Erik works at JDriven where he shares his passion and drive with other colleagues."
        },
        {
          "name": " Alexander Chatzizacharias",
          "twitter": "@alex90_ch",
          "bio": "Alexander is a 31-year old Unity3D developer at CGI. He is of Dutch/Greek nationality. Alexander has a bachelor in Game Development (University of applied sciences of Amsterdam) and a master in Game studies (University of Amsterdam). During his master's degree Alexander developed a passion for gamification and software engineering. One of Alexander's career goals is bringing game development and software engineering closer together. He believes that both industries can learn a lot from each other, and is continuously trying to mix technologies and methodologies from both fields."
        }
      ]
    },
    {
      "intendedAudience": "- Fagpersoner som er interessert i brukerinvolvering, brukerfokus, tjenestedesign,  problemløsning og opplevd verdi som en del av IT-utviklingsarbeid.\n- Alle som synes politi er litt kult og lurer på hvordan teknologer kan bidra til å understøtte deres viktige samfunnsoppdrag.\n",
      "length": "60",
      "format": "presentation",
      "language": "no",
      "abstract": "Politiets samfunnsoppdrag er omfattende og variert, og det å være tett på våre brukere som IT-leverandør i offentlig sektor kan noen ganger by på en del action. For mange er politipatruljen politiets ansikt utad, og de er helt avhengige av at våre IT-løsninger fungerer optimalt til enhver tid uansett hvor de befinner seg. Vi har alle lært at god brukerinvolvering gir de beste løsningene, men hvordan gjør man egentlig det når brukeren din er operativ, spredt over hele landet og styrt av akutte hendelser?\n\nNår du jobber brukerfokusert i politiet må du være beredt på å bli satt igjen på en øde landevei med prototypen din. Sånn er det når alarmen går og politiet må være politi og ikke lenger har tid til å teste appen din. \n\n- Hva skjer når et tverrfaglig innovasjonsteam med teknologer møter innsatsledere og patruljer som bare vil gjøre jobben sin der de er, når de er der?\n- Hvordan brukertester du en app mens du bekjemper bilsyke under en utrykningskjøring?\n- Hva er en MVP når det kan stå om liv og død?\n",
      "title": "Brukerinvolvering i blålys: Kunsten å holde fokus i 150 km i timen",
      "room": "Room 5",
      "startTime": "2021-12-09T15:50",
      "endTime": "2021-12-09T16:50",
      "startTimeZulu": "2021-12-09T14:50:00Z",
      "endTimeZulu": "2021-12-09T15:50:00Z",
      "id": "6db7d391-9107-45bd-8063-67a5cbb74a35",
      "sessionId": "6db7d391-9107-45bd-8063-67a5cbb74a35",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T15:50",
      "startSlotZulu": "2021-12-09T14:50:00Z",
      "speakers": [
        {
          "name": "Nina Merete Berg",
          "twitter": "",
          "bio": "Starting out as a mere user, Nina has 12 years of experience as a hub linking business and technology.  In organisations and projects she has taken on the responsibilities of a product owner, business architect, enterprise architect and business analyst, depending on what skills the assignment requires. Her toolkit contains the classics, such as TOGAF, Volere, REQB®, agile methods, sevice design and Design Thinking as well as best practices and handy tricks she has discovered along the way. She will mix and match her capabilities to provide value for her users and the business. \n\nSpeaking experience:\nNina is a frequently used speaker on her specialist subject. This includes conferences, sharing of knowledge with other organizations (including masterclasses) and within our organization of employment. \n\nPlease se her linkedIn profiles for more information:\nhttps://www.linkedin.com/in/nina-m-berg-0b64a62/\n"
        }
      ]
    },
    {
      "intendedAudience": "Gjennom foredraget får publikum innsikt i utviklingsprinsipper, fokus, organisering og fremgangsmåten som ble brukt for å komme i mål med det som på et tidlig tidspunkt ble ansett som en tilnærmet umulig oppgave. Anbefales for deg som ønsker innsikt i hvordan store organisasjoner kan lykkes med smidig utvikling i en rigid internasjonal kontekst.",
      "length": "10",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "De mest fremgangsrike landene i verden har alle minst èn ting til felles – et velfungerende tollsystem som sikrer etterlevelse av lover og regler for grensekryssende vareførsel. En rivende teknologisk utvikling, økt globalisering og fremveksten av nye handelsplattformer og distribusjonsmåter endrer imidlertid forutsetningene for hvordan tollmyndigheter over hele verden velger å løse samfunnsoppdraget. I Norge har vi tatt kravene til omstilling på dypeste alvor. Med produkttankegang, tverrfaglige team og smidig metodikk er Tolletaten nå på hugget for å utvikle morgendagens offentlige sektor.\n\nDette tankesettet ble imidlertid satt kraftig på prøve da Tolletatens smidige utviklingsprinsipper møtte EUs mastodontiske fossefallstilnærming, rigide kravspesifikasjoner og lovfestede tidsfrister i arbeidet med å få opp elektronisk forhåndsvarsling av varer fra tredjeland (ICS2). En svært omfattende operasjon som innebar at 29 land innenfor den europeiske sikkerhetssonen skulle koble seg på EUs fellesløsning for å kunne motta og risikovurdere forhåndsinformasjon om gods som skal passere EUs yttergrense. Da arbeidet startet opp var utfordringene betydelige, spørsmålene mange og fristene knappe. Mandag 15. mars gikk løsningen likevel på lufta i henhold til plan. Dermed kunne Norge ivareta sine internasjonale forpliktelser gjennom Sikkerhetsavtalen. \n\nDette er fortellingen om hvordan Tolletaten rigget seg for å møte en av de største samarbeidsutfordringene i nyere europeisk digitaliseringshistorie. ",
      "title": "Da EU bydde opp Tolletaten til dans",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T13:30",
      "endTime": "2021-12-08T13:40",
      "startTimeZulu": "2021-12-08T12:30:00Z",
      "endTimeZulu": "2021-12-08T12:40:00Z",
      "id": "ce228d9b-f468-4364-b7c0-30b1cec90ef3",
      "sessionId": "ce228d9b-f468-4364-b7c0-30b1cec90ef3",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T13:30",
      "startSlotZulu": "2021-12-08T12:30:00Z",
      "speakers": [
        {
          "name": "Hilde Visthoff Drange",
          "twitter": "",
          "bio": "Hilde er teamleder i Tolletaten. "
        },
        {
          "name": "Kristine Sæhlie",
          "twitter": "",
          "bio": "Kristine er funksjonell arkitekt ansatt i Tolletaten. "
        }
      ]
    },
    {
      "intendedAudience": "The expected audience consists of people who are at least somewhat familiar with the Kotlin programming language, where basic knowledge of the language is sufficient. I see Kotlin Coroutines as one of the big features that Kotlin has to offer over e.g. Java, so by learning about them, Kotlin developers will gain another significant productivity boost over the traditional Java developers.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "Have you ever tried to create a multithreaded application capable of handling all you user requests at the same time, but ended up juggling threads and thread pools, ultimately wondering whether it was worth it in the end? Writing asynchronous or concurrent code has always been notoriously hard. It is difficult to reason about the execution of the code, and requires a lot of boilerplate. Luckily, there is an easier way! Coroutines provide a more intuitive way of writing code that can perform several tasks at once, without much of the usual hassle of dealing with blocking threads and threadpools.\n\nIn this talk, I will introduce you to Kotlin Coroutines, a library for writing asynchronous code, developed by JetBrains. The concept of suspending functions is explained, and you will get a firm grasp of what you can do with Kotlin Coroutines and why you should use them, but more importantly how to use them the way they are intended. You will also learn why it is possible to run thousands of coroutines simultaneously, without creating as many threads!\n\nFurthermore, the concept of non-blocking I/O will be explained by creating a fully reactive web application implemented using Spring WebFlux and R2DBC (reactive JDBC), where Kotlin Coroutines are used as the 'glue' between the incoming HTTP requests and the calls to the database, with as little boilerplate code as possible.",
      "title": "Concurrency made easy with Kotlin Coroutines",
      "room": "Room 5",
      "startTime": "2021-12-09T11:50",
      "endTime": "2021-12-09T12:35",
      "startTimeZulu": "2021-12-09T10:50:00Z",
      "endTimeZulu": "2021-12-09T11:35:00Z",
      "id": "91111b72-a9c8-44cf-b12b-245b25df3530",
      "sessionId": "91111b72-a9c8-44cf-b12b-245b25df3530",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T11:50",
      "startSlotZulu": "2021-12-09T10:50:00Z",
      "speakers": [
        {
          "name": "Riccardo Lippolis",
          "twitter": "",
          "bio": "Riccardo is an inquiring and experienced Java / Kotlin Developer with a passion for solving complex problems. Known by his colleagues as the Kotlin Hipster (probably because of the beard), he is the go-to guy for everything Kotlin-related. He works for JDriven, where he shares his passion and drive with other enthusiasts.\n\nRiccardo has spoken at several conferences, including (but not limited to): JFall (2016, rated #1), DevoxxUK (2017), JavaLand (2017), Code and Comedy (2017, keynote speaker), NextBuild (2017), Spring I/O (2018), GeeCON Kraków (2019), and Heapcon Belgrade (2019)."
        }
      ]
    },
    {
      "intendedAudience": "Talken er beregnet på arkitekter både med funksjonell og teknisk legning - tanken er å gi inspirasjon til måter å strukturere sin egen verden.",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Tolletaten hadde for få år siden IT-løsninger dominert av aldrende, monolittiske applikasjoner. Vi har nå løsninger som i stor grad er «state of the art», med to dominerende løsningsmønstre for to kategorier av problemer.\n\nVi så at løsningene våre falt i to kategorier:\n\n1. det hendelsesdrevne, f.eks. at et bilskilt dukker opp på grensen eller at en pakke er på vei i posten\n2. det analytiske, der vi, basert på det vi har erfart av tidligere hendelser  forsøker å forbedre våre kontroller, så vi bruker tid på det som er verdt å bruke tid på\n\nDette har vi videreført i to ulike måter å lage løsninger på – med en, ofte tidskritisk, hendelsesdrevet verdikjede, og et analytisk domene som tar seg bedre tid til å forstå og lære. Det hendelsesdrevne er dominert av mikrotjenester, Kafka og rendyrking av hendelser som kommunikasjonsform. Det analytiske med verktøy for data pipelines, dataanalyse, etterretning, rapportering og statistikk.",
      "title": "1 arkitektur med 2 ansikter – Janus i 12",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T12:10",
      "endTime": "2021-12-08T12:30",
      "startTimeZulu": "2021-12-08T11:10:00Z",
      "endTimeZulu": "2021-12-08T11:30:00Z",
      "id": "5ebc16af-b0f2-4f3d-8228-ff5dc5644d94",
      "sessionId": "5ebc16af-b0f2-4f3d-8228-ff5dc5644d94",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T11:50",
      "startSlotZulu": "2021-12-08T10:50:00Z",
      "speakers": [
        {
          "name": "Lars Reed",
          "twitter": "",
          "bio": "Arkitekt med et kvart århundres fartstid i Tolletaten, med et Janusansikt mot løsning og et mot teknologi"
        },
        {
          "name": "Gyrd Norvoll",
          "twitter": "",
          "bio": "Funksjonell arkitekt i Tolletaten med lang erfaring fra å lage offentlige løsninger med brukeren i fokus."
        }
      ]
    },
    {
      "intendedAudience": "Backend web developers of any level will learn how to implement a Lamport's happened before relation and use it to make logs more readable.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "No more monoliths! Let's use microservices and asynchronous invocations everywhere! But how to track logs when multiple calls are in place, clocks are skewed, network is faulty and something goes wrong? How to figure out what happened first? And how to debug this single request which caused so many troubles?\n\nIn this talk I explain problems with synchronizing clocks and why relying on timestamps doesn't work in the world of microservices. We will see happened-before relation, vector clocks, correlation ids and other patterns used to introduce some meaningful order. We will understand why common understanding of \"time\" is misleading in distributed systems and what to use to mitigate that.\n\nLevel 200, moderately intense session.",
      "title": "Ordering the chaos - cleaning logs and ordering events in microservices",
      "room": "Room 4",
      "startTime": "2021-12-09T09:30",
      "endTime": "2021-12-09T10:30",
      "startTimeZulu": "2021-12-09T08:30:00Z",
      "endTimeZulu": "2021-12-09T09:30:00Z",
      "id": "c2ad59f1-7ddc-48c4-823b-9c72af12b883",
      "sessionId": "c2ad59f1-7ddc-48c4-823b-9c72af12b883",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T09:30",
      "startSlotZulu": "2021-12-09T08:30:00Z",
      "speakers": [
        {
          "name": "Adam Furmanek",
          "twitter": "furmanekadam",
          "bio": "I am Adam Furmanek and I am a professional software engineer for almost a decade. Right now I am at Amazon working with Big Data, Spark, and Machine Learning. I am always interested in digging deeper, exploring machine code and going through implementation details to better understand internals of the technologies I use every day. That's why I like debugging, decompiling and disassembling the code to understand memory models, concurrency problems and other details hidden deeply inside. In my free time I play ping-pong, watch Woody Allen's movies and blog stuff at http://blog.adamfurmanek.pl"
        }
      ]
    },
    {
      "intendedAudience": "Utviklere og ellers alle som jobber i produktutviklingsteam og/eller med kontinuerlige leveranser.",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "Funksjonsbrytere (feature toggles) har blitt et velkjent verktøy ved digital produktuvikling. Det gir god støtte ved kontinuerlige leveranser og kan forenkle en tilnærming til trunk-basert utvikling, i tillegg til at det tilrettelegger for pilotering / gradvis innføring og eksperimenter som A/B-testing. Teknikken kan implementeres både gjennom enkle, hjemmelagde løsnigner eller ved hjelp av produkter som LaunchDarkly og Unleash.\n\nForedraget gir en introduksjon til konseptet med funksjonsbytere og hva det kan brukes til, før vi ser litt på praktisk bruk i en tradisjonell frontend- / backend-applikasjon. Her bruker vi open source-verktøyet Unleash for å definere brytere og hvordan man kan bruke ulike strategier for å slå på brytere gjennom et admin-grensesnitt. Vi vil se på strategier som er innebygd i verktøyet, som enkel på/av, pilotering for enkelte brukere eller grupper, prosentvis innfasing, samt hvordan man kan definere egne strategier og tilnærminger for å støtte flere miljøer. Vi vil også se litt på robusthet og problemstillinger som kan oppstå i kode som lever over tid.\n\nForedraget blir en miks av foiler, kode, live demoer og Q&A.",
      "title": "Funksjonsbrytere – hvorfor og hvordan",
      "room": "Room 4",
      "startTime": "2021-12-08T11:50",
      "endTime": "2021-12-08T12:35",
      "startTimeZulu": "2021-12-08T10:50:00Z",
      "endTimeZulu": "2021-12-08T11:35:00Z",
      "id": "743af181-a7ef-424e-8489-9906bfe0bd02",
      "sessionId": "743af181-a7ef-424e-8489-9906bfe0bd02",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T11:50",
      "startSlotZulu": "2021-12-08T10:50:00Z",
      "speakers": [
        {
          "name": "Torstein Gjengedal",
          "twitter": "@gjengeda",
          "bio": "Torstein jobber i Bekk, og har vanligvis roller som inkluderer utvikling, systemdesign-/arkitektur, forretningsavklaringer, leveransemodeller og organisering. Han trives med enkel og domenedrevet arkitektur og team som kan levere fort etter moderne prinsipper :) Torstein har snakket på JavaZone og andre konferanser tidligere, og vært med på å arrangere DevOpsDays-konferansen i Oslo."
        }
      ]
    },
    {
      "intendedAudience": "Developers interested in creating tools to improve their workflow.\n\nWe will start with some simple examples for those new to the topic, and have something for more the experienced guys in the end.",
      "length": "45",
      "format": "presentation",
      "language": "en",
      "abstract": "Developers want to write code, and not waste time on other things. As consequence, we hunt for the tech-stack of DevSecOps-tools and services that integrate into perfect symbiosis. The IT world is constantly changing, and so are our needs for a specific toolset. The plugin for integrating X with Y is not maintained anymore/costs too much/has bugs/does not exist/not secure enough/not compatible with Z. This leaves us with doing manual steps in between, where our current tech-stack falls short.\n\nWhat do we do to mitigate this pain? We write scripts. Some were written in Python, others in Ruby, or pure Bash (for the hardcore guys), and we put all these scripts in a repository named «Utils». Most of the Python scripts only work in Python 2.7 and require some obscure dependency that’s not maintained anymore. If anyone decides to change something in one of the scripts, Ragnarok is upon us, because they forgot to do the same in some other script, or accidentally breaks something because, well, there are no tests.\n\nThe famous «Utils»-repository usually holds a lot of great ideas and hidden gems that have accumulated over the years. The main challenges are usually maintenance, enhancement, and test coverage. We are developers, and creating apps that are easy to maintain, enhance, and test is what we do. Let’s.",
      "title": "A Golang CLI to rule them all",
      "room": "Room 5",
      "startTime": "2021-12-09T13:30",
      "endTime": "2021-12-09T14:15",
      "startTimeZulu": "2021-12-09T12:30:00Z",
      "endTimeZulu": "2021-12-09T13:15:00Z",
      "id": "f0e2f62d-0bcb-4290-9264-01c1957b5c09",
      "sessionId": "f0e2f62d-0bcb-4290-9264-01c1957b5c09",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T13:30",
      "startSlotZulu": "2021-12-09T12:30:00Z",
      "speakers": [
        {
          "name": "Tormod Alf Try Tufteland",
          "twitter": "",
          "bio": "Developer in the «shortcuts for everything», «do everything from the terminal» category. Has written a master thesis about Kubernetes and other container orchestrators from NTNU.\n\nMain contributor of the EikaCLI, which is now frequently used by the developers in Eika.\n\nCreator of wsdl2kotlin; a tool written in Rust for generating Kotlin DTO's and functions from WSDL specifications for the client side of SOAP services. This tool will be open sourced by the time JavaZone is held."
        }
      ]
    },
    {
      "intendedAudience": "Developers and architects who have read \"Accelerate\" or the \"State of DevOps\" report and want to become an \"Elite\" software organisation.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Listed on the Thoughtworks tech radar under “adopt” since 2019, the four key metrics are transforming the face of software development. \n\nThe idea behind them is really simple - optimise for lead time, deployment frequency,  change failure rate, and median time to restore - but getting them up and running, and then embedding them within your team and across your organisation isn't so simple. \n\nWhy? To begin with you'll have to answer questions like \"when does lead time start and stop?\", \"which deploys do we count and which do we ignore? (Do infra builds count? What happens if you’re not in production?)\", and \"what makes a change failure, and how do we tell when service is restored?\"  Then you have to gather all these stats automatically.\n\nI’ve rolled out these metrics for multiple companies. I’ll share my lessons learned solving all these problems, and also tackle the far more important topic: how you can use all this data to make your teams awesome!",
      "title": "The Four Key Metrics, Unleashed!",
      "room": "Room 4",
      "startTime": "2021-12-08T13:30",
      "endTime": "2021-12-08T14:30",
      "startTimeZulu": "2021-12-08T12:30:00Z",
      "endTimeZulu": "2021-12-08T13:30:00Z",
      "id": "8962ee92-686f-41b0-a4b4-01c5c56ca003",
      "sessionId": "8962ee92-686f-41b0-a4b4-01c5c56ca003",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T13:30",
      "startSlotZulu": "2021-12-08T12:30:00Z",
      "speakers": [
        {
          "name": "Andrew Harmel-Law",
          "twitter": "al94781",
          "bio": "An over-enthusiastic Tech Principal; Andrew specialises in Java / JVM technologies, agile delivery, build tools and automation, and domain driven design. Experienced across the software development lifecycle and in many sectors including government, banking, and eCommerce, what motivates him is the production of large-scale software solutions, fulfilling complex client requirements. He understands that people, tooling, architecture and process all have key roles to play in achieving this. Andrew has a passion for open source software and its communities. He has been interested in and involved with OSS to a greater or lesser extent since his career began; as a user, contributor, expert group member, or paid advocate. Finally, Andrew enjoys sharing his experience as much as possible. This sharing is not only seen in his formal consulting engagements, but also informally through mentoring, blog posts, conferences (speaking and organising), and open sourcing his code."
        }
      ]
    },
    {
      "intendedAudience": "The main goals are to get the audience to know that current computer systems are heterogeneous. Mobile devices have multicore CPUs and GPUs, as well as laptops and even data centers, that are including reconfigurable hardware (FPGAs) as well. So heterogeneous computing is here to stay. However, but we need to program them somehow. Thus, the goal of my talk is to explain and motivate how to use new hardware efficiently from managed programming languages like Java.\n\nFrom my talk, attendees will learn the need for acceleration, domain and set of applications that are candidates for acceleration and understand which type of applications is most suitable for each hardware (e.g, applications for GPUs vs applications for FPGAs). ",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "The proliferation of heterogeneous hardware in recent years means that every system we program is likely to include a mix of computing elements; each of these with different hardware characteristics that enable programmers to improve performance while decreasing energy consumption. These new heterogeneous devices include multi-core CPUs, GPUs, and FPGAs. This trend has been followed by changes in software development norms that do not necessarily favour programmers.\n\nA prime example is the two most popular heterogeneous programming languages, CUDA and OpenCL, which expose several low-level features to the API, making them difficult to use by non-expert users. Instead of using low-level programming languages, developers in industry and academia tend to use higher-level, object-oriented programming languages, typically executed on managed runtime environments, such as Java, R, Python, and Javascript. Although many programmers might expect that such programming languages would have already been adapted for transparent execution on heterogeneous hardware, the reality is that their support is either very limited or absent.\n\nIn this talk, we present and analyse TornadoVM, a plug-in for OpenJDK that allows JVM programmers to automatically run their applications on multi-core CPUs, GPUs, and FPGAs. Furthermore, TornadoVM performs task-migration from one device to another at runtime, entirely transparent for the user. In this talk, we will summarise the TornadoVM project, and we will explain, via examples, how TornadoVM optimises, offloads and executes applications on heterogeneous hardware, including GPUs and FPGAs for different backends, such as OpenCL, NVIDIA PTX and the brand new SPIR-V backend.\n\nFurthermore, in this talk, attendees will learn what GPU and FPGA computing are, some hardware details, and how to get access to this hardware via TornadoVM.  Additionally, attendees will learn how TornadoVM communicates and extends the GraalVM compiler, making this knowledge more accessible for future extensions and novel ideas.  ",
      "title": "TornadoVM: Transparent Hardware Acceleration for Java…and Beyond!",
      "room": "Room 1 (Prerecorded)",
      "startTime": "2021-12-09T13:30",
      "endTime": "2021-12-09T14:30",
      "startTimeZulu": "2021-12-09T12:30:00Z",
      "endTimeZulu": "2021-12-09T13:30:00Z",
      "id": "6591db29-1f41-4610-aaa9-9ac26998b683",
      "sessionId": "6591db29-1f41-4610-aaa9-9ac26998b683",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T13:30",
      "startSlotZulu": "2021-12-09T12:30:00Z",
      "speakers": [
        {
          "name": "Juan Fumero",
          "twitter": "@snatverk",
          "bio": "Juan Fumero is a Research Fellow at the University of Manchester. His research topics are Heterogeneous High-Level Languages Virtual Machines, GPGPUs, and distributed computing. Currently, he is working as part of the TornadoVM team in a collaboration with Intel for bringing automatic and transparent Graphics Processing Unit (GPU) and (Field Programmable Gate Arrays) FPGA JIT compilation and execution for Java programs. Currently, Juan Fumero is the current lead architect of the TornadoVM project. \n\nHe received a Ph.D. degree from The University of Edinburgh on Accelerating Interpreted Programming Languages on GPUs for Java, R, and Ruby. Additionally, he has also worked as an intern at Oracle Labs and CERN, implementing compilers, and evaluating parallel techniques for multi-core systems.\n\n\nFurther information:\n[1] https://jjfumero.github.io/"
        }
      ]
    },
    {
      "intendedAudience": "Attendees: Software Developers, Decision Makers, Managers\n\nLearning Points:\n- Attendees will learn how Deep Fakes in it's original implementation do work.\n- Furthermore they learn different possibilities how to counterfeit images and/or videos and how to differentiate between fake types.\n- within the project report for Deep Fakes 2.1 attendees will learn how to accomplish an AI project with the goal to realize Deep Fakes in realtime.\n- Attendees will learn about auto-encoders, transfer learning, GAN (generative adversarial networks) and much more.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Today's real-time Deepfake technology makes it possible to create indistinguishable doppelgängers of a person and let them participate in video calls. Since 2019, the TNG Innovation Hacking Team has intensively researched and continuously developed the AI around real-time Deepfakes. The final result and the individual steps towards photorealism will be presented in this talk.\n\nSince its first appearance in 2017, Deepfakes have evolved enormously from an AI gimmick to a powerful tool. Meanwhile different media outlets such as \"Leschs Kosmos\", Galileo and other television formats have been using TNG Deepfakes.\n\nIn this talk we will show the different evolutionary steps of the Deepfake technology, starting with the first Deepfakes and ending with real-time Deepfakes of the entire head in high resolution. Several live demos will shed light on individual components of the software. In particular, we focus on various new technologies to improve Deepfake generation, such as Tensorflow 2 and MediaPipe, and the differences in comparison to our previous implementations.",
      "title": "Pushing Deepfakes to the Limit - Fake video calls with AI",
      "room": "Room 1 (Prerecorded)",
      "startTime": "2021-12-08T10:40",
      "endTime": "2021-12-08T11:40",
      "startTimeZulu": "2021-12-08T09:40:00Z",
      "endTimeZulu": "2021-12-08T10:40:00Z",
      "id": "33bb6754-77f3-43ba-b1ef-01c6fa160cff",
      "sessionId": "33bb6754-77f3-43ba-b1ef-01c6fa160cff",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T10:40",
      "startSlotZulu": "2021-12-08T09:40:00Z",
      "speakers": [
        {
          "name": "Martin Förtsch",
          "twitter": "@MartinFoertsch",
          "bio": "Martin Förtsch is an IT-consultant of TNG Technology Consulting GmbH based in Unterföhring near Munich who studied computer sciences. Workwise his focus areas are Agile Development (mainly) in Java, Search Engine Technologies, Information Retrieval and Databases. As an Intel Software Innovator and Intel Black Belt Software Developer he is strongly involved in the development of open-source software for gesture control with 3D-cameras like e.g. Intel RealSense and has built an Augmented Reality wearable prototype device with his team based on this technology. Furthermore, he gives many talks on national and international conferences about Artificial Intelligence, Internet of Things, 3D-camera technologies, Augmented Reality and Test Driven Development as well. He was awarded with the Oracle JavaOne Rockstar."
        },
        {
          "name": "Thomas Endres",
          "twitter": "@originalone1984",
          "bio": "In his role as a Partner for TNG Technology Consulting in Munich, Thomas Endres works as an IT consultant. Besides his normal work for the company and the customers he is creating various prototypes - like a telepresence robotics system with which you can see reality through the eyes of a robot, or an Augmented Reality AI that shows the world from the perspective of an artist. He is working on various applications in the fields of AR/VR, AI and gesture control, putting them to use e.g. in autonomous or gesture controlled drones. But he is also involved in other Open Source projects written in Java, C# and all kinds of JavaScript languages.\n\nThomas studied IT at the TU Munich and is passionate about software development and all the other aspects of technology. As an Intel Software Innovator and Black Belt, he is promoting new technologies like AI, AR/VR and robotics around the world. For this he received amongst others a JavaOne Rockstar award."
        }
      ]
    },
    {
      "intendedAudience": "If you already have or are going to have a Postgres or two in production, and you're not already an expert, chances are you'll hear of at least a few topics you will want to dig deeper on. Postgres is a very capable database, and few are aware of all its features. \n\nThe talk assumes familiarity with basic SQL, such as creating tables, indexing and basic writing and querying of data.\n",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "This presentation is a fast-paced walk-through of very useful but occasionally lesser-known features of Postgres, the open source database. The talk covers widely, providing lots of pointers to select resources that go deeper. The goal is that you will hear of several topics to learn more about – whether it's when developing, live debugging or learning to avoid production problems in the first place.\n\nExample nuggets:\n- How does this query actually execute, and how does it change as data grows?\n- How can I easily create large amounts of test data?\n- What's slow in production right now?\n- How can I apply my schema changes without requiring a maintenance window?\n- What's powering the Postgres-backed GraphQL engines?\n\nThe talk presents you with several appetizers to tempt you to go deeper with Postgres on your own. If you consume all the references provided, you may have several days worth of material to dig into – and a much bigger tool box.\n",
      "title": "Postgres can do THAT?",
      "room": "Room 1 (Prerecorded)",
      "startTime": "2021-12-08T09:30",
      "endTime": "2021-12-08T10:30",
      "startTimeZulu": "2021-12-08T08:30:00Z",
      "endTimeZulu": "2021-12-08T09:30:00Z",
      "id": "da5887ab-0d53-4280-a7c6-62b3875d48e1",
      "sessionId": "da5887ab-0d53-4280-a7c6-62b3875d48e1",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T09:30",
      "startSlotZulu": "2021-12-08T08:30:00Z",
      "speakers": [
        {
          "name": "Alex Brasetvik",
          "twitter": "alexbrasetvik",
          "bio": "Alex co-founded a Norwegian startup whose managed Elasticsearch service was acquired by Elastic in 2015, becoming Elastic Cloud. After almost 10 years of Elasticsearch, he now works for Cognite. At Cognite, Alex focuses on the databases behind Cognite's contextualisation platform, where his favourite database Postgres is becoming increasingly important.\n\nWhen he's not working with databases and performance problems in the cloud, he likes to jump out of planes and play with real clouds.\n"
        }
      ]
    },
    {
      "intendedAudience": "Utviklere, arkitekter, testere og funksjonelle vil ha utbytte av foredraget",
      "length": "45",
      "format": "presentation",
      "language": "no",
      "abstract": "Skatteetaten har utviklet en helt ny løsning for innsending og behandling av skatteopplysninger. Løsningen gir helt nye muligheter for å gi veiledning til den skattepliktige under utfyllingen, og løsningen har også gode mekanismer for intern kontroll av skattemeldingene som sendes inn. For å realisere disse veiledningene og kontrollene har etaten utviklet et eget domenespesifikt språk basert på Kotlin. Dette språket gjør det mulig for fagpersonene å selv ikke bare spesifisere, men også utvikle og teste valideringene. Ettersom spesifikasjon og implementasjon smelter sammen til en, får fagpersonene full oversikt over valideringens virkemåte og funksjon, og de kan dermed jobbe svært effektivt. Kotlin har vist seg spesielt velegnet for å lage domenespesifikke språk, da Kotlin har mange egenskaper som gir mulighet for å definere en enkel syntaks som ligner det menneskelige språket.",
      "title": "Domenespesifikt språk for skatteveiledning og kontroll",
      "room": "Room 6",
      "startTime": "2021-12-08T11:50",
      "endTime": "2021-12-08T12:35",
      "startTimeZulu": "2021-12-08T10:50:00Z",
      "endTimeZulu": "2021-12-08T11:35:00Z",
      "id": "39b3e6cb-514e-442d-848f-d280b260e00a",
      "sessionId": "39b3e6cb-514e-442d-848f-d280b260e00a",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T11:50",
      "startSlotZulu": "2021-12-08T10:50:00Z",
      "speakers": [
        {
          "name": "Emil Urnes",
          "twitter": "",
          "bio": "Emil Urnes jobber som arkitekt og utvikler i Skatteetaten. Han er opptatt av å lage effektive løsninger som en billige å forvalte og som har kortest mulig vei fra behov og spesifikasjon til kjørbar produksjonskode. Emil har jobbet med javaløsninger i en årrekke, både i Skatteetaten, NAV og andre virksomheter. De siste årene har Emil vært med på et skifte fra Java til Kotlin, og sett hvilke store fordeler dette gir i forhold til produktivitet og kodekvalitet."
        }
      ]
    },
    {
      "intendedAudience": "Developers with a reasonable experience of Java, who are looking to understand more about the deployment options for microservices. Specifically, those who want to gain a better understanding of the different performance options and advantages and disadvantages of each.",
      "length": "60",
      "format": "presentation",
      "language": "en",
      "abstract": "Microservices have become the prevalent architectural approach to developing applications.  Moving from a monolithic application to multiple container-based services has many advantages.  One of the largest is dynamic scalability; spinning up and shutting down instances of services to adapt to dynamic loads is very cost-effective in a public cloud environment.\n\nFor JVM-based applications, running in a managed environment using JIT compilation, provides additional challenges.  Primarily, this is around the time required for a service to warm up and reach the optimum level of performance.  To address this, we have seen various approaches such as the Graal VM and Quarkus that use an AOT approach rather than JIT compilation.\n\nIn this session, we will explore the pros and cons of both approaches to help in understanding the tradeoff between initial performance and overall\nperformance.  At the end of the session, you will have a clear idea of how to approach your Java microservice design from the AOT and JIT perspective.",
      "title": "AOT or JIT: Faster Startup or Faster Code?",
      "room": "Room 7",
      "startTime": "2021-12-09T10:40",
      "endTime": "2021-12-09T11:40",
      "startTimeZulu": "2021-12-09T09:40:00Z",
      "endTimeZulu": "2021-12-09T10:40:00Z",
      "id": "00f1dba2-6beb-425a-9acd-8af767580d8f",
      "sessionId": "00f1dba2-6beb-425a-9acd-8af767580d8f",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-09T10:40",
      "startSlotZulu": "2021-12-09T09:40:00Z",
      "speakers": [
        {
          "name": "Simon Ritter",
          "twitter": "speakjava",
          "bio": "Well known speaker at Java and other conferences."
        }
      ]
    },
    {
      "intendedAudience": "Denne talken kan oppleves av absolutt alle, utviklere som ikke-utviklere, både eiere og skeptikere av internett-tilkoblede dingsebomser. Forhåpentligvis blir du klokere og vet hvordan du best sikrer dine smarte enheter. ",
      "length": "20",
      "format": "lightning-talk",
      "language": "no",
      "abstract": "Siden begrepet 'Internet of Things' først dukket opp i 1999, har trenden med internet-tilkoblede dingser sneket seg på oss, før antallet enheter de siste 8 til 10 årene har eksplodert eksponensielt. Det virker som alt man kjøper kan kobles på nett og har en app, enten man trenger det eller ei. Fra tannbørster til panelovner og kaffevekter, ja til og med dørmatta kan varsle fra om noen står på den. Utenfor konsumermarkedet står industring og laster opp med investeringer innen sensorer og smarte måleinstrumenter, og fra storkapitalens høyborg i Davos hviskes det om den fjerde industrielle revolusjon takket være tingenes internett. Hva er ståa rundt IoT i 2021, og er vi egentlig klare over hva det faktisk vil si å ha brødristeren sin på nett? Hva skjer når 300 000 IP kameraer plutselig blir tatt over av et aggresivt botnet? Hva er konsekvensene av alltid tilstedeværende smarthøytalere, og hvordan kan man best mulig beskytte seg mot sine egne smartlyspærer?\n\nDette og mere til får du i denne lyntalen, som med et humoristisk men alvorlig skråblikk ser på \"the state of IoT\" i 2021 og hvilke typiske sikkerhetsutfordringer tingenes internett lider av, konsekvensene av dem og hva man selv kan gjøre for å sikre seg mot egne dingser.",
      "title": "IoIT: Internet of Insecure Things",
      "room": "Room 3 (Prerecorded)",
      "startTime": "2021-12-08T15:20",
      "endTime": "2021-12-08T15:40",
      "startTimeZulu": "2021-12-08T14:20:00Z",
      "endTimeZulu": "2021-12-08T14:40:00Z",
      "id": "0802a56f-e2e6-46b2-99b3-b36bfbed0db5",
      "sessionId": "0802a56f-e2e6-46b2-99b3-b36bfbed0db5",
      "conferenceId": "48aaa57f-bcf7-46a9-aa96-a9e82447fe5c",
      "startSlot": "2021-12-08T14:40",
      "startSlotZulu": "2021-12-08T13:40:00Z",
      "speakers": [
        {
          "name": "Andreas Mosti",
          "twitter": "@amostii",
          "bio": "Andreas Mosti jobber som senior utvikler hos Bekk Consulting i Trondheim, hvor han er fagleder for faggruppa Sikkerhet. Andreas er en utadvent backend-utvikler som liker å fikle med infrastuktur og kontinuerlige leveranser."
        }
      ]
    }
  ]
}