{"sessions":[{"intendedAudience":"Java developers from junior to intermediate level that spend more time in the code than in the configuration and Java junior architects","endTimeZulu":"2019-09-12T09:50:00Z","format":"lightning-talk","length":"10","language":"en","sessionId":"62077090-873b-433b-ba5c-2ce13472574a","video":"363508553","abstract":"Which Garbage collectors save you more money in the Cloud? What's the difference between a Serial and a Parallel GC? What is Shenandoah and why is so good? Do you know which GC you are using daily?\nA quick visual overview on the Java Garbage collectors, the GC will be explained in plain English without Statistical formulas.","title":"Garbage Collectors for busy Java developers","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T09:40:00Z","speakers":[{"twitter":"@marcomolteni","pictureUrl":"https://www.gravatar.com/avatar/ef619c225f56f02cc6ef1431e28b1977?d=mm","name":"Marco Molteni","bio":"Marco Molteni started to develop with Java 1.0. Java brought him to work in 8 countries for the FinTech industry. He served the Java Expert Group for Bean Validation 2.0. His current focus is the development of applications with Java and Angular. \nHe is organiser of the Java Zurich meetup in Switzerland.\nActive blogger on http://javaee.ch and in his spare time maintainer the http://javademo.io website trying to give back some knowledge to the dev community.\n"}],"startTime":"2019-09-12T11:40","endTime":"2019-09-12T11:50"},{"intendedAudience":"This presentation is suitable for all developers interested in how they can expand their toolbox with web assembly and be able to make a sound assessment of when and how it should be used. ","endTimeZulu":"2019-09-11T10:25:00Z","format":"presentation","length":"45","language":"en","sessionId":"23a1be3d-dcc6-45ef-a629-b4f2c141d03d","video":"365055257","abstract":"During the last decades a growing trend has been to put more and more functionality into the client by using the latest and greatest JavaScript framework. But what if we could be using native code in the browser in order to run computations faster and potentially reuse code from the backend in the frontend. \n\nEnter Web Assembly. Web assembly is a new web standard which enables you to run native code as part of your current JavaScript framework. This talk will give you a thorough understanding of what web assembly is and how you can use it in your project. \n\nWe will cover a practical example writing our web assembly using Rust. We will go through everything from writing your web assembly code to publish it as a npm package and finally use it in an existing web application.\n\nThis presentation is suitable for all developers interested in how they can expand their toolbox with web assembly and be able to make a sound assessment of when and how it should be used.\n","title":"Why you should consider Web Assembly in your next frontend project ","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T09:40:00Z","speakers":[{"twitter":"@agrevlis","pictureUrl":"https://www.gravatar.com/avatar/971e5cd382d188a8c97d0ae3c2cf5e18?d=mm","name":"Håkan Silfvernagel","bio":"Håkan holds a Master of Science degree in Electrical Engineering and in addition, he holds a Master’s degree in Leadership and Organizational behavior. He has also taken courses on university level in psychology, interaction design and human-computer interaction. He has 19 years’ experience of software development in various positions such as developer, tester, architect, project manager, scrum master, practice manager and team lead. \n\nHåkan is also part of the local chapter of the Norwegian .NET User Group Oslo (NNUG).\n"}],"startTime":"2019-09-11T11:40","endTime":"2019-09-11T12:25"},{"intendedAudience":"This talk is for everyone who knows or wants to learn Kotlin and is curious about how coroutines work. It is probably of most interest to Android developers (new or experienced).","endTimeZulu":"2019-09-12T09:20:00Z","format":"presentation","length":"60","language":"en","sessionId":"f8a24f7f-87b1-4442-b8ad-17735863cfdd","video":"362759965","abstract":"Kotlin is considered a simple language to learn for Java developers. However, the first time you look at coroutine code, you might get a puzzled look on your face and wonder what this is all about.\n\nCoroutines enable you to write sequential code instead of callbacks for async tasks. In this talk we will explore the possibilities of coroutines and how we can use them together with Android Architecture Components and the MVVM pattern. We will start by discussing the most important keywords of coroutines and how they work, and then look at different situations where coroutines can be a good option.","title":"Improve your Android architecture by using coroutines","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T08:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/583b4132c83079050e4ed5874e482729?d=mm","name":"Andreas Færøvig Olsen","bio":"Andreas is an Android developer and team lead at Knowit Objectnet."}],"startTime":"2019-09-12T10:20","endTime":"2019-09-12T11:20"},{"intendedAudience":"Developers, Java / Javascript / Fullstack. It is specifically designed for developers / engineers, not security experts.","endTimeZulu":"2019-09-10T15:30:00Z","registerLoc":"https://moosehead.javazone.no/#/register/handson_java_security_workshop_how_safe_is_your_application","format":"workshop","length":"240","language":"en","sessionId":"28292c52-3437-4039-b83e-d37ea70044b3","abstract":"Security issues and cybercrime are rising to an alarming rate. As a Java web developer, you should be aware of how important security and securing your client's data is. In this workshop, you will become the hacker and exploit vulnerabilities in packages that exist in the wild that might be part of your Java applications today. We will also show you how to protect yourself to these threats by building up a pipeline and development workflow with security testing in mind. This practical hands-on session will be fun and leave you with actionable takeaways on how to implement DevSecOps and prepare against the big bad world.","title":"Hands-on Java Security Workshop: How safe is your application?","room":"Room D","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-10T11:30:00Z","speakers":[{"twitter":"@BrianVerm","pictureUrl":"https://www.gravatar.com/avatar/77b3347563a86d38c780e97cbb68cc1b?d=mm","name":"Brian Vermeer","bio":"Developer Advocate for Snyk and Software Engineer with over 10 years of hands-on experience in creating and maintaining Software. He is passionate about Java, (Pure) Functional Programming and Cybersecurity.\n\nBrian is an Oracle Groundbreaker Ambassador and regular international speaker on mostly Java related conferences like JavaOne, Oracle Code One, Devoxx BE, Devoxx UK, Jfokus, JavaZone and many more.\n\nBesides all that Brian is a military reserve for the Royal Netherlands Air Force and a Taekwondo Master / Teacher."},{"twitter":"@sjmaple","pictureUrl":"https://www.gravatar.com/avatar/e578c444b839cf65f9199c719b75ded5?d=mm","name":"Simon Maple","bio":"Simon is the Director of Developer Relations at Snyk, a Java Champion since 2014, JavaOne Rockstar speaker in 2014 & 2017, Duke’s Choice award winner, Virtual JUG founder and organiser and London Java Community co-leader."}],"startTime":"2019-09-10T13:30","endTime":"2019-09-10T17:30"},{"intendedAudience":"Would be good if people know a bit about JVM JIT compilers and maybe a rudimentary understanding of Machine Learning. But I will explain both.","endTimeZulu":"2019-09-11T13:05:00Z","format":"presentation","length":"45","language":"en","sessionId":"01dccddb-0dc3-4eb9-8eda-72426a069414","video":"362770699","abstract":"Running Twitter services on Graal has been very successful and saved Twitter a lot of money on datacenter cost. But we would like to run more efficient to reduce cost even more. I mean, who doesn’t? In order to do this we are using our Machine Learning framework called Autotune to tune Graal inlining parameters. This talk will show how much performance improvement we got by autotuning Graal.","title":"Performance tuning Twitter services with Graal and Machine Learning","room":"Room 6","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T12:20:00Z","speakers":[{"twitter":"christhalinger","pictureUrl":"https://www.gravatar.com/avatar/b09938ba6328ae2549b84e9d4ce26d68?d=mm","name":"Chris Thalinger","bio":"Chris Thalinger is a software engineer working on Java Virtual Machines for over 14 years. His main expertise is in compiler technology with Just-In-Time compilation in particular. Initially being involved with the CACAO and GNU Classpath projects, the focus shifted to OpenJDK as soon as Sun made the JDK open-source. Ever since Chris has worked on the HotSpot JVM at Sun, Oracle and now at Twitter."}],"startTime":"2019-09-11T14:20","endTime":"2019-09-11T15:05"},{"intendedAudience":"Denne presentasjonen passer for enhver som vil høre litt om innsiden av FINN.no - hvilken utviklerkultur vi mener er viktig, hvorfor vi er opptatt av fart og glade utviklere. Innholdet er en blanding av teknikker og prinsipper, og krever ingen spesielle forkunnskaper, annet enn interesse for arkitektur, platform og utviklingsfart.","endTimeZulu":"2019-09-12T13:20:00Z","format":"presentation","length":"60","language":"no","sessionId":"60e5c715-7e61-4c64-8776-d5da89063c4d","video":"360768831","abstract":"I 2009 ble den første lille tjenesten trukket ut av monolitten til FINN.no. Nå leverer vi 1200+ ganger til produksjon hver uke. Hvordan beholder vi kontrollen? Hvilke teknikker / verktøy bruker vi for å kunne få til dette? Hvordan deler vi opp plattformen for å unngår at teamene går i beina på hverandre? Hva prøvde vi egentlig å oppnå i 2009? Hvorfor har ikke FINN ennå lansert \"min favoritt-feature\"?\n","title":"Hvordan bygge en plattform som gir høy fart? - 10 år med mikrotjenester hos FINN.no","room":"Room 7","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T12:20:00Z","speakers":[{"twitter":"spjelkavik","pictureUrl":"https://www.gravatar.com/avatar/6a9bd39b5d3ef0e1ecca535ee94b3b08?d=mm","name":"Henning Spjelkavik","bio":"Henning har jobbet med FINN.no siden 2004 - blant annet med den første utgaven av reise-portalen og kart. Idag har han en arkitekt-tittel, men bruker både tcpdump og kan ta ned FINN med en commit på master."},{"twitter":"ivarconr","pictureUrl":"https://www.gravatar.com/avatar/5ea83b0543ea6c4eabd91eff17c232e4?d=mm","name":"Ivar Conradi Østhus","bio":"Ivar er en av arkitektene i FINN, med tidligere spesielt fokus på front-end - og har også jobbet med jobb-produktene. Han er initativtager og forvalter av open-source prosjektet Unleash og gründeren av Unleash-hosted.com"}],"startTime":"2019-09-12T14:20","endTime":"2019-09-12T15:20"},{"intendedAudience":"Developers and others who are interested in enhancing their skills and knowledge.","endTimeZulu":"2019-09-11T10:10:00Z","format":"lightning-talk","length":"10","language":"en","sessionId":"2ceb70e4-6c2d-4952-9820-78d807dd07a3","video":"362764369","abstract":"In 2018, I was accepted as a mentor for a Bitcoin and cryptocurrency online course by Princeton University on the coursera.org e-learning platform. In this lightning talk, I will tell you how I got accepted, what it has given me, and why you also should become a mentor.","title":"Enhance Your Skills by Being a coursera.org Mentor","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T10:00:00Z","speakers":[{"twitter":"@jkBaltzersen","pictureUrl":"https://www.gravatar.com/avatar/ab74a0515c59ab63d73c812887aa651d?d=mm","name":"Jørn K Baltzersen","bio":"Jorn K Baltzersen is an experienced software developer, who started programming in elementary school between the bushes of Africa. He loves learning new things. He is a speaker and trainer, having given training courses in debating, as an example, of up to a full day."}],"startTime":"2019-09-11T12:00","endTime":"2019-09-11T12:10"},{"intendedAudience":"This session is targeted at Java Developers who have not had an opportunity to learn about cryptography and its Java support. Also, It's a good refresher for more experienced developers.","endTimeZulu":"2019-09-12T14:40:00Z","format":"presentation","length":"60","language":"en","sessionId":"9a6f28f2-dfdc-4bbe-81e8-e0ac1af08b1b","video":"360765244","abstract":"So you're logging in to your favorite crypto currency exchange over https using a username and password, executing some transactions,  and you're not at all surprised that, security wise, everything's hunky dory...\n\nEver wondered about the amount of cryptography begin used here? No? Let's dive into the key concepts of cryptography then, and see how the JDK supports this using the standard cryptography API's: JCA (Java Cryptography Architecture) and JCE (Java Cryptography Extension)! We'll be exploring message digests, encryption, and digital signatures, and see how they'are used in password checks, https, and block chain technology.\n\nAfter this session, you'll have a better understanding of basic cryptography, its applications, and how to use the cryptography APIs in Java.\n","title":"Cryptography 101 For Java Developers","room":"Room 7","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T13:40:00Z","speakers":[{"twitter":"@MichelSchudel","pictureUrl":"https://www.gravatar.com/avatar/a20394a72a58247b19bd35e67787a590?d=mm","name":"Michel Schudel","bio":"Michel Schudel has been a passionate Java developer since 1998, building various Java solutions for banks, insurance companies and telecom providers. Since then he has seen the good, the bad and the ugly in Java land. He loves agile development and coding with frameworks like SpringBoot to get up-and-running as fast as possible. Futhermore, he loves sharing knowledge by giving presentations and workshops, and by coaching junior developers in Core Java."}],"startTime":"2019-09-12T15:40","endTime":"2019-09-12T16:40"},{"intendedAudience":"If you are building distributed systems in the presence of Microsoft Active Directory, Keycloak, ID-porten, BankID or social login providers, you need to know this. The technology is simpler than you think and mastering it will open new possibilities. The workshop will be hands-on so you better bring your coding tools.","endTimeZulu":"2019-09-10T11:00:00Z","registerLoc":"https://moosehead.javazone.no/#/register/secure_your_application_with_openid_connect_workshop","format":"workshop","length":"240","language":"no","sessionId":"367f96cb-81f2-49e4-a143-97a8dcb8d220","abstract":"If we can trust the user we can do anything. If we can't trust our user, we can do nothing.\n\nAlmost all applications need to know who the user is. You could establish a user database with a password, but what prevents any random user to register as Donald Duck or Barack Obama? How do you find out who to trust?\n\nModern identity systems like Azure Active Directory, ID-porten (for Norway) as well as less secured ones use a standard to establish the user identity with your application. In this workshop we will build from stratch the parts of a JavaScript application that are needed to make it work with leading OpenID Connect providers together.\n\nThis workshop will be a hands-on codealong session. We will have a starting example and I will lead the participants through the different steps of integrating with an OpenID Connect provider with Azure Active Directory, ID Porten and Google. Bring a computer with a Java development environment.\n\n\nThe demo application used in the workshop is available on https://github.com/jhannes/identity-fun . A live version is running on https://javabin-openid-demo.azurewebsites.net/","title":"Secure your application with OpenID Connect (workshop)","room":"Room C","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-10T07:00:00Z","speakers":[{"twitter":"jhannes","pictureUrl":"https://www.gravatar.com/avatar/4f603396c8723741d2665f87beb4d1f2?d=mm","name":"Johannes Brodwall","bio":"Johannes is a programmer and provocateur. He works for Sopra Steria in Oslo where he builds software for a living. The last years he has been increasingly concerned about the role of privacy, security and identity management. By working from foundations up, he is constructing an identity management system that takes full advantage of Active Directory, ID-porten and other identity providers to enable cross-organization sharing of information."},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/d918ee8ddbe36f1310f7b67a6163583e?d=mm","name":"Cato Førrisdahl","bio":"Cato works for Sopra Steria Norway, building and composing software solutions. Through the years he has worked with software development and deployment for companies in a variety of industries. Lately he has been focused on security, Identity & Access Management and OpenID Connect."}],"startTime":"2019-09-10T09:00","endTime":"2019-09-10T13:00"},{"intendedAudience":"Developers at any level.","endTimeZulu":"2019-09-11T14:25:00Z","format":"presentation","length":"45","language":"en","sessionId":"3f04cac9-ffdf-44ea-9604-454aedc87ea9","video":"362504639","abstract":"The developer's workspace is where everything happens. \nDo you need to provide a fully functional developer workspace to someone who normally don't have the set up, such as a reviewer or manager? Or provide a pre-configured workspace for workshops or instruction sessions?\nEclipse Che is based on Docker and Kubernetes, so it fits right into your development stack. \nIt allows you to share and collaborate on developer workspaces without the need to install anything locally, just provide a link to whoever needs to have a look, regardless of where on the planet they are located.\n\nWith electron and the language server protocol, VisualCode has erased the distinction between desktop and web technology and given an effective way to extend language support in an IDE. This has been adopted by Eclipse Che, so it supports a growing number of technologies. \n\nOther programming languages have been in the browser for ages, let's see what we can do with Java!","title":"Cloud collaboration with Eclipse Che","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T13:40:00Z","speakers":[{"twitter":"MSkarsaune","pictureUrl":"https://www.gravatar.com/avatar/82f1a2c27bcd9ddd4749d926b345eee4?d=mm","name":"Martin Skarsaune","bio":"Martin Skarsaune is a passionate developer and Co-Owner in Kantega. His primary interest is programming languages, craftsmanship and tools."}],"startTime":"2019-09-11T15:40","endTime":"2019-09-11T16:25"},{"intendedAudience":"If you want to understand what underlying cryptographic concepts in all kinds of encryption schemes and application work on a comprehensible conceptual level then attend this talk for an overview with many examples and some fun as well! No heavy math in this presentation.\nAt CodeOne 2018 the previous version of this talk received a rating of 4,87. ","endTimeZulu":"2019-09-12T09:05:00Z","format":"presentation","length":"45","language":"en","sessionId":"c730c1e0-3529-4b8e-924d-ac75abe87e84","video":"365624452","abstract":"Cryptography is a fast evolving field with many ingenious concepts.. Take Zero Knowledge proofs, Scriptless scripts, Mimble Wimble and Schnorr Signatures for instance. All cool crypto concepts that enable more than just the safe transmission of data. But how can you use them and how do they work? How secure is the underlying encryption anyway? In this talk I'll provide a short history of encryption approaches and end with explaining advanced crypto solutions at a conceptual level. Expect a fun talk where the hard stuff is explained in a comprehensible way! ","title":"Cool Cryptographic Concepts","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T08:20:00Z","speakers":[{"twitter":"roywasse","pictureUrl":"https://www.gravatar.com/avatar/acc9193f67e6ab7d227a391170038f45?d=mm","name":"Roy Wasse","bio":"Love technology and always want to know how underlying concepts work. Studied Computer Science and Philosophy of Technology. Worked for many years as a developer, development manager, founded a Java consultancy company, and been a Dutch Java User Group leader for over 5 years. Spoke at several conferences live Devoxx, Code One and Teqnation. "}],"startTime":"2019-09-12T10:20","endTime":"2019-09-12T11:05"},{"intendedAudience":"Dette er delvis en erfaringsrapport om det å konvertere fra Java til Kotlin, og delvis en diskusjon om hva \"Arkitektur\" er, og hvordan vi i en liten startup jobber med arkitektur.\nErfaring med Java og litt større javaprosjekt er en fordel.","endTimeZulu":"2019-09-11T13:05:00Z","format":"presentation","length":"45","language":"no","sessionId":"39dc2310-54a9-4207-a500-98ec016badd4","video":"362783192","abstract":"Vi er en vellykket Fintec startup med flere tusen kunder. Vinteren 2018/2019 skrev vi om hele vår kodebase fra Java til Kotlin. Jeg forteller deg hvorfor vi gjorde det og hvordan det gikk. Du lærer ikke Kotlin i dette foredraget. Vel, en del kan det hende at du lærer hvis du aldri har sett Kotlin før. Men det blir mer fokus på hva arkitektur og teknologivalg er, og hva man kan forvente seg av gevinster. I tillegg kommer jeg nok til å sparke litt i skinnleggen til \"Arkitekturfaget\", som jeg pleier å gjøre.","title":"Hvorfor vi valgte Kotlin!","room":"Room 7","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T12:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/21c8f0be4296037f029ae2fb61ed886f?d=mm","name":"Trond Pedersen","bio":"Trond er en engasjert og løsningsorientert utvikler og arkitekt og CTO i Monner. Han er en ivrig deltager i Oslos utvikler-miljø, og var blant annet med på å etablere  Smidig-Konferansen og XP-meetup. Han har vært en forkjemper for smidig systemutvikling siden 2001 og setter stor pris på gode diskusjoner om alle aspekter ved systemutvikling"}],"startTime":"2019-09-11T14:20","endTime":"2019-09-11T15:05"},{"intendedAudience":"Beginner","endTimeZulu":"2019-09-11T15:30:00Z","format":"lightning-talk","length":"10","language":"en","sessionId":"3c44de89-3541-436b-b8cf-56a9d6a6ccf6","video":"362769572","abstract":"Being the new technical leader is not easy. With lots of humor speaker will share three real life stories that all went pretty bad, including its learning lessons. Join this session if you want to learn how to thrive in a technical leadership role.","title":"Surviving as the New Technical Leader - Real Life Stories","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T15:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/75d6f0b5c65204c6026b04eb35e298d3?d=mm","name":"Michael Åhs","bio":"Michael Åhs is interested in technology at the intersection of things, from development, to ops, to security, usability and organizations. He has spent almost 20 years learning how to do the right thing by doing a lot of the wrong things first - working with a variety of companies in multiple domains around the world. He hopes to save you from some of that pain by sharing his passion for looking into the \"why\" of things, to help better understand them. Away from his desk you can find him organizing OSWA community events."}],"startTime":"2019-09-11T17:20","endTime":"2019-09-11T17:30"},{"intendedAudience":"The presentation (plus live code) is based on the experience of testing Arcade Analytics with a lot of different databases. The presentation is targeted to any developer of any level of experience that wants to improve the quality of the code delivered.  ","endTimeZulu":"2019-09-11T12:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"1946864f-72bd-477c-8e91-aff404ebe2c1","video":"362762261","abstract":"Integration testing is hard, and often teams are tempted to do it in production. Testcontainers allows writing meaningful integration tests spawning Docker containers for databases, queue systems, kv-store, other services. The talk, a blend of slides and live code, will show how we are able to deploy without fear while integrating with a dozen of different datastores. Don't mock your database with fake data anymore, work with real data","title":"Integration tests: use the containers, Luke!","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T11:00:00Z","speakers":[{"twitter":"robfrankie","pictureUrl":"https://www.gravatar.com/avatar/3e9f5b66e81ac2fc5dcfcd69de5117d4?d=mm","name":"Roberto Franchini","bio":"A passionate software craftsman with 20 years of experience. \nAs CTO of an innovative startup, I still love to code and improve my technical skills. \nI was part of the OrientDB team, where I was focused on full text and spatial search indexes, JDBC driver and continuous integration and delivery of the product.  \nIn the past, I was the tech lead for a firm specialized on NLP (at scale), big data/fast data and social media monitoring.\n"}],"startTime":"2019-09-11T13:00","endTime":"2019-09-11T14:00"},{"intendedAudience":"If you are using Maven to build and maintain your code, or just generally curious about writing your own plugin, this is for you.\n\nYou will need basic knowledge of both Java and Maven; but rest assured, workshop material will definitely be provided ahead of time.","endTimeZulu":"2019-09-10T15:45:00Z","registerLoc":"https://moosehead.javazone.no/#/register/the_math_and_aftermath__discover_and_instrument_your_code_with_maven","format":"workshop","length":"120","language":"en","sessionId":"46f927e0-0d06-4a55-b80c-5e4394ac8350","abstract":"Working on legacy code-bases can only be boring if you let it; see the beauty of ancient code is not only the ability to discover it, but also the capacity to instrument it and modify it to the better.\n\nFrom enabling a monorepo of scattered repositories, to tracking down code that needs to be deprecated and replaced at a large scale, my team has seen it all.\n\nIn this workshop, you will discover the basics of writing a maven plugin, and how to use it to your advantage the same way we did.","title":"The math and aftermath - discover and instrument your code with Maven","room":"Room C","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-10T13:45:00Z","speakers":[{"twitter":"@dviqueen","pictureUrl":"https://www.gravatar.com/avatar/bacbd177aa2c3a02e2ccbecb0e08f3ec?d=mm","name":"Hasnae Rehioui","bio":"Hasnae is a dreamer trapped in an over-achiever, and when it comes to her beloved product Confluence Server, she dreams big. Most importantly she does it with style, character, and a great focus on quality which inspires her team and anyone else she gets to work with to improve and grow in their own respective roles.\nShe’s an expert at using wit and humour to shed light on nasty code health problems, and contributes fresh perspectives on how to address them."}],"startTime":"2019-09-10T15:45","endTime":"2019-09-10T17:45"},{"intendedAudience":"Developers, Architects interested in real-time, streaming-based Visualization","endTimeZulu":"2019-09-12T08:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"80b1a0e0-9f6a-40e0-84db-4975114b172c","video":"362772712","abstract":"Most data visualisation solutions today still work on data sources which are stored persistently in a data store, using the so called “data at rest” paradigms. More and more data sources today provide a constant stream of data, from IoT devices to Social Media streams. These data stream publish with high velocity and messages often have to be processed as quick as possible. For the processing and analytics on the data, so called stream processing solutions are available. But these only provide minimal or no visualisation capabilities. One option is to first persist the data into a data store and then use a traditional data visualisation solution to present the data. If latency is not an issue, such a solution might be good enough. An other question is which data store solution is necessary to keep up with the high load on write and read. If it is not an RDBMS but an NoSQL database, then not all traditional visualisation tools might already integrate with the specific data store. An other option is to use a Streaming Visualisation solution. They are specially built for streaming data and often do not support batch data. A much better solution would be to have one tool capable of handling both, batch and streaming data. This talk presents different architecture blueprints for integrating data visualisation into a fast data solution and then we show how the different blueprints can be implemented by mapping products onto the blueprints.\n","title":"Streaming Visualisation","room":"Room 7","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T07:00:00Z","speakers":[{"twitter":"gschmutz","pictureUrl":"https://www.gravatar.com/avatar/1e99155e901a43f58b5a2efc38dc483f?d=mm","name":"Guido Schmutz","bio":"Guido Schmutz works for Trivadis, an IT services provider located in central Europe. He has more than 30 years of technology experience. At Trivadis he leads the Trivadis Architecture Board. He has long-time experience as developer, coach, trainer, and architect in the area of building complex Java EE and SOA-based solutions. In the past few years he mostly worked in Big Data / Fast Data projects with technologies such as Hadoop, Spark, Cassandra, Kafka as well as container technologies such as Docker, Mesos and Kubernetes. Guido is an Oracle Groundbreaker Ambassador and ACE director and a regular speaker at international conferences such as CodeOne, JavaOne, Kafka Summit, Voxxed Days, UKOUG conference and DOAG. \n"}],"startTime":"2019-09-12T09:00","endTime":"2019-09-12T10:00"},{"intendedAudience":"Who should attend this session? \n- Software Developers, Manager, Decision Makers interested in AI topics\n\nHow will the participants benefit from attending?\n- The talk covers an introduction into Deep Learning to prepare the audience to understand how \"Style Transfer\" really works. With this knowledge attendees will understand how neural networks for image recognition work and how they can be useful for real world applications (others than Style Transfer) which have business value.\n\nWhat experience (if any) should the audience have to get the most value out of your talk?\n- talk is prepared for Beginners and Advanced. Beginners are expected to have more fun, as they will understand how image recognition nets will work. Advanced developers might already know that.","endTimeZulu":"2019-09-12T14:40:00Z","format":"presentation","length":"60","language":"en","sessionId":"c19492fb-7af5-488c-ad5c-66f042a18f27","video":"360791966","abstract":"What if Virtual Reality glasses could transform your environment into a three-dimensional work of art in realtime? What if every detail of the world would be shown in the style of a painting from Van Gogh? One of the many interesting developments in the field of Deep Learning is the so called \"Style Transfer\". \n\nIt describes a possibility to create a patchwork (or pastiche) from two images. While one of these images defines the the artistic style of the result picture, the other one is used for extracting the image content. The Hardware Hacking Team from TNG Technology Consulting managed to build an application using OpenCV and Tensorflow to realize such goggles. When you see the world through these glasses, your environment will be displayed in the styles of famous painters like Claude Monet or Pablo Picasso. \n\nWithin this talk you will be introduced into the scientific field of Realtime Style Transfer. It will also cover and explain in detail the Deep Learning techniques used for this application.","title":"Style Transfer - How neural networks generate art","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T13:40:00Z","speakers":[{"twitter":"https://twitter.com/MartinFoertsch","pictureUrl":"https://www.gravatar.com/avatar/f8f9d52396a04da81150072b566b7122?d=mm","name":"Martin Förtsch","bio":"Martin Förtsch is an IT-consultant of TNG Technology Consulting GmbH based in Unterföhring near Munich who studied computer sciences. Workwise his focus areas are Agile Development (mainly) in Java, Search Engine Technologies, Information Retrieval and Databases. As an Intel Software Innovator and Intel Black Belt Software Developer he is strongly involved in the development of open-source software for gesture control with 3D-cameras like e.g. Intel RealSense and has built an Augmented Reality wearable prototype device with his team based on this technology. Furthermore, he gives many talks on national and international conferences about Internet of Things, 3D-camera technologies, Augmented Reality and Test Driven Development as well. He was awarded with the JavaOne Rockstar award."},{"twitter":"https://twitter.com/originalone1984","pictureUrl":"https://www.gravatar.com/avatar/caae61dc642a7080b0be4a97632f231b?d=mm","name":"Thomas Endres","bio":"In his role as an Associate Partner for TNG Technology Consulting in Munich, Thomas Endres works as an IT consultant. Besides his normal work for the company and the customers he is creating various prototypes - like a telepresence robotics system with which you can see reality through the eyes of a robot, or an Augmented Reality AI that shows the world from the perspective of an artist. He is working on various applications in the fields of AR/VR, AI and gesture control, putting them to use e.g. in autonomous or gesture controlled drones. But he is also involved in other open source projects written in Java, C# and all kinds of JavaScript languages.\n\nThomas studied IT at the TU Munich and is passionate about software development and all the other aspects of technology. As an Intel Software Innovator and Black Belt, he is promoting new technologies like AI, AR/VR and robotics around the world. For this he received amongst others a JavaOne Rockstar award."}],"startTime":"2019-09-12T15:40","endTime":"2019-09-12T16:40"},{"intendedAudience":"The talk is focused on the interfaces between systems and can be attended by anyone who have programmed.  Key takeaways: Some pitfalls to avoid when making your next API.\n","endTimeZulu":"2019-09-11T09:10:00Z","format":"lightning-talk","length":"20","language":"en","sessionId":"77dcc258-948f-4e15-8e64-07ce4477bb5b","video":"364737687","abstract":"\nAPIs come in multiple forms - code-level interfaces, REST, RPC, graphql.\nOver the years, I've seen some hopeless, funny or downright vile attempts at APIs. And a couple of nice ones.\nI'll be showing some of the gruesome details of the bad ones and giving some pointers to how they could have been improved.\n","title":"The worlds worst APIs - and a few of the good ones","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T08:50:00Z","speakers":[{"twitter":"thomasarp","pictureUrl":"https://www.gravatar.com/avatar/681164f4476d77ddbbb297314d3291ab?d=mm","name":"Thomas Arp","bio":"Thomas is concerned with quality at all levels of the code; not least the interface it exposes to the rest of the world. Over a decade, he's been working with a variety of Bekks customers, trying to create the best possible APIs. And sometimes failing.\n"}],"startTime":"2019-09-11T10:50","endTime":"2019-09-11T11:10"},{"intendedAudience":"Developers and technical architects who want to know if the PWA technology is ready for their use case.\n\nProduct owners who want to know more about the possibilities and limitations of PWA’s before a team commits to the technology. ","endTimeZulu":"2019-09-12T14:25:00Z","format":"presentation","length":"45","language":"en","sessionId":"23e0cba1-cc5d-4203-b5b4-e70937cb2bb1","video":"360833233","abstract":"Progressive web apps have been the talk of the town the last few years. What is the hype, and is there more than hype to it? How far has the technology gotten? Will it solve our use case? In this talk the speaker will go through the process of building a PWA with focus on the good, the bad and the ugly. Going into detail about the advantages and disadvantages, the speaker will leave you with a thorough understanding of how far the PWA technology has gotten. You will know exactly what problems PWAs can solve for you today and you will have an idea of what PWAs can solve for you in the near future.","title":"PWAs - Are They Useful Yet?","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T13:40:00Z","speakers":[{"twitter":"hannakamperud","pictureUrl":"https://www.gravatar.com/avatar/5f02c30db190c809cfa9f45704795528?d=mm","name":"Hanna Holler Kamperud","bio":"A recovering consultant now working as a Fullstack developer at FINN.no. Enjoys telling a good story and knows what a good story can accomplish. Master’s degree in Computer Science from NTNU, Trondheim, Norway. Is currently focused on helping consumers make smart choices in the realm of personal finance.\n"}],"startTime":"2019-09-12T15:40","endTime":"2019-09-12T16:25"},{"intendedAudience":"Everyone who do not (yet) check their dependencies for known vulnerabilities should attend this lightning talk.","endTimeZulu":"2019-09-12T12:50:00Z","format":"lightning-talk","length":"10","language":"en","sessionId":"8ca35b55-6687-4ae6-8d6c-75afeaee4dff","video":"363515528","abstract":"In 2017 several Fortune 100 companies received unwanted media attention when a vulnerability in the Struts framework caused their system to be practically wide open (https://www.zdnet.com/article/critical-security-bug-threatens-fortune-100-companies/). The best-known victim Equifax may have leaked personal information for as many as 100.000 Canadian customers (https://globalnews.ca/news/3755234/equifax-breach-canada/).\n \nThe security vulnerability in Struts was quickly fixed, but millions of applications using older versions of Struts were still live. Fixing this requires building, testing, release and deploy, all of which takes time. Assuming you even KNOW your dependencies are vulnerable. Time matters. Each hour your application is running in production with a known vulnerability increases the risk of exploitation. So what can you as a developer do to prevent your company from becoming the next Equifax?\n \nIn this lightning talk I demonstrate how to use OWASP's little known plugins for Maven and SBT to check your third party libraries for known vulnerabilities. By comparing the version of your dependencies against a public database, it will generate a nice report with some explanations and links to the full vulnerability disclosures.\n \nThis is an important tool for you when deciding whether to upgrade dependencies in your project or not, and is probably the single most cost-effective way for developers to make their applications more secure.\n","title":"Discover known vulnerabilities in your dependencies in less than 5 minutes","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T12:40:00Z","speakers":[{"twitter":"@javaguruen","pictureUrl":"https://www.gravatar.com/avatar/e58fb718794c9432f40d8444e95fe7fb?d=mm","name":"Bjørn Hamre","bio":"Bjørn Hamre is a senior developer at Ambita with more than 20 years experience as a backend developer. He is currently a board member for javaBin and active in javaBin Bergen. Over the last years Bjørn has given many presentations and workshops in local user groups and held workshops at conferences for kids (Booster kids and JavaZone kids). "}],"startTime":"2019-09-12T14:40","endTime":"2019-09-12T14:50"},{"intendedAudience":"Alle med interesse for teknologi, som liker å se andre feil og få seg en god latter (i det minste kjenne seg igjen og trekke på smilebåndet).","endTimeZulu":"2019-09-11T15:20:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"b293dc50-d763-4896-885e-a7a1eb50b192","video":"362754811","abstract":"Alle snakker om psykologisk sikkerhet og at det må være greit å feile. Det er jeg et levende bevis på.\n\nI gamle dager programmerte Jan Henrik på Amigaen; fra han var 13 år omtrent. Siden den gang har han gjort mye rart, og feilet uttallige ganger. I denne historien mimres det tilbake om databaser, unix, domeneforståelse, umodne produkter og hastige beslutninger, feil i produksjon og ville teknologivalg. \n\nHåper noen liker meg etterpå.","title":"Det er greit å gjøre feil: 20 år med tabber","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T15:00:00Z","speakers":[{"twitter":"janhenrik","pictureUrl":"https://www.gravatar.com/avatar/fe68375258216e805f0c03a55b79e6ac?d=mm","name":"Jan Henrik Gundelsby","bio":"Jan Henrik er CTO og Principal Engineer i Knowit Objectnet med 20 års erfaring som utvikler og arkitekt i store prosjekter og programmer. Han er en av hovedarkitektene bak Oslo kommunes satsning på digitalt førstevalg, og han har vært sentral i å bygge en DevOps-kultur og mikrotjenestearkitektur. Jobber tett med forskningsmiljøer rundt autonome team og digitale plattformer. "}],"startTime":"2019-09-11T17:00","endTime":"2019-09-11T17:20"},{"intendedAudience":"You have some knowledge of CI as Jenkins, CircleCI or Travis. After this presentation you will have enough knowledge to start using Github to do your tests and deploying. You will also get the know-how to start deploying from a chat client like Slack.","endTimeZulu":"2019-09-11T12:50:00Z","format":"lightning-talk","length":"10","language":"en","sessionId":"94c97c89-572d-4e0b-8744-77c0f4d64a9e","video":"362773299","abstract":"Late last year, Github released a CI tool called Github Actions. It responds to Github Events and starts off workflows that uses docker containers to do the work. At Unacast we found Github Actions particularly interesting, and I’ll tell you why and how it is becoming an integral part of our CI and replacing Circle CI, Hubot and Heaven. If you are using or considering Github today, you should attend this talk to learn how to reduce clutter and increase maintainability in your projects.","title":"Ready, Set, Github Action","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T12:40:00Z","speakers":[{"twitter":"judoole","pictureUrl":"https://www.gravatar.com/avatar/e36ebce4ab76ac233a45ff5973bc46f5?d=mm","name":"Ole Christian Langfjæran","bio":"Ole Christian Langfjæran is a senior engineer at Unacast, with 15 years of working experience as a software developer. In his career he has worked as a fullstack developer with deep experience in continuous integration (CI). Today he works in fast paced start-up at Unacast where all developers are responsible for developing, operations and quality of the products delivered. "}],"startTime":"2019-09-11T14:40","endTime":"2019-09-11T14:50"},{"intendedAudience":".","endTimeZulu":"2019-09-11T08:40:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"073db4ba-f14a-40b6-9125-073ea9a1b901","video":"362775360","abstract":"The 50th anniversary of Simula, the first object-oriented programming language, was\nheld at the Department of Informatics, University of Oslo on 27th September, 2017.\nJames Gosling, the inventor of Java, gave overwhelming credit to the legacy of Simula\nin his lecture. He mentioned that a number of programming languages nowadays\ncompile to JVM. During his lecture, I began to wonder - why has no team made a simula\nimplementation in java, written in java that compiles to java / java virtual machine(JVM).\nInspired by the lectures on the Simula Jubilee, I began to ask myself if I should try to\nmake a Simula implementation using today's tools. It should certainly be a Recursive\nDescent parser followed by traditionally checker and a code generator.\nMost of the code generator was rather straitforeward except a few points:\n– Quasi-paralell Sequencing\n– Simula's old fashion goto-statement\nI will explain how the new consept of delemitted continuations can be used to implement\ncoroutines and QPS, and, if we have time for it, how Java's exception handling together\nwith byte code egineering can be used to re-introduce goto in the Java Language.\nAn open source project was established creating a full-fledged Simula Implementation\nstrictly after 'Simula Standard'. See: https://portablesimula.github.io/github.io/","title":"Re-inventing Simula using Java","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T08:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/27f4270de2974b02e1a7273766c05063?d=mm","name":"Øystein Myhre Andersen","bio":"Veteran Software Developer, born may 1946.\n\nI started as a young student at Norwegian Computing Center in 1967.\n\nWorked in Simula implementation teams on various platforms from the very beginning.\n\nI had a central role in designing the Portable Simula System in the 70's.\n\nWas a co-owner of Simula as.\n\nMy speciality was Runtime Design and Code Generation.\n\nI have also worked at The Norwegian Defence Research Establishment (NDRE), SIEMENS Telecom and Telenor R&D"}],"startTime":"2019-09-11T10:20","endTime":"2019-09-11T10:40"},{"intendedAudience":"Anyone who is deploying to a container platform or using containers locally can benefit from this talk. You don't need previous experience with Docker, and you don't need any knowledge of Kubernetes or similar platforms.\n\nAttendees will learn how they can use containers without becoming experts in Docker, lxc, Linux, or other lower level technologies. They can focus on building apps and services that create value for their companies.","endTimeZulu":"2019-09-11T11:45:00Z","format":"presentation","length":"45","language":"en","sessionId":"79455491-4caf-4de4-acb1-9ff52cc6fbd6","video":"362773342","abstract":"Docker images are great. But as an application developer, Dockerfile may not be the best mechanism to create them with. There will be no foolish wand-waving or silly incantations in this talk--you'll learn about source-centric tools you can use to build and deploy Docker images.","title":"Defence Against the Docker Arts","room":"Room 6","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T11:00:00Z","speakers":[{"twitter":"@codefinger","pictureUrl":"https://www.gravatar.com/avatar/abf2c321be67e74e86c3b83e871593f0?d=mm","name":"Joe Kutner","bio":"Joe is the Java Language Owner at Salesforce Heroku and a co-founder of buildpacks.io. He is the author of Deploying with JRuby, Remote Pair Programming, and the Healthy Programmer."},{"twitter":"@hone02","pictureUrl":"https://www.gravatar.com/avatar/ac7f7f050ade421ee11b467c8570a3cd?d=mm","name":"Terence Lee","bio":"Terence co-created buildpacks in 2011 at Heroku. Since then he's owned the Heroku Ruby experience and now works on Cloud Native Buildpacks."}],"startTime":"2019-09-11T13:00","endTime":"2019-09-11T13:45"},{"intendedAudience":"Attendees interested in deep learning, audio processing and real world deployments of machine learning systems.","endTimeZulu":"2019-09-12T09:05:00Z","format":"presentation","length":"45","language":"en","sessionId":"17cba995-7626-4eb2-ab3c-0b597858bd25","video":"360761228","abstract":"TIDAL is a music streaming provider with a huge music catalogue. One part of our machine learning efforts is understanding and categorising the content, music and other. We will talk about how we use the Amazon Web Services platform to do large scale machine learning for audio. Including how we develop and train specialised deep learning models and do large scale inference in Apache Spark.","title":"Large scale machine learning for music","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T08:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/7345d974559ca62e2d2be4972c75944a?d=mm","name":"André Lynum","bio":"André Lynum is a Senior Machine Learning Engineer in the Big Data team at TIDAL and has over 10 years of machine learning experience in industry and academia. His background is extensive and covers data mining, natural language processing, image recognition, recommender systems and audio processing."},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/88aab5c68fbb45a72fafcd02eb8b51f5?d=mm","name":"Tao Ma","bio":"Tao Ma is a Senior Machine Learning Engineer in the Big Data team at TIDAL."}],"startTime":"2019-09-12T10:20","endTime":"2019-09-12T11:05"},{"intendedAudience":"People working with microservices architecture - developers, testers, architects. Some initial background with development/testing of microservices is recommended.","endTimeZulu":"2019-09-11T09:05:00Z","format":"presentation","length":"45","language":"en","sessionId":"fad29b0f-e8a1-4ff6-be66-1d086b5a1bec","video":"362761362","abstract":"Typical microservices environment consists of many services. In order to provide business value, they need to cooperate. Therefore, it is crucial to ensure that services are always able to communicate with each other. What if by accident a developer introduces a change to one service, which will make inter-service communication impossible? It is necessary to prevent such situations from happening. Therefore, HL Tech developed an open source project called Judge Dredd. Judge Dredd tests if any change introduced to any service would break communication within any environment.\n\nIn my presentation I would briefly discuss a threats to communication in microservices environment, contract testing as a typical solution and how Judge Dredd realizes contract testing. I will present possible alternatives and their disadvantages. I will show roadmap of further development of Judge Dredd.","title":"Contract testing in microservices environment with Judge Dredd","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T08:20:00Z","speakers":[{"twitter":"Felipe444F","pictureUrl":"https://www.gravatar.com/avatar/3402cd238693fc07a4ded07d826788ae?d=mm","name":"Filip Łazarski","bio":"Graduate of Warsaw University of Technology. Has almost 7 years of experience in software engineering. Initially worked in R&D projects in telecommunication industry, later in projects in logistic industry. For almost 3 years involved in projects in financial sector. Lately he focuses on DDD approach to software development and contract testing between services in microservices architecture. He contributes to open source projects in the latter subject."}],"startTime":"2019-09-11T10:20","endTime":"2019-09-11T11:05"},{"intendedAudience":"Anyone using the National Registry (Folkeregister) data, or interested in testing, or the applications of machine learning\n","endTimeZulu":"2019-09-11T08:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"7a59305e-df7d-4008-99ca-21df10d81bed","video":"362505773","abstract":"The Norwegian National Registry is undergoing a modernization process, and so are the consumers of its services and data. To ensure a smooth transition, we are building a test environment dedicated to integration testing across these organizations and their systems. To the heart of this test environment is a synthetic population, representative of the Norwegian population and its dynamics. In this talk, I will explain how we use machine learning techniques to build this synthetic population. Further, I will describe how our solution accounts for privacy, and ensures that neither the people nor the events in the synthetic population can be traced to individuals or events in the real population. We will investigate the results of a series of experiments where Long Short Term Memory networks were used to generate synthetic data, and discuss the lessons learnt and challenges of applying machine learning in this context.","title":"Synthetic Norway: How We Use Machine Learning to Generate a Synthetic Population?","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T07:00:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/1867b5c13635d50d559ecf4bd7d1c484?d=mm","name":"Razieh Behjati","bio":"Razieh Behjati is a senior consultant at Testify AS. She serves as the CTO of the company, while also leading the Machine Learning group there. Currently she is working on the project for Modernizing the Norwegian National Registry, where her focus is on developing a synthetic Norwegian population intended for facilitating testing activities. She has a PhD in Software Engineering from University of Oslo and Simula Research Laboratory. Since 2009 she has been involved in various industrial and research projects aimed at developing more effective techniques for verification and validation of embedded software systems, software product families, and information-intensive services. Her research nowadays is focused on studying the application of machine learning, and optimization techniques in software testing."}],"startTime":"2019-09-11T09:00","endTime":"2019-09-11T10:00"},{"intendedAudience":"Dette er for deg som er synes det er gøy å bruke koding til noe kreativt, deg som elsker CSS, men kanskje fremfor alt deg som synes CSS kan være noe skikkelig dritt.\n\nDet er en fordel om du har sett en CSS-kodesnutt en gang eller to, men utover det kreves det ingen forkunnskaper.","endTimeZulu":"2019-09-12T11:40:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"77fae908-af47-41bf-9942-7b21e475da0b","video":"363513036","abstract":"Kan man lage et webbasert «skytespill» uten JavaScript? Spoiler alert: Ja, det kan man! Og det med under 150 linjer HTML og CSS.\n\nDet er ikke uten grunn at flere kjenner seg igjen med Peter Griffin som krangler med en persienne, når de skal sentrere en div. CSS klarer på en merkelig måte å være et av de letteste, men samtidig et av de vanskeligste programmeringsspråkene å lære for en webutvikler. Men CSS kan brukes til så mye mer enn å lage Standard nettside™, og i denne talken vil jeg vise et inspirerende eksempel du aldri vil finne på w3schools\n","title":"CSS: Global offensive","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T11:20:00Z","speakers":[{"twitter":"mfeiring","pictureUrl":"https://www.gravatar.com/avatar/d52605cf003644384a6fc3ab7eee96c7?d=mm","name":"Mira Thoen Feiring","bio":"Mira er frontendutvikler og faggruppeleder for CSS i Bekk. Hun vil kalle seg selv en CSS-evangelist og digger å jobbe med kode som gjør både utviklere og brukere glade."}],"startTime":"2019-09-12T13:20","endTime":"2019-09-12T13:40"},{"intendedAudience":"Anyone interested in creating successful websites - designer, developer, project manager or other.","endTimeZulu":"2019-09-12T14:20:00Z","format":"lightning-talk","length":"10","language":"en","sessionId":"c29d8256-5a25-42b6-9516-fb07af827147","video":"363523086","abstract":"As a developer I used to think of accessibility as a chore focusing on content being accessible for screen readers and other helpful devices. \nI've listened to and heard about how to browse online as a full- or partial blind user. Sometimes mentioning users with hearing impairments and RGB-blindness.\n\nYet accessibility is so much more, and it shouldn't be a tedious chore!\n\nLet's explore accessibility further and dive into some other user cases.","title":"Accessibility is much bigger than you might think","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T14:10:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/b6040cf41c2c4b32f6839934ed83c727?d=mm","name":"Kamilla Svendsen","bio":"Kamilla is a Frontend developer working at Itera. \nA study-background in linguistics led from german language to programming languages. The interest of semantics and cognition stayed put and combined well into an absolute passion for web-accessibility."}],"startTime":"2019-09-12T16:10","endTime":"2019-09-12T16:20"},{"intendedAudience":"Any body interested in the workings of Java tooling. ","endTimeZulu":"2019-09-11T16:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"09f85a81-8d78-4dae-9d31-2f128ac211e9","video":"362325091","abstract":"Java agents and their instrumentation API offer developers the most powerful toolset to interact with a Java application. Using this API, it becomes possible to alter the code of running applications, for example to add monitoring or to inject security checks as it is done by many enterprise products for the Java ecosystem.\n\nIn this session, developers will however learn how to program agents using Byte Buddy, a high level code generation library that does not require any knowledge of Java byte code. Doing so, developers will see how Java classes can be used as templates for implementing highly performant code changes that avoid the boilerplate of alternative solutions such as AspectJ or Javassist while still performing better than agents implemented in low-level libraries such as ASM.","title":"The definite guide to Java agents","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T15:00:00Z","speakers":[{"twitter":"rafaelcodes","pictureUrl":"https://www.gravatar.com/avatar/caabb7f32b7b09c6f6471b9469fa2eb7?d=mm","name":"Rafael Winterhalter ","bio":"Rafael works as a software consultant in Oslo, Norway. He is a proponent of static typing and a JVM enthusiast with particular interest in code instrumentation, concurrency and functional programming. Rafael blogs about software development, regularly presents at conferences and was pronounced a JavaOne Rock Star. When coding outside of his work place, he contributes to a wide range of open source projects and often works on Byte Buddy, a library for simple runtime code generation for the Java virtual machine. For his work, Rafael received a Duke's Choice award and was elected a Java Champion."}],"startTime":"2019-09-11T17:00","endTime":"2019-09-11T18:00"},{"intendedAudience":"Architects, business analysts, and developers.","endTimeZulu":"2019-09-11T08:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"04a1412b-a2f5-408b-9c80-e6e728ecdb35","video":"362762518","abstract":"Service-orientation is still a surprisingly hard and complex endeavour, even after all these years. Our industry seems to go through cycles of re-discovery of knowledge with every new generation of developers, probably due to the exponential growth of new practitioners and the immaturity of this fairly young profession. The risk of doing service design wrong, potensially ending up with a distributed monolith with its devastating coupling, fragility, and cognitive nightmare, is still very real to many. Being conscious of fallacies like those of distributed computing and anti-patterns like functional decomposition and entity services are all well and good, and necessary heuristics to good service design, but we often crave more concrete guidance. \n\nThe concept of business capabilities from enterprise architecture can be one approach to take a closer look at. It has proven to be very useful for a number of things, like business strategies, organisational structure, data management, and technical design. They can even help us identify subdomains, contexts, and those elusive (micro)services. Business capabilitiesare may just be the tool we need to design services in a business aligned sociotechnical system","title":"From Capabilities to Services: Modelling for business-IT alignment","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T07:00:00Z","speakers":[{"twitter":"trondhjort","pictureUrl":"https://www.gravatar.com/avatar/4727e5a62ebf46c8a680d1255d6af56d?d=mm","name":"Trond Hjorteland","bio":"Trond is an IT architect from the consulting firm Scienta and has many years experience with large, complex, and business critical systems, primarily as a developer and architect on middleware and backend systems. His main interest the last decade has been service-orientation, domain-driven design, event driven architectures, and sociotechnical systems, working in industries like telecom, media, TV, and public sector. Mantra: You have to become the business in order to design solutions that truly fit their needs.\n"}],"startTime":"2019-09-11T09:00","endTime":"2019-09-11T10:00"},{"intendedAudience":"Software developers, SREs and architects interested on cloud migration, devops, kubernetes, fafka, distributed systems and lessons learned about these topics.\n","endTimeZulu":"2019-09-11T07:20:00Z","format":"lightning-talk","length":"20","language":"en","sessionId":"96fedcd7-e747-4ef3-9bf8-ac7943eb1038","video":"362778774","abstract":"This talk presents how we migrated a 10-year-old Java monolith to a distributed cloud setup running on top of kubernetes and kafka. This is NOT about how to split a monolith to microservices, instead I will present the compromises we’ve made to migrate a legacy system but still benefit from a cloud environment - scalability and availability. Main focus are the details about the k8s ecosystem created (kops, helm, aws), our contributions to the community, challenges we faced and lessons learned about cloud deployment, managing stateful workloads and monitoring. \n\nWe went from a monolithic setup onprem with an up to 1 second delay venue-client to a distributed cloud setup with 200 ms delay.\n\nThis talk is from a developer to other fellow developers and architects interested in cloud migration, devops, kubernetes, kafka and distributed systems.\n\nSportradar is the market leading supplier of sports and betting-related data services. Most of our products are driven by real time data that is collected from venues all over the globe, processed and distributed to clients with the lowest latency possible. ","title":"Distributing the monolith - challenges, compromises and learnings","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T07:00:00Z","speakers":[{"twitter":"CostaRag","pictureUrl":"https://www.gravatar.com/avatar/dda3c5c1a2fc23a4fae4a6ab8ba771d1?d=mm","name":"Ricardo Costa","bio":"Ricardo is a passionate developer, who has been designing, coding and maintaining systems on the last 10 years. Currently leading the cloud migration of the real time data pipeline for Sportradar, excited to be engaged with cloud and devops. He is always eager to learn and discuss different topics (and partitions), enjoys running and climbing trees on his free time."}],"startTime":"2019-09-11T09:00","endTime":"2019-09-11T09:20"},{"intendedAudience":"Utviklere og ledere som er interessert i hvordan man sikrer kontinuerlig læring i en kunnskapsbedrift. Og hvordan man bygger kultur blant utviklerene. ","endTimeZulu":"2019-09-11T10:40:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"a9d0cbc7-090e-4644-8e60-fcfadfaf0cda","video":"365286995","abstract":"Hvordan sikrer vi kontinuerlig læring i en kunnskapsbedrift? SpareBank 1 har i snart ett år brukt en arbeidsdag i uken på fag. Denne dagen forlater vi det trygge teamet vårt, og samler oss i nye selvorganiserende grupperinger. Vi bruker dagene på kursing, vi koder nye løsninger, vi lager foredrag og vi gjør forbedringer på fellesløsninger.\nJeg vil fortelle om hvordan vi fikk ledelsen med på ideen om en fagdag pr. uke. Jeg vil også fortelle om hvordan vi gjennomfører denne dagen, samt hvilke resultater vi har oppnådd.","title":"“Torsdag er den nye lørdagen!” - Hvorfor bruker vi en arbeidsdag i uka på fag? ","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T10:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/3da10194cbd8af58117e7c8447238d92?d=mm","name":"Stian Conradsen","bio":"Dagene går med til å kode bank hos SpareBank 1 Utvikling. I tillegg til koding får jeg energi av å prøve å lage den gode arbeidsplassen for oss utviklere."}],"startTime":"2019-09-11T12:20","endTime":"2019-09-11T12:40"},{"intendedAudience":"-","endTimeZulu":"2019-09-12T10:40:00Z","format":"presentation","length":"60","language":"en","sessionId":"a1f11e32-1930-417b-adc6-3275c87461c4","video":"360786175","abstract":"The Wall Street Journal already mentioned it in 2011: “Software is eating the world.” Nowadays, every company is an IT company. Product owners and other business representatives seeing their competitors release new features to end users every day are demanding the same from their own software teams. How do you measure up to this heavy pressure as an IT organization? How do you quickly make changes to software systems in fast-paced environments without losing your grip on quality? How do you build and test software in such a way that it's always in a releasable state? This session explains the principles of continuous delivery and DevOps. You’ll leave with enough insights into how and where to get started yourself.","title":"Better software, faster: principles of Continuous Delivery and DevOps","room":"Room 6","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T09:40:00Z","speakers":[{"twitter":"@bjschrijver","pictureUrl":"https://www.gravatar.com/avatar/6801a459c49c5a63cf96a2f8fcfa6565?d=mm","name":"Bert Jan Schrijver","bio":"Bert Jan is CTO at OpenValue in the Netherlands and focuses on Java, Continuous Delivery and DevOps. Bert Jan is a Java Champion, JavaOne Rock Star speaker, Duke's Choice Award winner and leads NLJUG, the Dutch Java User Group. He loves to share his experience by speaking at conferences, writing for the Dutch Java magazine and helping out Devoxx4Kids with teaching kids how to code. Bert Jan is easily reachable on Twitter at @bjschrijver."}],"startTime":"2019-09-12T11:40","endTime":"2019-09-12T12:40"},{"intendedAudience":"Utviklere som ønsker å lære hvordan de raskt kan komme igang med å utvikle serverless applikasjoner i AWS.\n","endTimeZulu":"2019-09-10T11:00:00Z","registerLoc":"https://moosehead.javazone.no/#/register/bygge_applikasjoner_med_serverless_framework_og_aws_lambda","format":"workshop","length":"240","language":"no","sessionId":"fddef767-890e-4938-9d1d-32fc1a520f10","abstract":"I denne workshopen blir du kjent med hvordan man kan bygge serverless applikasjoner med Serverless Framework (serverless.com). Serverless Framework lar deg raskt definere og konfigurere applikasjonen din og ressursene den trenger, og så deploye til den skyplattformen du velger. I denne workshopen bruker vi AWS Lambda. Selve applikasjonen kan skrives i en rekke forskjellige programmeringsspråk, som JavaScript, Python eller ditt favorittspråk på JVMen. I workshopen kommer vi til å dekke hvordan du kan lage et REST API for å kalle funksjonen din, samt hvordan man kan kalle den basert på andre hendelser slik som opplasting til S3, endringer i DynamoDB, eller data i Kinesis eventstrømmer. Workshopen blir en kombinasjon av foredrag og hands-on oppgaver. Vi kommer også til å dele av våre erfaringer og tips & triks for bruk av Serverless Framework og AWS Lambda.","title":"Bygge applikasjoner med Serverless Framework og AWS Lambda","room":"Room D","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-10T07:00:00Z","speakers":[{"twitter":"@fredriv","pictureUrl":"https://www.gravatar.com/avatar/331a08fdd683b233718319295e405ffb?d=mm","name":"Fredrik Vraalsen","bio":"Fredrik er tech lead og arkitekt på dataplattform-teamet i Origo, Oslo kommune sin satsning på mer helhetlig digitalisering og utvikling av innbyggertjenester. I Origo jobber han med å etablere en dataplattform som del av kommunens nye tjenesteplattform. Målet er å gi brukerne enkle og trygge løsninger for å dele, gjenbruke, behandle og analysere data på tvers av kommunens virksomheter. Fredrik har tidligere jobbet som data engineer i Schibsted, med fokus på prosessering av sanntidsdata i Kafka Streams. Han har holdt workshops og kurs i Kafka Streams, Scala, Java 8 og funksjonell programmering, og liker å snakke på konferanser.\n"}],"startTime":"2019-09-10T09:00","endTime":"2019-09-10T13:00"},{"intendedAudience":"Lyntalen passer for alle som jobber i tverrfaglige team som utvikler digitale tjenester. Bli inspirert og bli påminnet viktigheten av å være bevisst på teamets antagelser i hverdagen. \n","endTimeZulu":"2019-09-12T07:40:00Z","format":"lightning-talk","length":"10","language":"no","sessionId":"e71bf7ac-7b57-4709-bcac-50c2022e5e89","video":"362766163","abstract":"Smidige prosesser og kontinuerlig utvikling gjør at vi jobber raskt og får greier ut i produksjon fort. Føler du også at det noen ganger blir litt for mye fokus på å skyndte seg og lage nye funksjoner? \n\nVi gjør mange antagelser i utviklingsprosessen, og det kan være skummelt rett og slett fordi antagelsen vi har kan være feil. Fokuserer vi godt nok på at det vi utvikler faktisk er nyttig for folk? Både når vi lager nye tjenester og når vi forbedrer eksisterende løsninger. \nHvordan kan det å skrive hypoteser hjelpe teamet i hverdagen? Hvordan kan vi bli bedre på å reflektere rundt hvorfor vi lager det vi lager? ","title":"Hypotesedrevet utvikling – Lage nye greier bare for å lage nye greier? Eller? ","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T07:30:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/6bab9dd9cd4e613ebfdd34a4e1a25e6f?d=mm","name":"Linn Harbo Dahle","bio":"Linn er opptatt av at vi som jobber i bransjen skal lage nyttige og verdifulle digitale tjenester for folk. Hun jobber som interaksjonsdesigner i Bekk. "}],"startTime":"2019-09-12T09:30","endTime":"2019-09-12T09:40"},{"intendedAudience":"Tips and advice about going beyond you limits and borders.\nPeople will have an insights about how another generation can help developers and entrepreneurs. ","endTimeZulu":"2019-09-12T12:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"2c38dfee-d394-4862-8d85-750e9beb65ed","video":"360825626","abstract":"Hello, my name is Ivette, I am Dennie's mom. Hello, my name is Dennie. I have autism. I am a developer and an entrepreneur. I like to do what I am doing. As mom sometimes I think Dennie does too much. Sometimes Dennie goes beyond his own limits.\n\nBut I like so much the life that I live. Together Dennie and his mum are strong and united. They have found a way for communicating about limits and borders. They found a way to live so happy and good as possible. We are sure the tips and advice can help others. The insights from another generation and open communication is a good solution. Cause many people go beyond their limit.","title":"How do I help my son?","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T11:00:00Z","speakers":[{"twitter":"@DennieDeclercq","pictureUrl":"https://www.gravatar.com/avatar/b0b7a4cd64480e0bc12cac0175c6facf?d=mm","name":"Dennie Declercq","bio":"Microsoft MVP, President & Developer DDSoft\nDennie is Microsoft MVP Developer Technologies and has experience in accessibility in with Microsoft technologies. In daily life Dennie is president and developer at DDSoft, a nonprofit in function of People With Disabilities. Dennie invented technical solutions and systems to help people with disabilities to participate in their daily life. Thanks to his autism he's the right man at the right spot to contribute as a volunteer in function of people with disabilities.\n"},{"twitter":"@IvetteMarchand","pictureUrl":"https://www.gravatar.com/avatar/d7b2f81f3b17e029e25f7bc2fca5679b?d=mm","name":"Ivette Marchand","bio":"I am mom of a son with autism. I found a way to handle people with autism on a very personal experience way. Sometimes in  the past I made decisions that where again my son's school. If I look where my son stands now, I am sure I made te right choises and decisions."}],"startTime":"2019-09-12T13:00","endTime":"2019-09-12T14:00"},{"intendedAudience":"All types of developers. They'll be able to go through a live coding session that will show a lot of features from Quarkus for Cloud-Native developers.","endTimeZulu":"2019-09-11T08:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"e514bdb3-d4ec-45ba-bc19-89f4dba8a35c","video":"362771870","abstract":"Does your heart beat faster when you’re developing your Java application? Do you Spark Joy when you’re coding it? If not, then it’s time to leave some old ways behind.\n\nJoin us on this live coding session and become Ahead of Time with Quarkus. You’ll learn to love how your old and new favorite APIs will start in a matter of milliseconds, and consume tiny amounts of memory. With hot reload capabilities for development that will give you instant Sparks of Joy! Life is too short to wait for your big, fat, slow, and memory hog app to re(start).","title":"Coding That Sparks Joy with Quarkus","room":"Room 7","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T07:00:00Z","speakers":[{"twitter":"@yanaga","pictureUrl":"https://www.gravatar.com/avatar/f884371266d9feff201677530ab66e49?d=mm","name":"Edson Yanaga","bio":"Edson Yanaga, Red Hat's Director of Developer Experience, is a Java Champion and a Microsoft MVP. He is also a published author and a frequent speaker at international conferences, discussing Java, Microservices, Cloud Computing, DevOps, and Software Craftsmanship. "},{"twitter":"@MarcusBiel","pictureUrl":"https://www.gravatar.com/avatar/674acc4f0b0a750b8fbc43c795883ecf?d=mm","name":"Marcus Biel","bio":"Marcus has become well-known in the Java community, with a total of 70 000 followers across various social media platforms. In 2017, the editorial team at jaxenter.com rated him #13 in their list of the world’s top Java influencers.\n\nAside from this, Marcus is an individual member of the Java Community Process (JCP), as well as a member of the association of the German Java User Groups e.V. (iJUG) and the local Java and software craftsmanship communities in his hometown, Munich."}],"startTime":"2019-09-11T09:00","endTime":"2019-09-11T10:00"},{"intendedAudience":"Users who are interested in using and maintaining Jenkins in their workflow should attend this session. Participants will learn on how to configure Jenkins from lines of code and use version control system to track changes and easily fallback if problems occurs.","endTimeZulu":"2019-09-10T13:30:00Z","registerLoc":"https://moosehead.javazone.no/#/register/configure_jenkins_as_code","format":"workshop","length":"120","language":"en","sessionId":"187863ab-5f92-4876-af86-cfae4408fe23","abstract":"Tired of clicking buttons to configure Jenkins? Fred not, Jenkins Configuration as Code project will make our work a bit easier. In this session, we will learn how to configure Jenkins by code and making Jenkins maintenance easier.","title":"Getting Started with Jenkins Configuration as Code","room":"Room B","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-10T11:30:00Z","speakers":[{"twitter":"sheeeng","pictureUrl":"https://www.gravatar.com/avatar/95c3ef3a0c905140efc75ea3075f5f4e?d=mm","name":"Leonard Sheng Sheng Lee","bio":"Leonard is a Continuous Delivery Coach in the Norwegian office of Praqma. He coaches various companies on build automation and plumbing Jenkins pipelines.\n\nBorn in Malaysia, had his Bachelor Degree in Computer Science, and worked a couple of different corners of the software engineering area. Claims that he enjoys Norway for its picturesque nature and unpredictable weather, and tries to prove it (and fail) by kayaking in the Norwegian fjords."}],"startTime":"2019-09-10T13:30","endTime":"2019-09-10T15:30"},{"intendedAudience":"Alle. Noe kunnskap om Kubernetes er nais, men ikke nødvendig.","endTimeZulu":"2019-09-12T13:05:00Z","format":"presentation","length":"45","language":"no","sessionId":"a7244a81-9afc-41c0-83ed-6687c6282b59","video":"360816415","abstract":"NAV går gjennom store endringer for å være en moderne IT-organisasjon. Vi skal ut i offentlig sky - og kanskje ut av Norge. Vår egenutviklede applikasjonsplattform basert på Kubernetes er en essensiell del av å jobbe mer effektivt og smidig, men også i veien ut til sky. Denne talken vil gå igjennom essensielle deler av NAVs plattform, NAIS, og hvordan denne spiller en sentral rolle i vår vei mot en moderne utviklingshverdag og ut av egne datasentre.","title":"NAIS applikasjonsplattform!","room":"Room 4","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T12:20:00Z","speakers":[{"twitter":"linemoseng","pictureUrl":"https://www.gravatar.com/avatar/f78ef853d048b6876b346ae141fedfd5?d=mm","name":"Line Moseng","bio":"Line Moseng er utvikler i NAV IT hvor hun jobber med NAV sin Kubernetes-baserte plattform, NAIS. Hun er aktiv i Lær Kidsa Koding og brenner for mangfold i IT-bransjen og at teknologi og programmering skal være allmennkunnskap."}],"startTime":"2019-09-12T14:20","endTime":"2019-09-12T15:05"},{"intendedAudience":"Architects and developers that use Lucene, SOLR, Elasticsearch, Kafka, and similar software.","endTimeZulu":"2019-09-11T14:20:00Z","format":"lightning-talk","length":"20","language":"en","sessionId":"3f7cd8a7-a9ea-4874-a7dd-53166ada9f08","video":"364735734","abstract":"Do you store personal data in Elasticsearch or similar append-only data stores? If so, you might be in breach of the GDPR! Come learn about how you might not know what data you have, and when you have it.","title":"It's 10 PM. Do you know where your segments are?","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T14:00:00Z","speakers":[{"twitter":"@Eivind88","pictureUrl":"https://www.gravatar.com/avatar/4afc7739c2055dc7b9a3bf6d094655db?d=mm","name":"Eivind Arvesen","bio":"Eivind is a software developer and architect, who works as a consultant for Bouvet.\nHe holds a master’s degree with a specialization in machine learning, and has experience ranging from his own startup during his studies to large organizations both public and private.\nHis fields of interests are varied, and include privacy, security, machine learning, human-computer Interaction and web development.\nDuring the last year, he has written several times in Norwegian media about a proposed mass surveillance bill.\nEivind writes about privacy issues, contributes to open source software and records music in his spare time."}],"startTime":"2019-09-11T16:00","endTime":"2019-09-11T16:20"},{"intendedAudience":"Everyone that works in a team with little or no gender diversity, and anyone that wants to improve inclusion in tech.","endTimeZulu":"2019-09-12T10:40:00Z","format":"presentation","length":"60","language":"en","sessionId":"34e0e842-d2e8-4461-b395-7f7036768802","video":"360794909","abstract":"Being the only woman on your team can be hard. Many times it’s difficult to know what is only your experience and what is common. In this talk we’ll go through 24 tips (and a few bonus tips) based on well over a decade of experience being the only woman in several teams. If you’re a woman hopefully you’ll walk out with some ideas you can put to work right away, if you’re a man hopefully you’ll walk out with a new perspective and start noticing things in your day-to-day that you didn’t notice before.","title":"Survival Tips For Women in Tech","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T09:40:00Z","speakers":[{"twitter":"@pati_gallardo","pictureUrl":"https://www.gravatar.com/avatar/97bf2d3107437784e5b59d640926eea0?d=mm","name":"Patricia Aas","bio":"Patricia is a programmer who has worked mostly in C++ and Java. She has spent her career continuously delivering from the same code-base to a large user base. She has worked on two browsers (Opera and Vivaldi), worked as a Java consultant and on embedded telepresence endpoints for Cisco. She is focused on the maintainability and flexibility of software architecture, and how to extend it to provide cutting edge user experiences. Her focus on the end user has led her work more and more toward privacy and security, and she has recently started her own company, TurtleSec, hoping to contribute positively to the infosec and C++ communities. She is also involved in the Include C++ organization hoping to improve diversity and inclusion in the C++ community."}],"startTime":"2019-09-12T11:40","endTime":"2019-09-12T12:40"},{"intendedAudience":"- Developers who are interested in our best practices when using gRPC and protobuf in Java projects.\n- Architects who are interested in how we efficiently handle multiple small modules after a large library split.\n- People who are generally interested in how we at Sportradar do things. (Or even what Sportradar does)\n","endTimeZulu":"2019-09-11T09:05:00Z","format":"presentation","length":"45","language":"en","sessionId":"66b2b481-0679-4f25-88ef-f8d605aafe10","video":"362503560","abstract":"Sportradar is the market leading supplier of sports and betting-related data services. Most of our betting related products are driven by data that is calculated using sophisticated mathematical models. In the past those models were distributed to the different product teams as one big JAR library (or even as source code). Over time, as we added more sports and model variations, this approach became more and more difficult to handle and slowed us down. After investigation we decided to split the library into individual services, that are based on gRPC/protobuf and deployed to a Kubernetes cluster.\n\nIn this talk you will hear how we moved from the old library based approach to a gRPC based service setup. We share our learnings and best practices of using gRPC and protobuf with multiple teams in a mostly Java-based environment. We will cover how to define and share service definitions, how to ensure consistency among the new services created, and how to handle testing of the these technologies.","title":"Journey from JAR to gRPC","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T08:20:00Z","speakers":[{"twitter":"fr4be","pictureUrl":"https://www.gravatar.com/avatar/66c11f0db42590176bf35f9660870dbd?d=mm","name":"Felix Rabe","bio":"Felix has been working in several teams at Sportradar as Java developer over the last 5 years. He is involved in the architectural advancements within Sportradar and currently the lead developer for the Odds Calculation Service. Generally he describes himself as lazy and is therefore passionate about everything, that can be automated like tests, CI/CD pipelines, and monitoring."}],"startTime":"2019-09-11T10:20","endTime":"2019-09-11T11:05"},{"intendedAudience":"Alle som ønsker å vite mer om det nye Folkeregisteret eller som er interessert i å få et innblikk i arkitekturen til en av de nasjonale felleskomponentene. ","endTimeZulu":"2019-09-11T16:00:00Z","format":"presentation","length":"60","language":"no","sessionId":"d23778d5-6311-477a-9e76-ed4493413102","video":"365038963","abstract":"I 2020 får Norge nytt folkeregisteret som vil bli tilgjengelig for alle virksomheter som ønsker å koble seg til. Arbeidet med det nye folkeregisteret har pågått i lengre tid. I 2016 ble prosjektet Modernisering av Folkeregisteret etablert og utvikling kom i gang for fullt. Prosjektet leverer nye tjenester for mottak av informasjon, automatisert og raskere saksbehandling samt kontinuerlig oppdatert utlevering av informasjon. Denne presentasjonen gir et innsyn i arkitekturen til det nye folkeregisteret. Vi tar for oss hvordan vi har digitalisert og modernisert løsninger for mottak av informasjon fra samfunnet, hvordan vi har automatisert saksbehandlingen og håndterer opplysninger hendelsesbasert og hvordan løsningene for publisering og tilgjengeliggjøring er skrudd sammen. Vi vil også beskrive hvordan den nye løsningen sameksisterer med den gamle løsningen og hvilke utfordringer dette har gitt oss.","title":"På innsiden av nytt folkeregister","room":"Room 7","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T15:00:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/4c6436f597ff9ed06291a8bc22a40265?d=mm","name":"Tobias Lund-Melcher","bio":"Tobias har 15 års erfaring som utvikler/arkitekt. Han har jobbet med mikrotjenesteorienterte arkitekturer i mer enn 10 år og er for tiden ansatt som arkitekt i Skatteetaten der han jobber som teknisk arkitekt i prosjektet Modernisering av folkeregisteret."},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/355f76caf7e5ecd7ec73311b2c68f125?d=mm","name":"Rune Myrdal","bio":"Rune er Manager i Knowit Objectnet med mer enn 20 års erfaring som utvikler/arkitekt. For tiden jobber han som utvikler og teamarkitekt på “register”-teamet i prosjektet Modernisering av Folkeregisteret."}],"startTime":"2019-09-11T17:00","endTime":"2019-09-11T18:00"},{"intendedAudience":"This session is relevant for all those who are curious about Deep Learning, Machine Learning and Artificial Neural Networks. It is a direct sequel to my JavaZone 2018 talk \"A Practical(ish) Introduction to Data Science\".","endTimeZulu":"2019-09-11T13:20:00Z","format":"presentation","length":"60","language":"en","sessionId":"5d566daa-fc78-467f-ab76-38c36ae119de","video":"365056390","abstract":"Attend this session for a mathematics and jargon free introduction to Deep Learning and Artificial Neural Networks!\n\nThe talk is split into three sections as follows:\n\n1. I’ll start by outlining the general principles and theory behind Deep Learning. \n\n2. Next up I’ll explain the inner workings of Convolutional Neural Networks (CNNs) and show how these can be utilised for Image Processing, \n\n3. Finally I’ll give insight into how Recurrent Neural Networks (RNN) can be used for Natural Language Processing.\n\nI’ll also share links and instructions for playing around with implementations of the above Artificial Neural Networks using Keras, TensorFlow and Google Colab.","title":"Deconstructing Deep Learning","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T12:20:00Z","speakers":[{"twitter":"markawest","pictureUrl":"https://www.gravatar.com/avatar/cbcf832a50ecca9518acdcdcc0678043?d=mm","name":"Mark West","bio":"Mark West is a Brexit Refugee living in Oslo Norway. Previously a Java developer and architect, he is currently leading a team of Data Scientists at Bouvet.\n\nIn his spare time Mark is Leader for the Norwegian Java User Group, aka javaBin. He is also one of the volunteers behind JavaZone."}],"startTime":"2019-09-11T14:20","endTime":"2019-09-11T15:20"},{"intendedAudience":"Java developers who want to use more of Kubernetes.","endTimeZulu":"2019-09-12T13:05:00Z","format":"presentation","length":"45","language":"en","sessionId":"429c5c50-cc63-44b7-b2d9-6830839ff6f2","video":"360823960","abstract":"Kubernetes is much more than a runtime platform for Docker containers. Its API can be extended with application-specific custom resource definitions (CRDs), and you can implement your own controllers adapting your applications dynamically to changes in the cluster.\n\nApplication-specific custom controllers are called \"operators\". Until recently, most operators were written in Go, re-using code from the built-in Kubernetes controllers. With Quarkus and the fabric8 Kubernetes Client we now have a great basis for implementing operators in Java, allowing us to integrate our existing code base with the power of Kubernetes API extensions.\n\nAt Instana, we used these new technologies to implement our instana-agent-operator. In this presentation, we will provide an experience report and lessons learned from implementing our own operator in Java. The operator is available on https://github.com/instana/instana-agent-operator.","title":"Writing a Kubernetes Operator in Java","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T12:20:00Z","speakers":[{"twitter":"@fstabr","pictureUrl":"https://www.gravatar.com/avatar/74b2e22437544a71bf5255429ed0e70f?d=mm","name":"Fabian Stäber","bio":"Dr. Fabian Stäber is Java developer and monitoring enthusiast at Instana. As part of the infrastructure team, he started the operator project by porting previous work from Go to Java, and helped evolving it into a prodction-ready open source project.\n\nFabian is excited about Java backend development, distributed systems, operations, and monitoring. His academic research was on decentralized, peer-to-peer-based network architectures.\n"}],"startTime":"2019-09-12T14:20","endTime":"2019-09-12T15:05"},{"intendedAudience":"software architects, developers building microservices, distributed systems enthusiasts","endTimeZulu":"2019-09-12T10:40:00Z","format":"presentation","length":"60","language":"en","sessionId":"55eb5ada-1701-4d23-853e-cb468598fe4e","video":"360819684","abstract":"It has become at truism in the past decade that building systems at scale, using non-relational databases, requires giving up on the transactional guarantees afforded by the relational databases of yore, ACID transactional semantics are fine, but we all know you can’t have them all in a distributed system. Or can we?\n\nIn this talk, I will argue that by designing our systems around a distributed log like Kafka, we can in fact achieve ACID semantics at scale. We can ensure that distributed write operations can be applied atomically, consistently, in isolation between services, and of course with durability. What seems to be a counterintuitive conclusion ends up being straightforwardly achievable using existing technologies, as an elusive set of properties becomes relatively easy to achieve with the right architectural paradigm underlying the application.\n","title":"ACID Semantics with Kafka (No, Seriously)","room":"Room 4","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T09:40:00Z","speakers":[{"twitter":"tlberglund","pictureUrl":"https://www.gravatar.com/avatar/a234c21cb2781c557bcef84676d3821f?d=mm","name":"Tim Berglund","bio":"Tim is a teacher, author, and technology leader with Confluent, where he serves as the Senior Director of Developer Experience. He can frequently be found at speaking at conferences in the United States and all over the world. He is the co-presenter of various O’Reilly training videos on topics ranging from Git to Distributed Systems, and is the author of Gradle Beyond the Basics. He tweets as @tlberglund, blogs very occasionally at http://timberglund.com, is the co-host of the http://devrelrad.io podcast, and lives in Littleton, CO, USA with the wife of his youth and their youngest child, the other two having mostly grown up.\n"}],"startTime":"2019-09-12T11:40","endTime":"2019-09-12T12:40"},{"intendedAudience":"Anyone who is involved with or interested in software design.\n\nParticipants will hopefully be convinced that \"the naming problem\" is deeper than it might appear to be.\n\n","endTimeZulu":"2019-09-12T10:00:00Z","format":"lightning-talk","length":"10","language":"en","sessionId":"d2b47938-6e50-4289-a649-772968fe2693","video":"363509147","abstract":"We know that names are important in programming, because they affect the readability of code, which in turn affects our ability to change it, make it better, more valuable. We also know, due to Phil Karlton's ancient joke about computer science, that naming is hard. And I suppose it's true, in a a way. Naming can be hard. But that's not the end of the story. Naming can also be very easy. It's obvious why: whether something is hard or easy to name depends crucially on the thing itself! Which leads to interesting questions such as: If a thing is hard to name, what does that tell us about the thing? Are some things inherently more nameable than others? What should we do with unnameable things? In this talk, we'll look at such questions to gain more insight into the two-way relationship between names and things.","title":"Names and Things","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T09:50:00Z","speakers":[{"twitter":"@einarwh","pictureUrl":"https://www.gravatar.com/avatar/1a0d8e9a22c78570276d7b6778717c20?d=mm","name":"Einar W. Høst","bio":"Einar W. Høst is a software developer at NRK, the Norwegian public broadcaster. He enjoys domain modelling, API design and computer programming. In his spare time he dabbles in impractical coding projects aimed at having fun with the djinns of the computer. He has a ~PhD in Computer Science from the University of Oslo and used to be a software craftsman."}],"startTime":"2019-09-12T11:50","endTime":"2019-09-12T12:00"},{"intendedAudience":"Presentasjonen er nyttig for de som vil høre om hvordan man kan få personer med lite erfaring til å levere mye på kort tid. Samarbeid, snarveier, og kreative løsninger er stikkord.","endTimeZulu":"2019-09-11T15:50:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"bc7ca33e-7142-49f8-85a3-86681f0a43c1","video":"362782057","abstract":"For UKA i 2017 jobbet vi med 10 sommerstudenter for å gi 5000 deltakere en rikere festivalopplevelse. Målet var å lage interaktive IoT-komponenter for å få folk til å møtes i den fysiske verden.\n\nVi forteller litt om forberedelsene, gjennomføring, etterarbeidet og drift, hvilke snarveier vi måtte ta og noen kreative løsninger for å levere over forventning.","title":"10 studenters harde møte med virkeligheten for å lage en festivalapp på 6 uker","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T15:30:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/3f0255ac7b6c85830e2cdca102bec189?d=mm","name":"Simon Litlehamar","bio":"Simon er teknisk arkitekt i Accentures teknologiavdeling. Han har erfaring fra flere store prosjekter både i privat og offentlig sektor der han stort sett har jobbet med mellomvare og integrasjonsarkitektur. Han er også teknologiinteressert og forsøker å holde seg oppdatert på ny teknologi så fremt døgnets timer strekker til."},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/a01ea9194d964f362c1d6411ce818e68?d=mm","name":"Andreas Aarvold","bio":"Andreas er utvikler i Accentures teknologiavdeling og jobber til daglig på et prosjekt i offentlig sektor. Han har bakgrunn fra NTNU med mastergrad i Teknisk Kybernetikk og Robotikk. Andreas har i tillegg stor interesse for maskinlæring og er aktivt med i Accentures AI-satsning."}],"startTime":"2019-09-11T17:30","endTime":"2019-09-11T17:50"},{"intendedAudience":"Anyone who wants to develop modular applications. A basic understanding of the Java Module System is assumed.","endTimeZulu":"2019-09-11T09:20:00Z","format":"presentation","length":"60","language":"en","sessionId":"9735fd08-a436-41d7-a901-ef79d10fdf7c","video":"364737117","abstract":"Java 9 introduced modules as first-class citizens that represents a higher level of aggregation above packages. They allow you to implement more robust software systems by providing stability, cohesiveness, encapsulation, and isolation.\n\nModularizing a 'Hello world' application is pretty straightforward, but it provides only limited benefits. That's because the primary strength of modularization lies in its ability to impose a clear structure on large codebases.  However, modularizing a large codebase is not a trivial task.\n\nIn this talk, we will discuss the difficulties encountered when implementing a real-life modular application and how to overcome them. We will also focus on the usage of build tools such as Gradle and Maven to compile, test, build and run modular applications. In addition, we will explore a series of plugins that automate tasks such as:\n - creating modular jars that target a Java release before 9\n - using JavaFX in Java 11+ applications\n - creating custom runtime images\n - packaging native installers using the 'jpackage' tool introduced in Java 13\n\nThe presentation will include both talking and live coding.\n","title":"The Java Module System in practice","room":"Room 7","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T08:20:00Z","speakers":[{"twitter":"@beryx007","pictureUrl":"https://www.gravatar.com/avatar/600994faefb60a802dad05adc45b26e3?d=mm","name":"Serban Iordache","bio":"Serban works at SCOOP Software GmbH in Bonn, Germany. He is a software engineer with over 15 years of experience in JVM based languages. Serban is a DZone Most Valuable Blogger and an active member of the open source community. He maintains several open source libraries and a series of Gradle plugins for the Java Module System.\n"}],"startTime":"2019-09-11T10:20","endTime":"2019-09-11T11:20"},{"intendedAudience":"Alle, men spesielt de som trenger en pep-talk, vil bli bedre på å holde kurs eller forbedre samarbeid og sosiale evner.","endTimeZulu":"2019-09-11T10:20:00Z","format":"lightning-talk","length":"10","language":"no","sessionId":"664faa9e-8f32-432a-8cd1-23b3f19e5ec1","video":"362772194","abstract":"Dette er et kræsjkurs i hvordan du får kursdeltakere til å føle seg fortrolige og trygge på null komma niks. Kurset er opprinnelig utforma for nye veiledere i kodeklubben, men kan gi deg en ekstra piff som kursholder og medmenneske.","title":"Lær kattungen din å kode","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T10:10:00Z","speakers":[{"twitter":"@NoraTSM","pictureUrl":"https://www.gravatar.com/avatar/35d40f04bbd5549f5b7973400229d335?d=mm","name":"Nora Tessem","bio":"Nora jobber til daglig som java-konsulent for Bouvet. Hun har drevet Kodeklubben Oslo fra starten av og bidratt til Lær kidsa koding i 4 år. Hun har faglig bakgrunn fra både kunsthistorie og programmering, og er ellers ei solstråle med en lei tendens til å snakke om relasjonelle databaser og kreft på fest."}],"startTime":"2019-09-11T12:10","endTime":"2019-09-11T12:20"},{"intendedAudience":"Testere, data scientists, utviklere. Trenger ingen bakgrunn innen maskinlæring, men kan være en fordel.","endTimeZulu":"2019-09-12T13:05:00Z","format":"presentation","length":"45","language":"no","sessionId":"2468ce52-2b5f-49fe-88e0-bdaf223d367b","video":"360834398","abstract":"På NAV jobber vi for å innføre smarte syntetiske testdata, dvs at testdataene ligner på produksjonsdata, men ikke inneholder personopplysninger. Det betyr at vi er på omtrent samme nivå på automatiserte testdata som Tesla er på selvkjørende biler. Hva skjer når vi tar dette videre og innfører automatisk oppdaterering over tid, og hva er konsekvensene av dette? Hvordan kan man oppnå at testdata blir et system som vedlikeholder seg selv, og som bare innimellom trenger input fra mennesker?","title":"Forbi syntetiske testdata - Selvkjørende testdata","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T12:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/da6170b98b559b8ab1ff03376b40c425?d=mm","name":"Jon Christian Halvorsen","bio":"Jon Christian er forretningsutvikler og data scientist i Visma Consulting og leder Vismas arbeid med smarte syntetiske data. Han brenner for å løse forretningsproblemer ved å bruke maskinlæring. \n"},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/59c903d3531c1a83b805cb02ac60b758?d=mm","name":"Richard Rostad","bio":"Richard har jobbet innen test og sw kvalitet i et kvart århundre.  Han har benyttet maskinlæring både til test og produksjon i forskjellige prosjekter siden 2003.  De siste årene har han jobbet med maskinlærte testdata i personvernsammenheng på NAV."}],"startTime":"2019-09-12T14:20","endTime":"2019-09-12T15:05"},{"intendedAudience":"This session is intended for Java developers but they do not need to have lots of experience.  I will talk about the pros and cons of LVTI for all developers.","endTimeZulu":"2019-09-11T08:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"d761dad3-9215-4469-b30a-55e135e6fc4c","video":"362780867","abstract":"Local variable type inference was introduced as a new Java language feature in Java SE 10. Gone are the days of explicitly having to define the type of a variable; let the compiler do it for you with the magic of var!\n\nAt first sight, this looks like a small change that will eliminate unnecessary boiler-plate code and reduce how much typing (on the keyboard) is required to maintain strong typing (of the language). However, as with many features, there are some unexpected nuances as well as both good and bad use cases.\n\nIn this session, we’ll explain the fundamentals of local variable type inference.  We’ll then take a series of examples of the use of var and discuss the technical merits of each case.","title":"Local Variable Type Inference: Friend or Foe?","room":"Room 6","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T07:00:00Z","speakers":[{"twitter":"speakjava","pictureUrl":"https://www.gravatar.com/avatar/74df280f7344dc095de3ec7bfd41457c?d=mm","name":"Simon Ritter","bio":"Simon Ritter is the Deputy CTO of Azul Systems.  Simon joined Sun Microsystems in 1996 and spent time working in both Java development and consultancy.  He has been presenting Java technologies to developers since 1999 focusing on the core Java platform as well as client and embedded applications.  \n\nNow at Azul Systems, he continues to help people understand Java and Azul’s JVM products.  He represents Azul on the JCP Executive Committee as well as the JSR Expert Groups for JDK 9, 10, 11 and 12."}],"startTime":"2019-09-11T09:00","endTime":"2019-09-11T10:00"},{"intendedAudience":"Passer for alle som er interessert i læring, arbeidskultur og systemutvikling.","endTimeZulu":"2019-09-12T07:50:00Z","format":"lightning-talk","length":"10","language":"no","sessionId":"9f58b425-1ae0-440b-9c62-5a869aff457c","video":"362765094","abstract":"I SpareBank 1 ønsket vi å dra mer nytte av potensialet knyttet til læring ved feil i produksjon. Spesielt nysgjerrige var vi på hvordan organisasjonen bedre kunne legge til rette for læring i etterkant av hendelser, på en trygg og positiv måte for alle involverte. Etter gode resultater fra en testperiode, standardiserte vi i 2017 på bruk av post mortem for alle våre utviklingsteam. I denne lyntalen deles erfaringer fra to år med post mortem. Hva er det viktig å tenke på, og hvordan fungerte det egentlig for oss?","title":"Hendelsedrevet læring i SpareBank 1 - Erfaringer fra to år med post mortem","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T07:40:00Z","speakers":[{"twitter":"@bergkristoffer","pictureUrl":"https://www.gravatar.com/avatar/f77b5662e6f9dfdcf1473e1008233410?d=mm","name":"Kristoffer Berg","bio":"Utviklingsleder i SpareBank 1 på området Digitalbankutvikling. Spesielt opptatt av smidig utvikling i tverrfaglige team, kundeverdi og kontinuerlig forbedring."}],"startTime":"2019-09-12T09:40","endTime":"2019-09-12T09:50"},{"intendedAudience":"This talk is for developers that are interested in an introduction about Kotlin extension functions and how they can start using it in their own projects. No previous Kotlin knowledge required.","endTimeZulu":"2019-09-11T08:50:00Z","format":"lightning-talk","length":"10","language":"en","sessionId":"30c74534-6393-4b23-8afb-b29a52f43013","video":"364736489","abstract":"In this talk we will start by taking a look at what Kotlin extension functions are. We will look at a specific example, MockWebServer, and go through how we can make this great Java class even more awesome using Kotlin. There will be code! Finally, we will also see how this makes the code more natural to use in Kotlin, specifically looking into unit tests where this is used.\n","title":"Kotlinify existing Java classes","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T08:40:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/294f5efafd8104a6614e2617f6864d69?d=mm","name":"Jarle Hansen","bio":"Jarle Hansen works for Systek and is currently a developer at Skatteetaten. When starting at Skatteetaten he was introduced to Kotlin and it was love at first sight. Last year he was part of the group who founded Oslo Kotlin meetup."}],"startTime":"2019-09-11T10:40","endTime":"2019-09-11T10:50"},{"intendedAudience":"Some experience with and understanding of Java and JVMs will help, but I aim to make the talk approachable and high-level up front, then dive deeper into a few things.","endTimeZulu":"2019-09-12T10:40:00Z","format":"presentation","length":"60","language":"en","sessionId":"100ab767-1e4d-4b7d-b232-25369c514c53","video":"360835777","abstract":"The OpenJDK project is evolving to start quicker, use less resources, and run smoother as well at faster. Easy, right?!\n\nIn this talk we'll look at the recent history of the OpenJDK, with a focus on the performance optimizations we've delivered, what we're doing to make it even better in the future, and how we're trying to balance\nthe different performance characteristics as we add new productivity-\nand performance-oriented features.\n\nOn top of highlighting big-ticket features like ZGC, Loom, Valhalla, this\ntalk will look at the sum of little things that make every new version\nof the OpenJDK just a little bit better than the last one. ","title":"The lean, mean... OpenJDK?","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T09:40:00Z","speakers":[{"twitter":"cl4es","pictureUrl":"https://www.gravatar.com/avatar/fe6a295b8a4ed6547229bff195cb829c?d=mm","name":"Claes Redestad","bio":"Claes has been working as an OpenJDK performance engineer at Oracle since 2012, benchmarking, developing and improving the runtime in many small ways since."}],"startTime":"2019-09-12T11:40","endTime":"2019-09-12T12:40"},{"intendedAudience":"Utviklere, arkitekter og ledere som ønsker en innføring i sikkerhetstenking og sikkerhetsarkitektur.","endTimeZulu":"2019-09-11T07:45:00Z","format":"presentation","length":"45","language":"no","sessionId":"5a125090-c2bb-4ff5-b691-9f8c297215ef","video":"362496698","abstract":"Alle trenger sikkerhet, og sikkerhet må integreres inn i organisasjon og system i alle ledd. Dette er opplagt for mange, men hva trenger vi og hvordan kommer vi i gang? Når man tenker på arkitektur for virksomheten som helhet er det vanlig å dele dette i fire lag: forretning, informasjon, applikasjon og teknologi. I dette foredraget vil jeg vise hva det betyr å tenke på og ta hensyn til sikkerhet gjennom disse fire lagene. Vi kommer innom tema som risikostyring, trusselmodellering, informasjonsklassifisering, autentisering, autorisering, brukerhåndtering, logging med mer.","title":"Sikkerhetsarkitektur i fire nivåer","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T07:00:00Z","speakers":[{"twitter":"rolfrander","pictureUrl":"https://www.gravatar.com/avatar/52a4674fd03ab151cfcdaa62e4b5487e?d=mm","name":"Rolf Rander Næss","bio":"Rolf Rander er en virksomhetsarkitekt og sikkerhetsarkitekt med lang erfaring fra mange store virksomheter. Han jobber til daglig for Acando hvor han hjelper kunder med å organisere it-arkitektur og å få tekniske mekanismer til å henge sammen med mennesker, prosesser og overordnede målsetninger."}],"startTime":"2019-09-11T09:00","endTime":"2019-09-11T09:45"},{"intendedAudience":"Developers interested in container orchestration with Kubernetes will see demos on we can run end to end automated \"Progressive Delivery\" using Canaries.\nAttendees should have an understanding of containers.","endTimeZulu":"2019-09-11T15:45:00Z","format":"presentation","length":"45","language":"en","sessionId":"d8f893f0-3e08-41ef-9ec6-fe2fa93cd4ce","video":"365255694","abstract":"Jenkins X is an open source CI/CD platform for Kubernetes based on Jenkins.\nJenkins X runs on Kubernetes and transparently uses on demand containers to run build agents and jobs, and isolate job execution. It enables CI/CD-as-code using Jenkins Pipelines and automated deployments of commits and pull requests using Skaffold, Helm and other popular tools. We will demo how to use Jenkins X on a Kubernetes cluster for fully automated CI, CD and Progressive Delivery with automated canary deployments and rollbacks.\n\nThis talk will show Jenkins X Continuous Delivery flow, pull request preview environment capabilities as well as enabling Progressive Delivery using canary deployments.\n","title":"Jenkins X: Progressive Delivery for Kubernetes","room":"Room 6","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T15:00:00Z","speakers":[{"twitter":"csanchez","pictureUrl":"https://www.gravatar.com/avatar/aae986b17e29ddd0763b44c5d124261c?d=mm","name":"Carlos Sanchez","bio":"Carlos Sanchez specializes in software automation, from build tools to Continuous Delivery. He has spoken at several conferences around the world, including ApacheCON, KubeCon, JavaOne, Fosdem,... Involved in Open Source for more than ten years, he is the author of the Jenkins Kubernetes plugin and a member of the Apache Software Foundation amongst other open source groups, contributing to several projects, such as Jenkins, Apache Maven, or Puppet. He works as a Senior Cloud Engineer at Adobe"}],"startTime":"2019-09-11T17:00","endTime":"2019-09-11T17:45"},{"intendedAudience":"Foredraget passer for tekniske og ikke-tekniske personer. Alle som ønsker å se en demonstrasjon av hvordan man kan bruke IT-verktøy til å løse tekniske oppgaver av varierende vanskelighetsgrad vil få noe igjen etter å ha sett foredraget. Foredraget handler om å fortelle hva som er mulig og deretter demonstrere dette med tekniske hjelpemidler.\n\nFor de i publikum som er utviklere vil foredraget forhåpentligvis inspirere til å utøve deres evner utover det man gjør på jobb til vanlig, og å vise de at f.eks. kodeknekking er et av områdene kan kan begi seg ut på for å få nye utfordringer. Det kreves derfor ikke at publikum trenger å forstå alt innholdet, målet er å demonstrere og inspirere til å lære mer på egen hånd, og teknisk bakgrunn er derfor nyttig men ikke nødvendig.\n\nUtover en grunnleggende forståelse for Internett og om vanlige IT-verktøy (MS Paint, Twitter, Zip-filer), trenger ikke publikum noen forhåndskunnskap.","endTimeZulu":"2019-09-11T17:20:00Z","format":"presentation","length":"45","language":"no","sessionId":"a89edd76-4104-4bbd-877e-4364a2bfb90c","video":"362495004","abstract":"Har du det som skal til for å knekke koder for PST? I vinter la PST ut en gåte i forbindelse med en rekrutteringskampanje, hvor gåtens delløsninger ledet deg fram mot en eventuell jobbsøknad hos PST. Gåten skapte mye entusiasme på sosiale medier og hos meg som førte til at jeg, og som sikkert mange andre, lærte veldig mye igjennom kodeknekkingen.\n\nI dette foredraget skal vi løse PST-gåten sammen. Jeg kommer til å forklare underveis hvilke teknikker jeg bruker, og på hvilken måte de hjelper oss i å finne det vi trenger for å komme videre til neste steg. Du vil igjennom foredraget få en demonstrasjon av bruk av tekstanalyse, bildeanalyse (steganografi), nettverksanalyse og litt JavaScript-kode.\n\nVed å se på foredraget vil du forhåpentligvis sitte igjen med en større forståelse av hvordan man jobber analytisk med et konkret problem, og på hvilken måte kreativitet, Open Source og IT-verktøy brukes til å knekke koder og avdekke sårbarheter.\n\nOg hvem vet, kanskje du får lyst til å bli en fulltids kodeknekker?\n\nPresentasjonen og løsningen: https://henrikwm.github.io/kodeknekking_for_spioner","title":"Kodeknekking for spioner","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T16:20:00Z","speakers":[{"twitter":"@henrikwm84","pictureUrl":"https://www.gravatar.com/avatar/b5d50682fbf4d62a94c48f30ad253173?d=mm","name":"Henrik Walker Moe","bio":"Henrik jobber i Bekk som en samvittighetsfull og entusiastisk utvikler og har over 12 års erfaring i bransjen. Når han finner noe han brenner for å dele med bransjen så kommer det gjerne i form av innlegg på en blogg, i sosiale medier eller fra talerstolen på konferanser.\n\nFaglig fokus de siste årene har vært på IT-sikkerhet og Open Source, hvor Henrik bruker fritiden på å bl.a. være en \"White Hat\"-hacker som tester sikkerheten til fiktive nettløsninger i Capture-The-Flag oppgaver, og ved å bidra på Open Source-prosjekter. Henrik er også faggruppeleder i \"Open Source\" i Bekk og har ansvaret for å skape engasjement rundt Open Source blant kollegaer og kunder."}],"startTime":"2019-09-11T18:20","endTime":"2019-09-11T19:20"},{"intendedAudience":"All developers, and architects alike! I'm presenting a tool which is not very used yet. A traditional Spring backend is still heavily used, but can it be replaced, and still as secure and efficient? Definitely. ","endTimeZulu":"2019-09-11T07:40:00Z","format":"lightning-talk","length":"20","language":"en","sessionId":"c348e46c-4519-464c-beea-506cae2ed4ff","video":"362762645","abstract":"Software development is always in motion. We often look back on how far we've come the past years. In this talk I want to look ahead! With FaaS and BaaS becoming more available. Platforms hosting and securing your apps. Scalability increasing and cost decreasing. This is truly a paradigm shift. Developers didn't look like this 10 years ago, and they won't look like this in 10 years! \n\nAs a frontend developer with serious love for JavaScript I stumbled upon Serverless. With Firebase and React Native, I was finally ready to start on all my app ideas! Then during a project, I found AWS. They had just started to swagger up they're serverless JavaScript library, now known as AWS Amplify! \n\nGraphQL. Authentication. Databases, Cloud functions. Business logic. Can we comfortably add this without ever touching a server language like Java? My talk is controversial and interesting for everyone. The future of developer experience is here. Let me explain how AWS Amplify is all; a node library, a CLI, and a hosting platform. ","title":"Destroying Backends - Amplify your application with AWS","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T07:20:00Z","speakers":[{"twitter":"jorgenlybeck","pictureUrl":"https://www.gravatar.com/avatar/efc3c1fb4ff04a5486f1c7bf913cc227?d=mm","name":"Jørgen Lybeck Hansen","bio":"Jørgen is the Frontend Community Lead at Capgemini Norway. He writes articles for the Capgemini Community Blog which he maintains. He also has a huge love for the developer community in Oslo, and enjoys a good meetup! React is his sword, and AWS his shield! "}],"startTime":"2019-09-11T09:20","endTime":"2019-09-11T09:40"},{"intendedAudience":"Attend my talk and learn why you should use a certain IDE and in which situation. Why are people using IntelliJ, Eclipse, Netbeans or Visual Studio Code? And why are people switching between IDEs? Maybe you also need to switch if you hear this?! I will share the most important (hidden) features from and to the community!","endTimeZulu":"2019-09-12T15:45:00Z","format":"presentation","length":"45","language":"en","sessionId":"981848f0-96be-48c1-8a41-77abf5226b5f","video":"360821586","abstract":"IntelliJ IDEA is the best IDE! Or is it Eclipse? Netbeans perhaps? Or are you working with Emacs/Vi/VSCode or something else?\nDo you recognize the discussion with your colleagues? Why you should start using another IDE! The one that they use of course! \n\nIn this session I will show you which IDE you should use (or at least try). Not only based on my opinion but also on that of other developers that filled in the research “What is my favourite IDE and why” on https://t.co/VqwdM1C9cu. \nThere are a lot of cool features you definitely need to see! \n\nPlease join my talk and find out!","title":"The battle of the IDEs","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T15:00:00Z","speakers":[{"twitter":"@KoTurk77","pictureUrl":"https://www.gravatar.com/avatar/81e5aec459392bf5a4482529a14bb49b?d=mm","name":"Ko Turk","bio":"Ko Turk is a Senior Java Developer at Blue4IT, currently he is working for one of the biggest banks of the Netherlands. He loves to go full stack, creating backend microservices and frontend web applications. Because he likes to know everything about Java, you can find him regularly at the UtrechtJUG or other conferences."}],"startTime":"2019-09-12T17:00","endTime":"2019-09-12T17:45"},{"intendedAudience":"Denne workshopen er for deg som er kjent med React, men som ønsker å lære om Hooks og hva man kan gjøre med dem.","endTimeZulu":"2019-09-10T15:45:00Z","registerLoc":"https://moosehead.javazone.no/#/register/l%C3%A6r_deg_react_hooks_p%C3%A5_2_timer","format":"workshop","length":"120","language":"no","sessionId":"83908401-0634-44c9-8bf0-c1a0c9d42c1c","abstract":"React har kommet et godt stykke siden det ble introdusert for over 6 år siden. Nye og kraftige verktøy, teknikker og APIer har kommet til, og et av de mest spennende konseptene akkurat nå er Hooks.\n\nDenne workshopen kommer til å lære deg alt du trenger å vite om Hooks for å gjøre appene dine enklere å skrive, vedlikeholde, og ikke minst - bruke.","title":"Lær deg React Hooks på 2 timer","room":"Room A","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-10T13:45:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/6eb030c72fb5a1c55dad1bf3531604f2?d=mm","name":"Markus Rauhut","bio":"Markus jobber som utvikler i Bekk og brenner for kode som kjøres i nettleseren. Til daglig jobber han som konsulent i Fremtind, et norsk skadeforsikringsselskap eid av SpareBank 1 og DNB."},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/4b1b13fd49c8ab422d8da36ded996f80?d=mm","name":"Marie Gotaas Buøen","bio":"Marie jobber som fullstack-utvikler, og jobber til daglig med løsningene til If Forsikring."},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/b0f84d080bff3667de3d86c726f56938?d=mm","name":"Jørgen Johansen","bio":"Jørgen jobber som utvikler i Bekk og liker jobbe med både backend og frontend. I hverdagen jobber han som konsulent på Utdanningsdirektoratet, som har ansvar for barnehage, grunnskole og videregående opplæring."},{"pictureUrl":"https://www.gravatar.com/avatar/5ae7a83c142e42932df498e025cba61e?d=mm","name":"Jonas Løchsen","bio":"Jonas jobber som utvikler i Bekk og sitter til daglig som konsulent hos Finanstilsynet. Han jobber fullstack og har en lidenskapelig interesse for frontend-utvikling."}],"startTime":"2019-09-10T15:45","endTime":"2019-09-10T17:45"},{"intendedAudience":"Developers who want to improve soft skills.  ","endTimeZulu":"2019-09-12T13:50:00Z","format":"lightning-talk","length":"10","language":"en","sessionId":"79de58c0-ec1c-4f2d-84bf-02a6d6759eed","video":"363516814","abstract":"You are a programmer and you build stuff that matters. I work with customer experience and we work together now and then. During the talk you will get examples of communication I appreciate most in working with you. I hope my perspective will help you to be even better at your field!","title":"3 things I love that you do","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T13:40:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/271f06de6352acd47816160e1da18bf9?d=mm","name":"Darija Sapozenkova-Hauge","bio":"Darija is an Oslo based UX expert and team lead for Java developers. Her experience spans UX for a chat bot, customer journey mapping for telecom sector and current UX lead role for digital banking. Clients call her \"the engine of the project\" and \"most brave designer I have met\". Darija publishes articles and blogs, holds presentations and loves dark chocolate. "}],"startTime":"2019-09-12T15:40","endTime":"2019-09-12T15:50"},{"intendedAudience":"Java programmers of any level","endTimeZulu":"2019-09-12T09:05:00Z","format":"presentation","length":"45","language":"en","sessionId":"ee048858-9e6e-4b57-b764-f29f0f21be4d","video":"362782047","abstract":"Once upon a time, we looked upon serialization as an important part of Java. As the years passed, we began to recognize the flaws in its design and sighed. Today we realize that the story of serialization has become a dark and twisted tale. In this session you will see why we still need serialization, how the inbuilt design is fatally flawed, and how it is exploited and used against us. Serialization can still be open to attack. \n\nDoes this tale have a happy ending?  Can goodness prevail? \n\nOnly you can decide.","title":"Java serialization: a modern fairytale","room":"Room 7","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T08:20:00Z","speakers":[{"twitter":"@spoole167","pictureUrl":"https://www.gravatar.com/avatar/4ae5e27dbd6d14c684f109fc163a8e40?d=mm","name":"Steve Poole","bio":""}],"startTime":"2019-09-12T10:20","endTime":"2019-09-12T11:05"},{"intendedAudience":"Developers and Architects","endTimeZulu":"2019-09-11T16:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"b56b57d6-1675-4491-af8a-cee388b4664f","video":"362507687","abstract":"Event-driven architectures are on the rise. They promise both better decoupling of components by using an event bus and improved scalability in terms of throughput. Decoupled modules help to scale your software development efforts itself. Event streaming promises to handle ever-growing amounts of \"data in motion\" in real-time, event sourcing allows us to time travel, and domain events have turned out to be powerful building blocks that lead to a better understanding of underlying business requirements, especially with the help of methodologies like event storming.\n\nBut there are also pitfalls that you’d better be aware of. For example event-notifications used inappropriately can lead to tighter coupling or cyclic dependencies between components. It is also easy to lose sight of flows across service boundaries, making it hard to understand how core business logic is actually implemented. This can get even worse if you lack tooling to get insights into your event bus. Last but not least, the event-driven approach is not well-understood by most developers or business analysts, making it hard for companies to adopt.\n\nIn this talk, I will quickly go over the concepts, the advantages, and the pitfalls of event-driven utopia. Whenever possible, I will share real-life stories or concrete source code examples from various customer projects.","title":"Opportunities and Pitfalls of Event-Driven Utopia","room":"Room 4","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T15:00:00Z","speakers":[{"twitter":"berndruecker","pictureUrl":"https://www.gravatar.com/avatar/f9b3f444746cb4c17814f0c9d043aaa2?d=mm","name":"Bernd Rücker","bio":"Throughout my 15+ years in software development, I have helped automating highly scalable core workflows at global companies including T-Mobile, Lufthansa and Zalando. I have contributed to various open source workflow engines. I am co-founder and technologist of Camunda, an open source software company reinventing workflow automation. I co-authored \"Real-Life BPMN,\" a popular book about workflow modeling and automation. I regularly speak at conferences and write for various magazines. I am currently focused on new workflow automation paradigms that fit into modern architectures around distributed systems, microservices, domain-driven design, event-driven architecture and reactive systems. "}],"startTime":"2019-09-11T17:00","endTime":"2019-09-11T18:00"},{"intendedAudience":"Java developers who might want to learn about reactive programming.","endTimeZulu":"2019-09-11T09:20:00Z","format":"presentation","length":"60","language":"en","sessionId":"d5f9133d-331c-4ef9-a6f7-4b293c1387d5","video":"362774675","abstract":"Microservices and big-data increasingly confront us with the limitations of traditional input/output. In traditional IO, work that is IO-bound dominates threads. This wouldn't be such a big deal if we could add more threads cheaply, but threads are expensive on the JVM, and most other platforms. Even if threads were cheap and infinitely scalable, we'd still be confronted with the faulty nature of networks. Things break, and they often do so in subtle, but non-exceptional ways. Traditional approaches to integration bury the faulty nature of networks behind overly simplifying abstractions. We need something better.\n\nSpring Framework 5 is here ! It introduces the Spring developer to a growing world of support for reactive programming across the Spring portfolio, starting with a new Netty-based web runtime, component model and module called Spring WebFlux, and then continuing to Spring Data Kay, Spring Security 5.0, Spring Boot 2.0 and Spring Cloud Finchley. Sure, it sounds like a lot, but don't worry! Join me, your guide, Spring developer advocate Josh Long, and we'll explore the wacky, wonderful world of Reactive Spring together.\n\n","title":"Reactive Spring","room":"Room 6","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T08:20:00Z","speakers":[{"twitter":"starbuxman","pictureUrl":"https://www.gravatar.com/avatar/fb22593caf24e4bb4c98d467cdd247e6?d=mm","name":"Josh Long","bio":"Josh (@starbuxman) is the Spring Developer Advocate at Pivotal. Josh is a Java Champion, author of 6 books (including O'Reilly's Cloud Native Java: Designing Resilient Systems with Spring Boot, Spring Cloud, and Cloud Foundry and the upcoming Reactive Spring) and numerous best-selling video trainings (including Building Microservices with Spring Boot Livelessons with Spring Boot co-founder Phil Webb), and an open-source contributor (Spring Boot, Spring Integration, Spring Cloud, Activiti and Vaadin). \n"}],"startTime":"2019-09-11T10:20","endTime":"2019-09-11T11:20"},{"intendedAudience":"-","endTimeZulu":"2019-09-11T17:20:00Z","format":"presentation","length":"60","language":"en","sessionId":"c1973f94-f40c-457c-8779-947fe2998a83","video":"362760797","abstract":"Open source modules are undoubtedly awesome. However, they also represent an undeniable and massive risk. You’re introducing someone else’s code into your system, often with little or no scrutiny. The wrong package can introduce severe vulnerabilities into your application, exposing your application and your user's data. This talk will use a sample application, Goof, which uses various vulnerable dependencies, which we will exploit as an attacker would. For each issue, we'll explain why it happened, show its impact, and – most importantly – see how to avoid or fix it. We'll live hack exploits like the classic struts vulnerability that recently made it famous, along with Spring Break and several others.","title":"Stranger Danger: Finding Security Vulnerabilities Before They Find You!","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T16:20:00Z","speakers":[{"twitter":"@BrianVerm","pictureUrl":"https://www.gravatar.com/avatar/77b3347563a86d38c780e97cbb68cc1b?d=mm","name":"Brian Vermeer","bio":"Developer Advocate for Snyk and Software Engineer with over 10 years of hands-on experience in creating and maintaining Software. He is passionate about Java, (Pure) Functional Programming and Cybersecurity. Brian is an Oracle Groundbreaker Ambassador and regular international speaker on mostly Java related conferences like JavaOne, Oracle Code One, Devoxx BE, Devoxx UK, Jfokus, JavaZone and many more. Besides all that Brian is a military reserve for the Royal Netherlands Air Force and a Taekwondo Master / Teacher."}],"startTime":"2019-09-11T18:20","endTime":"2019-09-11T19:20"},{"intendedAudience":"Any attendes can come to this talk: I'm starting to describe how simple games are made (animation, …) while showing how to do it with the gaming framework libGDX and Kotlin.\n\nA little knowledge of Kotlin can ease the understanding of the talk but not necessary as I'm explaining some Kotlin features.","endTimeZulu":"2019-09-11T14:25:00Z","format":"presentation","length":"45","language":"en","sessionId":"06f7fa10-3a81-4f92-a312-c0bffb3cc12c","video":"362771304","abstract":"Playing games is fun but making games is even better, especially with Kotlin and libGDX. Let’s build together a breakout game and let’s explore the gaming framework libGDX.\n\nThis session will show some libGDX’s concepts: how to draw and animate elements of our game, how collision system works to destroy our bricks, what Kotlin brings to libGDX. Then we will dive into more advanced topics like shaders, in order to handle pixels from our images. \n\nWhy are we doing all of this? To break the high score, of course!","title":"Beat the high-score: build a game using libGDX and Kotlin","room":"Room 7","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T13:40:00Z","speakers":[{"twitter":"dwursteisen","pictureUrl":"https://www.gravatar.com/avatar/c0cc95cb988fa74760d68c40124ebb6c?d=mm","name":"David Wursteisen","bio":"For David, computer science is not only about technics. That's why he is working to mix others aspects with his coding skills. To make sure that the IT will not be a center of cost but an asset."}],"startTime":"2019-09-11T15:40","endTime":"2019-09-11T16:25"},{"intendedAudience":"No experience requred. Attendees will get some insight on how dashboards should be use, as weel as a sample stack of tools.","endTimeZulu":"2019-09-11T14:30:00Z","format":"lightning-talk","length":"10","language":"en","sessionId":"4c6a2e61-067b-400f-8da0-e65287c67dd0","video":"362756438","abstract":"Modern cloud and container orchestration makes it super easy to collect tons of metrics for your infrastructure and applications. Unfortunately it is not always obvious how to reduce the information flow, and visualize it.\n\nLet's look at some good practices for creating effective dashboards for high level overviews and day to day devops activities. \n\nBased on real life experience using Grafana with Telegraf and Influxdb for managing 500+ servers whilst migrating from on prem to AWS. ","title":"Useful dashboards with Grafana","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T14:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/452d2621f58a7982ba1f94e3440747f1?d=mm","name":"Jarl Totland","bio":"arl grew up in the demoscene and ended up developer, techlead, architect, dev manager and wannabe evangelist. He is enthusiastic about technology, coding, devops, cloud and automation of all kinds. \nAside from running Ambita technologywise, he likes to spend time at meetups, particularly the Bergen AWS one."}],"startTime":"2019-09-11T16:20","endTime":"2019-09-11T16:30"},{"intendedAudience":"Utviklere og arkitekter som ønsker seg en introduksjon til hva micro-frontends er, og hvorfor de skal bry seg om det.","endTimeZulu":"2019-09-12T11:20:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"d86d4e07-043a-4a9a-a6af-e520b6650095","video":"363512264","abstract":"Gjennom årene har vi gått fra å bryte ned store og komplekse monolitter til klient/server og microservices. Nå for tiden lever store deler av en applikasjon på klientsiden. Jo mer vi legger til ny funksjonalitet, destod vanskeligere blir det å vedlikeholde klientapplikasjonen. Dette medfører blant annet at vi ofte lager flere feil enn vi fikser.\n\nI denne lyntalen skal Shahariar gi en introduksjon på hva micro frontends er, og hvorfor det kanskje er løsningen du trenger for din frontend applikasjon. ","title":"Hva i all verden er micro frontends?","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T11:00:00Z","speakers":[{"twitter":"Chario0z","pictureUrl":"https://www.gravatar.com/avatar/378e0145e06c7ed988f9c21d19a2233c?d=mm","name":"Shahariar Kabir Bhuiyan","bio":"Shahariar er full-stack utvikler i Accenture sin teknologiavdeling. Han har erfaring fra flere prosjekter der han har hatt roller som utvikler og team leder. I det siste har Shahariar fått interesse for cloud, serverless, front-end, og arkitektur. "}],"startTime":"2019-09-12T13:00","endTime":"2019-09-12T13:20"},{"intendedAudience":"Foredraget er rettet mot utviklere, men vil nok være aller mest relevant for utviklere som er nysgjerrige på React Native & kryssplattform mobilteknologi, f. eks \n\n- utviklere som har jobbet med native mobilteknologi, som derfor er nysgjerrig på kryssplattform\n- utviklere med erfaring med React for web, som er nysgjerrig på mobilutvikling\n\n","endTimeZulu":"2019-09-11T15:45:00Z","format":"presentation","length":"45","language":"no","sessionId":"089c6da1-c279-48ba-a8c8-610b271fe166","video":"362761083","abstract":"Vy-appen er blant landets mest brukte apper. De siste årene har teknologien under panseret sakte men sikkert blitt fornyet, da all ny funksjonalitet har blitt skrevet med kryssplattformteknologien React Native. \n\nMen hvordan foretar man egentlig et slikt gradvis teknologibytte, samtidig som man skal levere ny funksjonalitet og bevare en helhetlig opplevelse til svært mange brukere? \n\nEr det noe særlig å skrive mobilapper med JavaScript, egentlig?\nHvilke andre fordeler finnes?\n\nI dette foredraget får du høre våre erfaringer med dette arbeidet.\n","title":"Teknologibytte i fart: erfaringer med React Native hos Vy","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T15:00:00Z","speakers":[{"twitter":"ewndl","pictureUrl":"https://www.gravatar.com/avatar/dd85298e60a5edd1276671d0eb2f5433?d=mm","name":"Erik Wendel","bio":"Tech lead for Vy-appen. Utvikler og fagsjef i Bekk."},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/7ecc8f9ee6552cbc4497df396562fe61?d=mm","name":"Jon Olimstad","bio":"Produkteier for Vy-appen."}],"startTime":"2019-09-11T17:00","endTime":"2019-09-11T17:45"},{"intendedAudience":"Developers who have already used Git, so hopefully everyone.","endTimeZulu":"2019-09-11T12:30:00Z","format":"lightning-talk","length":"10","language":"en","sessionId":"e61e88c6-630d-432a-963a-01ab59f7dcff","video":"362780889","abstract":"Software often lasts longer than expected. Software is also changing more often than expected. At some point, there comes a moment where a developer looks at the code and asks: “How is this piece of code supposed to work?” A look into the git history is also not very helpful with messages like \"fixed some bugs\". This session will show some tips on how to create a comprehensible git history and what the benefits are.","title":"The One Tip to Pimp Your Git History","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T12:20:00Z","speakers":[{"twitter":"@Ro_Wei","pictureUrl":"https://www.gravatar.com/avatar/1b54e5b25e654161179a86e8cc6e1022?d=mm","name":"Roland Weisleder","bio":"Roland Weisleder is a software engineer and architect working at data experts in Berlin. His focus is on creating and maintaining long-living enterprise applications in the Java ecosystem. As head of the company's technology board, he also advises the individual project teams on current technologies, techniques and trends."}],"startTime":"2019-09-11T14:20","endTime":"2019-09-11T14:30"},{"intendedAudience":"Anyone interested in the messy application of Agile development in a real world situation.  Some experience with Agile framework knowledge, test driven development, and behaviour driven development.","endTimeZulu":"2019-09-12T09:20:00Z","format":"presentation","length":"60","language":"en","sessionId":"f7faf5a8-04f5-4273-aab8-084a7ee9ab25","video":"362769470","abstract":"How do you know you're solving the right problem in the right way for your clients?  Come join us to learn about how Inspera infused the user perspective into each step of our development process.  We took a simple conversation with the employee at the coal face (consultants, support, implementation engineers...) and translated this into requirements and tests that validate the need has been resolved.\n\nJourney with us through the process as we:\n- Understand the customer needs and resulting behaviour changes\n- Assess relevance & prioritization \n- Scope the technical work and the tests\n- Develop the solution\n- Validate the solution from a technical and product perspective\n- Release & monitor the solution\n- Assess the solution\n\nWhile this may sound straightforward, the devil is always in the details of how you can get your company processes aligned to support this.  The steps may be easy to list, but changing the mindset for each of the teams involved and the actions they execute on a regular basis is something else.  If you understand the theory and want to see the gory practice, come on down!","title":"So tell us what you want, what you really really want: Building what your customers actually need","room":"Room 6","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T08:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/641209cf023c7d13e64c1b94960c8641?d=mm","name":"Chirag Rao","bio":"Chirag Rao is a test manager at Inspera. He has varied areas of expertise in the quality assurance domain. Has previously worked at Tata Consultancy Services (TCS) and PricewaterhouseCoopers (PwC).\n"},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/9899a5be7dbb7d01319a73490b5a650b?d=mm","name":"Lisa Long","bio":"Lisa Long is a product manager.  She is one of the co-organizers for Product Tank Oslo.  She previously worked at Telenor and Skype."}],"startTime":"2019-09-12T10:20","endTime":"2019-09-12T11:20"},{"intendedAudience":"Developers that make a PaaS\nCurious about PaaS, but unsure on how to keep things up to date\n","endTimeZulu":"2019-09-12T08:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"a24d4452-9dda-4b61-9433-ba31ca0a96ae","video":"362760342","abstract":"Last year we talked about problems we had with building and rolling out images at scale in our Kubernetes-based clusters. This year we have fixed it! Come and see how Sprocket can help you build and update images fast using a push based event-model.\n\nSprocket can also help you partition changes based on an event so that you do not overwhelm your clusters with new builds/deployments.\n\n\n","title":"Continuous deployment of docker images on Kubernetes that scale","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T07:00:00Z","speakers":[{"twitter":"bjartek","pictureUrl":"https://www.gravatar.com/avatar/84f169f5b95f86c1929affb51f5e1007?d=mm","name":"Bjarte S. Karlsen","bio":"Bjarte Karlsen is an architect and developer responsible for the development/usage side of the Container Application platform that The Norwegian Tax Administration has deployed to run modernized applications. His tasks include creating tooling and code examples to support the kubernetes platform."},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/d33331a67e4840164931a50a93ba5889?d=mm","name":"Kristoffer Moberg Christensen","bio":"Kristoffer Christensen is a trainee in The Norwegian Tax Administration with a master's in ICT, specialization in Machine Learning, from University of Agder. For a few months this year Kristoffer became part of Bjarte`s team. During his internship Kristoffer gained insight and good understanding of how Container Application plattforms work and took part in the initial design and development of Sprocket."}],"startTime":"2019-09-12T09:00","endTime":"2019-09-12T10:00"},{"intendedAudience":"People who make and/or read pull requests in a corporate environment.","endTimeZulu":"2019-09-11T13:10:00Z","format":"lightning-talk","length":"20","language":"en","sessionId":"1ae39818-ca81-469a-a9a4-921da94877e3","video":"362767638","abstract":"Why do many people find reading and creating pull requests tedious? And what can we do to break that vicious cycle. In this talk, we will take a look at tips and tricks for making pull requests better to review and to create. We will look at practicalities and mindset alike. We will focus mostly on using Bitbucket and Jira, but it will be applicable to other providers as well. We will mostly focus on a corporate environment where you may, or may not, have some outsourced resources as well.","title":"Pull requests - the good, the bad and the ugly","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T12:50:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/299dd4aefa514aa20cad6c63ae89a9e6?d=mm","name":"Marie Katrine Ekeberg","bio":"Software developer at Evry with a passion for programming and mathematics. Love to read, play with technology and learn new things. Also an GNU/Emacs evangelist, but realise that some languages are best left to IDEA/IntelliJ (like Kotlin)."}],"startTime":"2019-09-11T14:50","endTime":"2019-09-11T15:10"},{"intendedAudience":"You should attend this lighting talk if you are interested in learning about creating AR applications, or have some experience with AR and want to learn about WebXR. \nSome basic knowledge about Javascript is recommended. ","endTimeZulu":"2019-09-11T11:20:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"2ac1de44-002a-45b8-8cf1-db613f73b68c","video":"362742628","abstract":"Learn how to create your own stunning augmented reality solutions without the native application. It can all be done in the browser - so much more convenient!\n\nWhat you will learn:\n- What WebXR is\n- Why/when you should use WebXR \n- Its limitations\n- How to create AR applications using WebXR with the browser","title":"Augmented reality - without the app","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T11:00:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/0215c3a7cdc690a38811a1d834be49c1?d=mm","name":"Anders Rønning Dahlen ","bio":"Anders R. Dahlen is a JVM (Koltin and Java) developer with experience in DevOps. He has a pation for clean code and improving his skills as a developer. He is just now becoming proficient with augmented reality"}],"startTime":"2019-09-11T13:00","endTime":"2019-09-11T13:20"},{"intendedAudience":"Interessert i stream prosessering, Kafka, sensordata, tidsserier.","endTimeZulu":"2019-09-12T09:05:00Z","format":"presentation","length":"45","language":"no","sessionId":"dbb3bda8-6e9a-44d8-b684-9457ab975329","abstract":"Vi beskriver Statnetts digitaliseringsreise der man har tatt i bruk en streaming-plattform basert på Apache Kafka for å håndtere data fra titusenvis av sensorer og mange interne og eksterne IT-systemer.\nSanntidsprosessering er nødvendig for å løse stadig mer krevende forretningsbehov, men streamprosessering fordrer ofte en annen forståelse av både behovene og hvordan disse skal løses rent teknisk.\nNår vi har jobbet oss igjennom problemstillingene så vi at løsningene ofte følger mange av de samme mønstrene. Vi deler våre erfaringer med håndtering av stream data og presenterer de byggeklossene som vi utviklet for å dekke disse mønstrene. Problemstillingene handler om preprosessering av rådata, håndtering av forskjellige typer tidsserier, samt hvordan varierende kvalitet i datastrømmene kan håndteres.\n","title":"Uten Kafka stopper strømmen","room":"Room 4","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T08:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/970ddf4153f79a3f720d9025083b4ff1?d=mm","name":"Øystein  Jakobsen","bio":"Arkitekt og utvikler hos Bouvet siden 2009. For tiden jobber han mest med Kafka strømmeapplikasjoner i Kotlin, og på kveldstid pusler han ofte med hjemmeautomasjon og IoT."},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/c6494cdf63f622e3a30d7cac5fb3c2d2?d=mm","name":"Jonas Lindholm","bio":"Systemarkitekt i Statnett. Jobber med balansering i kraftsystemet med bruk av bl.a. Kafka."}],"startTime":"2019-09-12T10:20","endTime":"2019-09-12T11:05"},{"intendedAudience":"This session is for Java developers who are interested (or even just curious) in understanding how their code runs on a JVM. Also, this session will talk about some tools and features developers can use to improve the performance of their code.\n\nThe session will begin with very basic concepts, so if someone is learning about JVMs for the very first time they will not get lost. As the session progresses, JVM components will be discuss in greater detail. The ideal audience member is someone who has decent low level knowledge (OS, threading, etc.).\n\nThis talk will use the OpenJ9 JDK as the example\n\n","endTimeZulu":"2019-09-11T12:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"4310c4e9-1188-4850-9410-50b4178c4332","video":"365257401","abstract":"Interested in learning how a JVM actually works? Want to understand the design of the Eclipse OpenJ9 JVM, formerly IBM’s J9 JVM? IBM open sourced their enterprise production hardened JVM at the Eclipse Foundation as the OpenJ9 JVM. Come to this session to learn the design principles behind the OpenJ9 runtime and the key advantages of this JVM, particularly for Cloud deployments. Follow your application code as it’s loaded, linked, and excuted on OpenJ9.","title":"How do JVMs work? An Openj9 case study","room":"Room 4","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T11:00:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/f739ad439fdaeec3bee0ef16b9459447?d=mm","name":"Tobi Ajila","bio":"Tobi is a Java Runtime developer for the OpenJ9 VM team in Ottawa, Canada. In the past he has worked on Interpreter optimizations, JVMTI enhancments, JSR 335 and more. Currently, his main focus is on Project Valhalla where he collaborates with other developers in the Panama expert group.\n\nTobi has an interest in optimizing the Java Runtime for cloud environments. He previously worked on a JVM multi-tenant incubator project and has investigated enhancements for Java application deployments on IBM cloud.\n\nIn his spare time Tobi enjoys playing soccer and is an avid supporter of Arsenal F.C. Apart from sports Tobi also enjoy listening to music and catching the odd live show.\n"}],"startTime":"2019-09-11T13:00","endTime":"2019-09-11T14:00"},{"intendedAudience":"Målgruppen er deltakere på JavaZone i alle aldre, med interesse for samspillet mellom politikk, samfunn og teknologi.","endTimeZulu":"2019-09-11T10:25:00Z","format":"presentation","length":"45","language":"no","sessionId":"e0146770-f0cb-4536-9bf3-73dcd924abeb","video":"362497844","abstract":"Foredraget tar utgangspunkt i livet til Tobias, 8 år og gir et innblikk i hvordan politiet kan anvende teknologi i arbeidet med å beskytte barn fra kriminalitet, og hvilke utfordringer som må løses på veien.","title":"Hvordan kan teknologi hjelpe politiet med å forebygge kriminalitet?","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T09:40:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/08a0ae581b54536656e95733efac5aeb?d=mm","name":"Tore Aasgaard","bio":"Sjefsarkitekt i Politiets IKT-tjenester"}],"startTime":"2019-09-11T11:40","endTime":"2019-09-11T12:25"},{"intendedAudience":"People knowing about basic GC mechanisms and want to go further to understand the latest GC algorithm, and how they differ from each other.","endTimeZulu":"2019-09-12T13:20:00Z","format":"presentation","length":"60","language":"en","sessionId":"ccdc251d-e986-4248-ab68-f57bc16b0bd1","video":"360784313","abstract":"Since several years, the world of JVM GC evolved. A new kind of GC emerges: low latency GCs. Shenandoah is provided by Red Hat, Oracle open sourced ZGC in OpenJDK since JDK 11 and Azul C4 is sill there.​\n\nAs \"classical\" GCs are well understood, this talk will focus on internals of the most recent ones. We will explain Concurrent Marking (tri-color marking), the C4's Load Value Barrier, Shenandoah's Brooks Pointers and ZGC's multi-mapping. Finally, how to choose a low latency GC?","title":"Understanding Low Latency JVM GCs","room":"Room 6","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T12:20:00Z","speakers":[{"twitter":"@jpbempel","pictureUrl":"https://www.gravatar.com/avatar/be2ac6490c9775a1f132adb61f9cac05?d=mm","name":"Jean-Philippe Bempel","bio":"Developer passionate by performance, runtimes (JVM, CLR) and Mechanical Sympathy supporter, Jean-Philippe has more than 8 years experience in low latency trading systems. Now, He brings his expertise on the JVM at Criteo in order to optimize resources on thousand node clusters."}],"startTime":"2019-09-12T14:20","endTime":"2019-09-12T15:20"},{"intendedAudience":"Developers interested in or already working with Azure","endTimeZulu":"2019-09-11T07:50:00Z","format":"lightning-talk","length":"10","language":"no","sessionId":"fce65a4e-7be0-41c2-afce-767eab191f02","video":"362761783","abstract":"Command-line all the things using Azure CLI.\n\nIn this lightning talk I'll argue for why Azure CLI might be the first tool you should be reaching for when trying to solve hard things (in Azure).\n\nExamples will be based on real world experience from developing microservices in .NET core running on Azure and Kubernetes for Thon Hotels. \n\nPractical examples will include:\n\n* How to use Azure CLI “on my machine”\n* Build and deploy in Azure Pipelines\n* ConfigMaps and secrets in Kubernetes\n* How Azure CLI can be incorporated into build scripts, illustrated with FAKE and Bash        \n\nNo prior knowledge of .net, C# or F# will be necessary. Some experience working in the command line on either Windows or Linux might come in handy. \n\naz logout\n\nSlides can be found at https://drive.google.com/file/d/1Ma0_NV0VKPNLOcml7U8oJYCdm8-QptFa/view","title":"Azure CLI and me","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T07:40:00Z","speakers":[{"twitter":"pr0nin","pictureUrl":"https://www.gravatar.com/avatar/2df86958edde676da0a0d77e72e9df18?d=mm","name":"Johan Grønstad","bio":"Johan is a senior consultant at Novanet. He's currently working for Thon Hotels on both infrastructure and applications using his trusty Chromebook. His main passions include breaking bottlenecks and delegating all his responsibilities to scripts.\n\nWhen he's not command lining all the things he enjoys silent mornings when no one else is awake."}],"startTime":"2019-09-11T09:40","endTime":"2019-09-11T09:50"},{"intendedAudience":"Developer with little security and privacy (encryption) experience.","endTimeZulu":"2019-09-11T14:25:00Z","format":"presentation","length":"45","language":"en","sessionId":"15cea85e-03ca-4929-a6b3-fdb91558c24f","video":"364735294","abstract":"Do I want to track my cycles? Yes\nDo I want the tracker to push my data to a third party? Hell NO\nDo I want the data lying around unencrypted in a database somewhere? Not really\nDo I want backup and access from multiple devices? Kinda\n\nWhat would I need to learn and is it even possible?\nCome along on my journey, as a run of the mill web developer, to create a secure and private web-based period tracker.","title":"A privacy first period tracker? Is it even possible?","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T13:40:00Z","speakers":[{"twitter":"raae","pictureUrl":"https://www.gravatar.com/avatar/6c77970c37c8192a816dfaaf681c6f8e?d=mm","name":"Benedicte Raae","bio":"Benedicte Raae is an independent contractor, working as a full stack developer. With a developer mom, she had free access to the Internet from an early age, but it was actually her Norwegian teacher that introduced her to HTML in 1997. Since then, she has created countless apps, services, and sites. Both for fun and profit."}],"startTime":"2019-09-11T15:40","endTime":"2019-09-11T16:25"},{"intendedAudience":"The session is for people that deal with microservices and the typical challenges around them: how to implement data exchange patterns, what to do if other services are temporarily not available etc. Attendees will learn how CDC can help them to address these and other problems.\n\nAttendees will benefit most if they have had some exposure to microservice architectures and the associated challenges.","endTimeZulu":"2019-09-12T12:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"5d0b28fb-de0f-459a-9ffe-9b1c7f1423b1","video":"360817719","abstract":"Apache Kafka is a highly popular option for asynchronous event propagation between microservices. Things get challenging though when adding a service’s database to the picture: How can you avoid inconsistencies between Kafka and the database? \n\nEnter change data capture (CDC) and Debezium. By capturing changes from the log files of the database, Debezium gives you both reliable and consistent inter-service messaging via Kafka as well as instant read-your-own-write semantics for services themselves. Join this session to learn how to leverage CDC for reliable microservices integration and solving typical challenges such as gradually extracting microservices from existing monoliths, building an audit log, and updating caches as well as full-text search indexes.\n\nIn a live demo we'll show how to use Debezium to set up a change data stream out of your service's database, without any code changes needed. You'll see how to consume change events in other services, how to gain real-time insight into your changing data using Kafka Streams and much more.\n","title":"Change Data Streaming For Microservices With Apache Kafka and Debezium","room":"Room 4","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T11:00:00Z","speakers":[{"twitter":"gunnarmorling","pictureUrl":"https://www.gravatar.com/avatar/972d6190453ebb116df316609c5fc7f4?d=mm","name":"Gunnar Morling","bio":"Gunnar Morling is a software engineer and open-source enthusiast by heart. He’s leading the Debezium project, a platform for change data capture. Gunnar is the spec lead for Bean Validation 2.0 (JSR 380), a long-time committer to different Hibernate projects and a Java Champion. In his spare time, he contributes to the Deptective and MapStruct projects. Prior to joining Red Hat, he worked on a wide range of Java EE projects in the logistics and retail industries. He’s based in Hamburg, Germany. "}],"startTime":"2019-09-12T13:00","endTime":"2019-09-12T14:00"},{"intendedAudience":"Foredraget er for alle som vil lære hvordan man kan anvende maskinlæring for å analysere egne og fremtidige boliger. Det er forventet basiskunnskap innenfor maskinlæring for å få fullt utbytte, men en kort introduksjon til sentrale begreper vil bli gitt. Vi vil f.eks. presentere noen arkitekturer for nevrale nett i presentasjonen, og det er en fordel om du kjenner til begreper som CNN, RNN og hva slags egenskaper disse byggeklossene har. Det blir også noe kode i presentasjonen (Python/PyTorch). Du også få tilgang til vår tjeneste smart bolig analyse.","endTimeZulu":"2019-09-12T15:45:00Z","format":"presentation","length":"45","language":"no","sessionId":"5c374dad-6df3-4de0-8ebf-04b76191f82e","video":"360832182","abstract":"Hvis du er på utkikke etter en ny bolig og liker å ta besluttninger basert på data, så er dette presentasjonen for deg. Her vil vi vise deg hvordan vi i Vendu bruker en data-drevet tilnærming til å vurdere boliger med maskinlæring. Etter presentasjonen vil du være i stand til å evaluere din neste bolig, og redusere risiko for ukjente feil og mangler. \n\nVi vil vise deg maskinlærings teknikker innen prosessering av naturlige språk (NLP) og regresjon. Vi bruker disse for å analysere tilstandsrapporter og prise boliger. \n","title":"Hvordan kan du bruke maskinlæring til å finne din neste bolig!","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T15:00:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/0bf2e766e5ec43fc2b0b2aa044eca722?d=mm","name":"Aleksander Bai","bio":"Aleksander Bai har 10 års erfaring som IT-konsulent innenfor systemutvikling og arkitektur. De siste 4 årene har han jobbet som forsker innenfor maskinlæring og tilgjengelighet, før han ble med i Vendu som head of data science. Han har publisert flere vitenskapelig og populærvitenskapelig artikler og foredrag innen maskinlæring, og har jobbet med sentiment analyse og NLP de siste 7 årene."},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/74b379c8eceaf87cb384885d337f04b3?d=mm","name":"Tom Bang","bio":"I over 20 år har Tom Bang hjulpet store organisasjoner med IT-utvikling, endringsprosesser og forretningsutvikling. Gjennom disse 20 årene har han selv etablert og bygget flere bedrifter (Bekk Consulting, Calia Tannklinikk, Iterate Consulting) og er i dag COO for Vendu. Tom sitt hovedfokus har vært å bistå etablerte organisasjoner med endringsledelse og innovasjonsutfordringer hvor prosjektledelse av disse prosessene, implementeringene eller produktlanserinene har vært hovedopgavene. Han er en dedikert, ressurssterk og\nengasjerende leder, prosjektleder og forretningsutvikler, med spesialkompetanse innen Lean produktutviklingsmetodologi."}],"startTime":"2019-09-12T17:00","endTime":"2019-09-12T17:45"},{"intendedAudience":"Managers, Developers, Administration, Employees in general.","endTimeZulu":"2019-09-12T13:10:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"57ece242-2f98-4c3e-8e6a-9a77af6eae84","video":"363516219","abstract":"\"Du åpner døren på jobb. Bak deg står en mann du ikke har sett før, han har selskapets nøkkelkortbånd og er pent kledt. Du låser opp før dere går inn sammen og han nikker høflig før han forsvinner rundt hjørnet.\" \n\nEn talk som fokuserer på bevisstgjøring på den enkelte ansattes ansvar og risiko for selskapets sikkerhet som helhet.\n\nDu er kanskje \"bare en utvikler\", men hva har du egentlig tilgang til. Hva kan man gjøre fra din PC?","title":"Hvordan bli kompromittert på 4 sekunder.","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T12:50:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/5bf45f2fbc23d00a654606f2d5e69451?d=mm","name":"Stian Svedenborg","bio":"Stian er utdannet kryptolog og har jobbet som fullstackutvikler i 5 år. Nå jobber han I Kantega på tvers av organisasjon og kunder for å heve sikkerheten på alle plan."}],"startTime":"2019-09-12T14:50","endTime":"2019-09-12T15:10"},{"intendedAudience":"This talk is suitable for everyone who is interested in electronics, computer vision and self driving cars.","endTimeZulu":"2019-09-11T17:20:00Z","format":"presentation","length":"60","language":"en","sessionId":"3ee01fdf-66f1-452c-875d-b51cff6108bd","video":"362502148","abstract":"This session will share our experiences in converting a small remote controlled car into an autonomous driving vehicle. We'll talk about electronics, sensors, AI, computer vision and of course, the software that ties everything together. We'll introduce you into the world of self driving cars and compare our solution to the stuff that is done in the big leagues by the likes of Tesla's 'autopilot' and Waymo's self driving cars. We'll explain the challenges that have to be faced and the dilemma's that come with creating a car being driven by software in real world scenarios.","title":"Building a self-driving RC car","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T16:20:00Z","speakers":[{"twitter":"@bjschrijver","pictureUrl":"https://www.gravatar.com/avatar/6801a459c49c5a63cf96a2f8fcfa6565?d=mm","name":"Bert Jan Schrijver","bio":"Bert Jan is CTO at OpenValue in the Netherlands and focuses on Java, Continuous Delivery and DevOps. Bert Jan is a Java Champion, JavaOne Rock Star speaker, Duke's Choice Award winner and leads NLJUG, the Dutch Java User Group. He loves to share his experience by speaking at conferences, writing for the Dutch Java magazine and helping out Devoxx4Kids with teaching kids how to code. Bert Jan is easily reachable on Twitter at @bjschrijver."},{"twitter":"@TimvEijndhoven","pictureUrl":"https://www.gravatar.com/avatar/eafb85c6a77aa23f78586d0f7bb64483?d=mm","name":"Tim van Eijndhoven","bio":"Tim van Eijndhoven is a Software Craftsman at JPoint. Interested in anything software development related his main interests are on Java, software architecture, security and open source. Tim likes sharing his knowledge and experience with his fellow developers by writing articles and speaking at conferences. He tries to inspire future generations of developers by teaching kids how to code at events like Devoxx4Kids."}],"startTime":"2019-09-11T18:20","endTime":"2019-09-11T19:20"},{"intendedAudience":"Anyone can attend this session. \nThe participants will get a new view on how to approach planning, at work and at home. Hopefully they will also be inspired to take a walk outside the comfort zone and try something new.","endTimeZulu":"2019-09-12T07:30:00Z","format":"lightning-talk","length":"10","language":"no","sessionId":"16a4438c-8680-465a-97d2-77c88b3b7aaf","video":"362748022","abstract":"Gjelder smidige prinsipper kun på jobb eller kan vi bruke disse prinsippene også på privaten? Som Agile coach er jeg over middels glad i smidig og under middels glad i å planlegge i detalj lang tid før en hendelse inntreffer. Da vi reiste jorden rundt på 10 måneder med våre to barn, hadde vi samme innstilling til planlegging av reisen som for produktutvikling. Var det en god ide å ha en smidig tilnærming til planlegging når man skulle reise til ukjente land med to små barn? Kom på denne lyntalen for å høre mine erfaringer med planlegging, på jobb og på reise.","title":"Jorden rundt uten en plan","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T07:20:00Z","speakers":[{"twitter":"@christinakseime","pictureUrl":"https://www.gravatar.com/avatar/6a6de28562f971e0bdec416588b4d1d5?d=mm","name":"Christina Kjær Seime","bio":"Christina works as a Lean/Agile Coach at Miles - a Norwegian consultancy company. She is an active speaker at conferences in Norway and enjoys giving workshops on different Agile topics. She is devoted to get teams and organisations to collaborate and work efficiently, creating the best products possible, using principles from Agile and Lean. Since she graduated in 2004 she has been working in numerous development projects in telecommunications, energy, media and the public sector. The first years as a developer and later on as team lead, project manager and now coach. She is passionate and interested in all things related to creating great products, convinced that this relies as much on inter-human aspects and communication as it does on technology. She is curious by nature and last year she was on a one year sabbatical with her husband and two girls. A great opportunity to experience new places, cultures, people and to learn!"}],"startTime":"2019-09-12T09:20","endTime":"2019-09-12T09:30"},{"intendedAudience":"IT managers\nArchitects\nDevelopers\nOperators","endTimeZulu":"2019-09-11T12:00:00Z","format":"presentation","length":"60","language":"no","sessionId":"3aad1ce0-d90c-42dd-b779-5a8ec6ec6cf3","video":"365055873","abstract":"In 2016 I was hired to do some enhancements to the current application runtime and delivery at the Directorate of Fisheries (Fiskeridirektoratet). I didn't know that that would be the beginning of a 3 year long jouny to Dockerzie and move all of their applications to Kubernetes! In this talk I will describe the journy we went and our learnings from running Kubernetes in production on our own hardware for 2 years and counting!","title":"How we moved all of Fiskeridirektoratet's Java applications to Kubernetes","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T11:00:00Z","speakers":[{"twitter":"Starefossen","pictureUrl":"https://www.gravatar.com/avatar/9e1c3c074bb77ceb4ceffdb968bb8710?d=mm","name":"Hans Kristian Flaatten","bio":"Hans Kristian is DevOps Practice Lead at EVRY where he work with some of EVRY's largest customers within financial, insurance, and public sector to deliver higher quality software, faster, using agile methodologies and DevOps practices. He specialises in test- and deployment-automation, large scale container systems using Kubernetes, and distributed software architecture."},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/2665bd7c49b074eef71ee0de3738220b?d=mm","name":"Håvar Eggereide","bio":"Hans Kristian is DevOps Engineer at EVRY where he work primarily with public sector building and operating container-based Kubernetes platforms. He is a Certified Kubernetes Administrator and knows the Cloud Native Landscape by heart."}],"startTime":"2019-09-11T13:00","endTime":"2019-09-11T14:00"},{"intendedAudience":"For alle, både nye og erfarne, men spesielt de med interesse for frontend og JavaScript-språket. Målet er alle skal lære noe de ikke visste fra før.","endTimeZulu":"2019-09-11T12:00:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"7f8c9b9a-e638-488e-83ec-4eb380b7bb44","video":"362770540","abstract":"Visste du at [] == ![], eller at det finnes over 500 ulike måter å refreshe vinduet på i JavaScript? Språket er vanskelig å mestre fullstendig, men er likevel verdens mest brukte programmeringsspråk(!) i 2019, og er selve grunnpilaren til rammeverk som React, Vue og Angular. Denne lyntalen er for deg som ønsker å lære noen nye ting, og noen svært rare ting, om utviklerens aller beste venn. Nemlig JavaScript.","title":"Rare ting som får deg til å like JavaScript","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T11:40:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/e45c0e8ba0dccd8cc9d804a792a137c4?d=mm","name":"Nicolai August Hagen","bio":"Nicolai har de siste årene vært spesielt opptatt av alle de finurlige delene som JavaScript-språket består av. Han har holdt kurs og lyntaler om temaet, og ønsker nå å dele morsom og nyttig lærdom om JavaScript-språket."}],"startTime":"2019-09-11T13:40","endTime":"2019-09-11T14:00"},{"intendedAudience":"Developers and data analysts","endTimeZulu":"2019-09-11T14:00:00Z","format":"lightning-talk","length":"20","language":"en","sessionId":"e7efc061-594e-4b84-9178-b807a8948f41","video":"362753256","abstract":"SQL Window Functions are a little-known feature of Standard SQL, but very powerful.\n\nA SQL Windows Function do calculations across a set of rows (window), these rows are somehow related to the current row.\n\nCompared to classical aggregate functions in SQL, aggregate as Window Functions do not cause rows to be grouped into one output row in the result but return all the rows in the result.\n\nThe SQL Window Functions can be of statistical/analytical, ranking or aggregate type.\n\nThrough this talk I will give developers and data analysts a little glimpse into this world. I will start with a little introduction, and then a few examples.","title":"SQL Window Functions to your rescue","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T13:40:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/7b71b6a3d65eadd84c6c9892a4e2a07a?d=mm","name":"Frode Borlaug","bio":"I am a Java developer at Ambita in Bergen. I haven been working as a developer since 1995. I have had computers and programming as a hobby since early 1980s."}],"startTime":"2019-09-11T15:40","endTime":"2019-09-11T16:00"},{"intendedAudience":"Arkitekter, utviklere, og de som er generelt nysgjerrige på hva Elhub er.","endTimeZulu":"2019-09-12T08:00:00Z","format":"presentation","length":"60","language":"no","sessionId":"5f661618-db8b-41e0-be75-24fa93d3c931","video":"362495591","abstract":"Elhub er ett av de største IT prosjektene som har blitt levert i offentlig sektor de siste årene, men det er få som vet hva Elhub egentlig er. Her vil du få en kort introduksjon til hvilken rolle Elhub har i det norske strømmarkedet, og et innblikk i teknologien og den orverordnede arkitekturen til kjernekomponentene av løsningen. Deretter ser vi på 2 av de problemstillingene som skapte mest hodebry. Hvem kunne for eksempel tro at det å behandle meldinger i sekvens skulle by på så store problemer? Hva er det man bør tenke på når man velger strategi for felles feilhåndtering i prosessmotoren? Og, hvordan blir disse problemene påvirket av transaksjonshåndtering?","title":"Elhub - Digitaliseringen av det norske strømmarkedet","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T07:00:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/cf7b0e89192c7eb5e4dbb0f5685efa70?d=mm","name":"Kristian Haugen","bio":"Kristian har 4 års erfaring med systemutvikling i Accenture, og er den som har vært med lengst som utvikler/arkitekt på Elhub. På Elhub har han vært med på å designe og løse noen av de største og mest komplekse problemene, og har blitt en go to guy når det kommer til tekniske utfordringer på prosjektet. "}],"startTime":"2019-09-12T09:00","endTime":"2019-09-12T10:00"},{"intendedAudience":"This talk is helpful for Project Reactor users, both beginners and advanced.\nThe attendees will learn how they can improve the debug-ability of their systems, know how to test and find very dangerous but hidden issues, and gain confidence with reactive programming in general.","endTimeZulu":"2019-09-11T13:20:00Z","format":"presentation","length":"60","language":"en","sessionId":"987b01d5-dce4-4bb2-bbdc-630493aef615","video":"365259743","abstract":"Project Reactor is a very powerful tool in the developers' hands. But, the more powerful tools you use, the stronger safety rules are. Do you know all of them? \n\nIn this talk, we will learn about advanced Project Reactor debugging & testing techniques, which are helpful for anyone who works with Project Reactor.\n\nBecause like the cockroaches can survive even the radiation, bugs can escape the most well-thought-out code. \n\nNever heard about BlockHound?\nOr you know about Backpressure, but not sure if it is handled correctly in your​ code?\nMaybe you want to prepare you reactive code upfront to help your future self when something goes wrong in prod?\nOr perhaps just watch how Reactor team members work with Reactor code and learn some neat tricks?\nThen this talk is for you!","title":"Don’t be Homer Simpson with your Reactor!","room":"Room 4","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T12:20:00Z","speakers":[{"twitter":"@bsideup","pictureUrl":"https://www.gravatar.com/avatar/3329a8ef50ae3388665964637001fcb6?d=mm","name":"Sergei Egorov","bio":"Sergei works at Pivotal on Project Reactor in Berlin, Germany. He is an active member of the Open Source community, member of the Apache Foundation, co-maintainer of the Testcontainers project, and a contributor to various OSS projects (Apache Groovy, Testcontainers, JBoss Modules, Spring Boot, to name a few), likes to share the knowledge and was presenting at different conferences and meetups in Russia, Germany, Poland, Ukraine, Norway, Denmark, Spain, Belarus, and Estonia. He is passionate about dev tools, DevOps topics, clouds, and infrastructure. Started his journey with Docker in 2014. Before Pivotal, he was working at Vivy, N26, Zalando, ZeroTurnaround, TransferWise, and other startups."}],"startTime":"2019-09-11T14:20","endTime":"2019-09-11T15:20"},{"intendedAudience":"Frontent-, backend- og fullstack-utviklere, testere og folk som tar avgjørelser mtp. prioritering av sikkerhetsarbeid.","endTimeZulu":"2019-09-12T12:40:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"bc147afe-cfe6-41b2-968a-17f3fe5727be","video":"363514581","abstract":"Alle har lyst på sikre applikasjoner, men likevel velger de fleste vekk den kraftigste sikkerhetsrelaterte headeren i arsenalet, nemlig Content Security Policy.\n\nDet er kanskje forståelig? Når man ser CSPene større sider sender, kan oppsett se ut som en umulig oppgave. Denne talken vil hjelpe deg med å forstå potensialet i CSP. Jeg kommer til å vise de viktigste bestanddelene og komme med tips til hvordan du kan endre applikasjonen din for å utnytte det maksimalt.","title":"Content Security Policy for deg med dårlig samvittighet","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T12:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/3992d5fd4a605b0a981d3a58509b3cda?d=mm","name":"Martin Valen","bio":"Martin er fullstackutvikler i Kantega med 4 års erfaring og har hatt sin del av den dårlige samvittigheten i løpet av årene. En dag bestemte han seg for å få tettet CSP-kunnskapshullet sitt og har spredt det glade budskapet siden den gangen."}],"startTime":"2019-09-12T14:20","endTime":"2019-09-12T14:40"},{"intendedAudience":"Målgruppen er arkitekter og utviklere som driver med event-prosessering og som ønsker å gjøre livet lettere å leve når kafka går ned eller subsystemer oppfører seg dårlig.  ","endTimeZulu":"2019-09-12T14:25:00Z","format":"presentation","length":"45","language":"no","sessionId":"b960dd77-a5b0-458e-901a-5d9fa3dbd527","video":"360814664","abstract":"Det er mye som kan gå galt i et distribuert og event-basert system. Underliggende tjenester feiler eller blir uresponsive. Kafka-clusteret må ned for å oppgraderes og gjør uventede rebalanseringer. Mikrotjenesten din har det kanskje bra, men hvordan håndtere at verdenen utenfor den raser sammen, på en fornuftig måte?\n\nI dette foredraget viser jeg hvordan du kan prosessere meldinger fra Kafka på en tryggere måte. Jeg har destillert ned min erfaring fra meldingsbaserte arkitekturer hos finn.no og Reuters til 3,5 patterns som vil komme godt med i ethvert event-basert system - ikke bare de som bruker Kafka.","title":"3,5 teknikker for tryggere håndtering av meldinger","room":"Room 4","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T13:40:00Z","speakers":[{"twitter":"nils_magnus","pictureUrl":"https://www.gravatar.com/avatar/842140e7ea601ecf024f14e9251d001c?d=mm","name":"Nils Larsgård","bio":"Nils er programmerer og partner i konsulentselskapet Kodemaker.  Han har drevet med utvikling på jvm-platformen i 12 år og liker å dele erfaringene sine med andre. Han er genuint interessert i teknologi og liker alt som kan programmeres, automatiseres og optimaliseres for å finne gode løsninger."}],"startTime":"2019-09-12T15:40","endTime":"2019-09-12T16:25"},{"intendedAudience":"Utviklere, arkitekter, teknologer og alle andre som er interesert i å høre om Monorepo.","endTimeZulu":"2019-09-11T12:40:00Z","format":"lightning-talk","length":"10","language":"no","sessionId":"8be636d2-60c5-4d28-8fa3-e4ec173fd2c7","video":"362752278","abstract":"Alle prater om monorepo. Det er det de store gutta bruker, sier de... Google, Facebook og Twitter. Noe annet de sier er at du må bytte ut hele toolchain-en din, men må du egentlig det? \n\nMed litt forhåndskunnskap er det enkelt å komme i gang med monorepo, uten å bytte ut hele din eksisterende toolchain. Her får du vite hvordan!","title":"Kom i gang med monorepo uten å selge huset","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T12:30:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/4fa87c02f915be94ac07b6334bd02e55?d=mm","name":"Eivind Wikheim","bio":"Eivind er systemutvikler, konsulent og medeier i Kantega. Han trives godt med å jobbe med både backend- og frontend-utvikling, og har en mastergrad i Robotikk og Intelligente Systemer fra Universitetet i Oslo. Han brenner for å automatisere alt som kan automatiseres, spesielt når det kan gjøre livet enklere og bedre for utviklere og brukere. "}],"startTime":"2019-09-11T14:30","endTime":"2019-09-11T14:40"},{"intendedAudience":"This talk should have something for everyone.","endTimeZulu":"2019-09-11T12:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"5844a5df-2833-4c43-aac4-faf2f17c8952","video":"364738775","abstract":"Computer programmed music has come a long way since the CSIR Mark 1 played a scratchy God Save The King back in the early 1950s. In this talk we'll go on a journey through the history of music made with code.\nWe'll visit classic video game soundtracks, learn how computer musicians made big sounds with limited hardware, how algorithms create never-ending soundtracks and the huge impact computer music has had on popular culture.\nExpect lots of nostalgia, vintage code on vintage computers and a musical experience of epic proportions.","title":"Highscores - A Brief History of Computer Music","room":"Room 7","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T11:00:00Z","speakers":[{"twitter":"@anoras","pictureUrl":"https://www.gravatar.com/avatar/2b777f45466faad61ab9f212faeb63e8?d=mm","name":"Anders Norås","bio":"The speaker has: \n* more than 20 years experience as a professional programmer, even longer as a hobbyist writing code as a form of artistic expression. \n* studied arts, cultural history and design. \n* given talks on many conferences before and is known for giving engaging presentations "}],"startTime":"2019-09-11T13:00","endTime":"2019-09-11T14:00"},{"intendedAudience":"Interessert i maskinlæring og arkitektur/løsninger for å maskinlæring.","endTimeZulu":"2019-09-12T13:05:00Z","format":"presentation","length":"45","language":"no","sessionId":"ba0fe63a-f476-460c-9830-94a07c19b19b","video":"363529279","abstract":"Statnett har ansvar for det sentrale strømnettet, og for å sikre balanse mellom forbruk og produksjon av strøm. Strøm er ekstrem ferskvare, som må brukes i samme sekund som den lages. Maskinlæring blir stadig viktigere for å kunne balansere strømmen. Ettersom vi knytter mer volatil sol- og vindkraft til strømnettet, blir det vanskeligere å balansere, og til dette trengs gode prognoser. \n\nVi går gjennom hvordan vi har gått fra prototype til produksjonsklare prognoser med maskinlæringsmodeller, og deler våre erfaringer fra bruk av ulike typer algoritmer, evaluering av algoritmene og sporbarhet av prediksjoner og modeller.  \n\nMaskinlæringsmodellene bruker data fra både egne sensorer og systemer, men også fra eksterne parter som Meteorologisk institutt. I løsningen har vi hatt stort fokus på robusthet og skalerbarhet for å håndtere mange forskjellige modeller i parallell uten harde avhengigheter. Vi forteller om infrastrukturen som gjør dette mulig.","title":"Maskinlæring i Statnett - fra prototype til produksjonsklar løsning","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T12:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/1c2a9f4dd89139855a50ffc0f1f276bd?d=mm","name":"Gunnhild Svandal Presthus","bio":"Gunnhild er utdannet sivilingeniør i matematikk og jobber som data scientist i Statnett."},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/c6494cdf63f622e3a30d7cac5fb3c2d2?d=mm","name":"Jonas Lindholm","bio":"Jonas er systemarkitekt i Statnett. Jobber med balansering i kraftsystemet med bruk av bl.a. Kafka."}],"startTime":"2019-09-12T14:20","endTime":"2019-09-12T15:05"},{"intendedAudience":"Developers interested in learning the basics of the Akka actor model. Probably beneficial to have a couple of years experience with Java programming.","endTimeZulu":"2019-09-10T11:00:00Z","registerLoc":"https://moosehead.javazone.no/#/register/hello_actor","format":"workshop","length":"240","language":"en","sessionId":"a169b2d6-500a-451e-97ac-ac0b23cd06d2","abstract":"The actor model is a great programming model for building concurrent and distributed systems - in other words, most systems we build today! An actor is an entity with its own private state, and the only way you can communicate with it is by sending messages. The actor then respond to the messages it receives by sending new messages, creating new actors, or changing its own behaviour. You could say that an actor is an object that takes encapsulation and independence seriously.\n\nIn this workshop we will explore the basic concepts of the actor model, by implementing a game similar to the classic game of space invaders. We will explore how this game domain can be modelled within an actor system, and learn the actor concepts like actor hierarchy, mailboxes, behaviour, the actor life cycle, and common message patterns for actor systems, including the Akka event bus. All while we are gradually building the game, from the laser canon controlled by the player to the army of attacking aliens, and everything else that is needed for a fully functional game.","title":"Hello actor!","room":"Room A","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-10T07:00:00Z","speakers":[{"twitter":"heidicmork","pictureUrl":"https://www.gravatar.com/avatar/a240fd52a6be2988c9d7e8fd988ffc62?d=mm","name":"Heidi Mork","bio":"Heidi is a developer at NRK, where she currently works in the team responsible for the actor system that distributes the tv and radio programs. She once studied mathematics and ended up with a PhD in algebraic geometry. But at some point she discovered programming, and she has been enthusiastic about it ever since. Heidi finds most aspects of software development interesting, does not allow the opportunity to learn something new pass.\n"}],"startTime":"2019-09-10T09:00","endTime":"2019-09-10T13:00"},{"intendedAudience":"Alle som driver med moderne softwareutvikling vil ha utbytte av denne presentasjonen, inkludert utviklere, arkitekter, prosjektledere, testere og driftere. Spesielt nyttig vil dette være for team og prosjekter som ønsker å endre fra en klassisk tilnærming til kontinuerlig leveranse.","endTimeZulu":"2019-09-11T07:45:00Z","format":"presentation","length":"45","language":"no","sessionId":"1c1f5708-1a94-4545-9f9d-3da4468f7ac0","video":"362509687","abstract":"NAV er på vei mot digital produktutvikling med autonome team. Samtidig har foreldrepengeprosjektet, et av Norges største prosjekter med egen post på statsbudsjettet, etablert en klassisk rigg med en til to produksjonssettinger per år, skarpt skille mellom kunde og leverandør, fasebaserte overleveringer og et omfattende regime for planlegging, kontroll og rapportering. I løpet av 2018 endret prosjektet til kontinuerlig leveranse, og har deretter levert endringer til produksjon hver dag. Presentasjonen tar for seg veien til denne massive omleggingen, organisering, prosess samt tekniske forutsetninger og tiltak. Vi ser også på erfaringene med kontinuerlig leveranse med ti team i samme kodebase og hvilke utfordringer vi møtte. Avslutningsvis gjennomgår vi hva vi ikke klarte å løse, og hva som er de neste områdene teamene må løse for å lykkes med digital produktutvikling.","title":"Skifte motor i fart - fra fossefall til kontinuerlig leveranse med 200 passasjerer","room":"Room 4","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T07:00:00Z","speakers":[{"twitter":"@ilmyggo","pictureUrl":"https://www.gravatar.com/avatar/dbcbe7ba6c19ae74d7b1b4c558e732ab?d=mm","name":"Trond Arve Wasskog","bio":"Trond Arve er CTO i Bekk. I 2018 har han vært \"smidig coach\" på P2 foreldrepengeprosjektet, og bidratt til omleggingen fra hovedleveranse til kontinuerlig leveranse"},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/9236297119f63af70272070c1d3e55cb?d=mm","name":"Erik Haug","bio":"Erik er løsningsarkitekt i NAV. Han har i 2017 og 2018 jobbet i foreldrepengeprosjektet og vært en pådriver for å endre fra fossefall til kontinuerlige leveranser. "}],"startTime":"2019-09-11T09:00","endTime":"2019-09-11T09:45"},{"intendedAudience":"This session is intended for\n- anyone interested in GraalVM and its practical application,\n- anyone who works with R, Data Science or Data Scientists, or may do so in the future,\n- anyone with an interest in integrating different approaches that help a team work together towards a common goal.","endTimeZulu":"2019-09-12T11:45:00Z","format":"presentation","length":"45","language":"en","sessionId":"6bec7cf5-146e-4bfe-9988-0baedfd78222","video":"360837119","abstract":"A lot of the best Data Science is done in R, but getting R to run as a streaming application in a complex environment using only Open Source tooling is an absolute nightmare. Making R interface with Kafka, or S3, or anything else, means giving up version control to external packages, while letting R talk to external services through a Docker container in networked VMs requires superhuman resolve.\nWe were living through this nightmare. Our Data Scientists lying awake in the middle of the night, filled with Docker-induced-terror at the Kafka-esque transformation of their job. Their daily work rapidly morphing into \"anything but\" their core competency...\nIt was time we found another path. Then a colleague mentioned he had heard something about integrating R into a Java application... Could this be our Salvation? Our Light in the Darkness? Our Holy GraalVM?\n\nIn this talk we will explore how we brought GraalVM into practice at the Dutch National Police by integrating R code into a Spring Boot 2 application written in Java and Scala. We will show code samples of the required wiring to get R to run on the JVM and discuss the various pitfalls and workarounds we discovered when putting this cutting edge tool to the test. We will discuss how GraalVM and FastR helped bring our Data Scientists back to the work they enjoy, while leaving the stream integration to languages and frameworks much better suited to the job.","title":"GraalVM in practice at the Dutch National Police: running R from Scala in Spring Boot 2","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T11:00:00Z","speakers":[{"twitter":"@NRBPerdijk","pictureUrl":"https://www.gravatar.com/avatar/1b4ff17dc1c7a940b8647e50e16282f7?d=mm","name":"Nathan Perdijk","bio":"After I received my master's degree in History and Philosophy of Science, I decided to make a career switch to the wonderful and inexhaustible world of programming. I have learned coding on the job and I am always looking to learn new skills, while honing the ones I already possess.  Outside work, I spend most of my time with my wife, my 1 year old son and a massive board game addiction: life is more fun if you play games!\n\n"}],"startTime":"2019-09-12T13:00","endTime":"2019-09-12T13:45"},{"intendedAudience":"Alle som jobber i kryssfunksjonelle team.\n\nAlle som ikke jobber i kryssfunksjonelle team, og som lurer på hva i all verden det skal være godt for.","endTimeZulu":"2019-09-11T14:25:00Z","format":"presentation","length":"45","language":"no","sessionId":"0b60cc1e-6f4e-44c2-a574-9e9567aa7c36","video":"362510206","abstract":"Vi har vært på reisen med kryssfunksjonelle team hver dag siden 2014. Vi jobber så svetten siler med å gi teamene våre best mulig forutsetninger for å løse oppgavene sine.\n \nPlutselig en dag oppdaget vi at vi hadde kastet ut babyen med badevannet. Vi hadde optimalisert vekk utviklerkulturen vår.\n \nHva var det egentlig som hadde skjedd? Hvilke grep tok vi da vi skjønte hva vi hadde gjort?\n \nKom og hør om utfordringer med kryssfunksjonelle team du neppe har hørt om før, og ikke minst om grepene vi tok for å lage en skikkelig utviklerkultur.","title":"Utvikleravdelingen er død! Lenge leve Utvikleravdelingen!","room":"Room 4","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T13:40:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/5dd60d4cfe5905bff57d464c0cb4078b?d=mm","name":"Vidar Moe","bio":"Liker å lage god og enkel programvare gjennom kontinuerlig læring og respekt for mennesker.\n\nBrenner for lean og smidige prinsipper, og er glad i å utfordre både tekniske og organisatoriske utfordringer for å kunne levere stadig bedre stadig raskere.\n"},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/1d9e31ced060ad7d1748f8da931b5afb?d=mm","name":"Jostein Emmerhoff","bio":"Leder for utviklingsavdelingen til SpareBank 1. Over middels interessert i organisasjon og prosess. Brenner for lean, smidig. Har en tendens til å endre på ting…"}],"startTime":"2019-09-11T15:40","endTime":"2019-09-11T16:25"},{"intendedAudience":"alle","endTimeZulu":"2019-09-11T10:40:00Z","format":"presentation","length":"60","language":"no","sessionId":"2269757c-bdc1-4b20-962c-47e9b101cbd5","video":"365281980","abstract":"NAV er politikk, og NAV er software. Software er sykt mye politikk. Nå har NAV (enda en gang) fått masse penger av politikerne for å skrive software. I dette foredraget skal vi si litt om hvordan vi forholder oss til disse pengene, og vise hvordan vi lager løsninger som skal håndtere sykemeldinger for en million nordmenn i året. Vi skal vise koden som implementerer reglene, og forklare hvorfor det ikke er reglene som egentlig er problemet, men dataene. Heldigvis skal vi også snakke om hvordan vi løser data-problemet.\n\nVi kommer også til å si noe om hva vi mener bør være veien fremover for softwareutvikling i offentlig sektor i Norge.\n","title":"Software er politikk","room":"Room 4","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T09:40:00Z","speakers":[{"twitter":"audunstrand","pictureUrl":"https://www.gravatar.com/avatar/09ac1bf3c7f742ecccf65beb314ef82a?d=mm","name":"Audun Fauchald Strand","bio":"Audun er principal engineer i NAV. Dermed får han oppfylt drømmen sin om å få kode og bestemme samtidig. Han blir glad av utviklingsfart og tullete navn, og elsker å høre om når ting gikk galt.  "},{"twitter":"trulsjor","pictureUrl":"https://www.gravatar.com/avatar/a2b2cd729db70626b90eb49f3955fe59?d=mm","name":"Truls Jørgensen","bio":"Truls er principal engineer i NAV. Vil skrive endringsdyktig software, og må derfor også jobbe med å bygge en organiasjon som muliggjør dette."}],"startTime":"2019-09-11T11:40","endTime":"2019-09-11T12:40"},{"intendedAudience":"Denne økten er for de som syns det er moro å se folk parprogrammere mens de prater om hva de driver med. Det blir Clojure med hanskene av, så man må tåle å ikke forstå alt. De som er helt nye til funksjonell programmering kan muligens få eksplodert hodet. Definitivt live koding.","endTimeZulu":"2019-09-11T10:40:00Z","format":"presentation","length":"60","language":"no","sessionId":"c8d594d9-937b-4c62-98f2-71f9d5a15932","video":"362770913","abstract":"Christian og Magnar er tilbake med en ny kosetime. Ta en pause fra konferansehallens tjas og mas og se to tomsinger fra Østfold programmere et lite spill med Clojure og ClojureScript mens de prøver å få testene grønne og røde om hverandre. Hvordan angriper to typer som er glad i funksjonell programmering problemer egentlig? ","title":"Kosetime: Live parprogrammering og zombier","room":"Room 7","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T09:40:00Z","speakers":[{"twitter":"cjno","pictureUrl":"https://www.gravatar.com/avatar/6e7ddb6784d284c385f3f0f307ebf90d?d=mm","name":"Christian Johansen","bio":"Christian er en engasjert (og bråkete) systemutvikler i Kodemaker - høyt og lavt, foran og bak. Han er glad i å løse problemer, helst med hjelp av funksjonell programmering og gjerne med Clojure(Script). Han blander seg fort vekk også inn i infrastrukturen løsningene kjører på."},{"twitter":"magnars","pictureUrl":"https://www.gravatar.com/avatar/7c4453ccef88852995d6b191307aab27?d=mm","name":"Magnar Sveen","bio":"Jeg heter Magnar og er en glad programmør hos Kodemaker. Jeg har laget noen videoserier (ZombieTDD, Emacs Rocks! og Parens of the Dead), holder gjerne på med sånn open source-greier, og er begeistret for funksjonell programmering."}],"startTime":"2019-09-11T11:40","endTime":"2019-09-11T12:40"},{"intendedAudience":"Alle som er involvert i løsninger som blir brukt av andre kan ha nytte av dette. Spesielt de som jobber med løsninger som i en grad allerede er i bruk. ","endTimeZulu":"2019-09-12T14:10:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"b661a394-eb76-4445-bd95-d0c8f652785c","video":"363517738","abstract":"En ting slår aldri feil. Hver gang du endrer noe i løsningen din kommer de. De sinte brukerne. De som ber deg \"dra til peppern\" og som mener en femåring med en iPad kan gjøre en bedre jobb. Disse brukerne liker vi. De er engasjerte og de bryr seg om løsningen. I dette foredraget skal vi høre om å grave etter gull i galle og hvorfor du som utvikler skal bry deg.","title":"Jeg elsker sinte brukere!","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T13:50:00Z","speakers":[{"twitter":"nakrissimo","pictureUrl":"https://www.gravatar.com/avatar/a3c8f5ca58b0966f71b452bcbd28e725?d=mm","name":"Nadia Tokerud","bio":"Nadia er flink til å være sint, og hun er flink til å se gjennom sinnet til andre. Hun elsker frustrasjon og koser seg med å finne ut av behovet til sinte brukere. Hun er interaksjonsdesigner i Norsk Rikstoto og bruker store deler av tiden på å finne ut av hva brukerne trenger."}],"startTime":"2019-09-12T15:50","endTime":"2019-09-12T16:10"},{"intendedAudience":"Utviklere som jobber med tradisjonelt multi-repo-oppsett, og alle som er interessert i om monorepo kan være noe for dem.","endTimeZulu":"2019-09-11T11:45:00Z","format":"presentation","length":"45","language":"no","sessionId":"eb8bc683-ceaf-4baf-82ee-d7b72960a955","video":"362494433","abstract":"For ett år siden testet vi ut monorepo i et av våre hackathon.\n\nMonorepoet gikk rett hjem hos SpareBank 1-teamene.\n\nHvorfor gjorde det det? Er monorepo alltid en god ide? Hvilke verktøy finnes og hvilke risikerer du å måtte lage selv? Hva vinner du, og hva taper du?\n\nI dette erfaringsforedraget deler vi det vi sålangt har lært om kode, team, bygg, verktøy, språk og code reviews i en verden med monorepo.\n\n'Hvis du ikke har et monorepo, integrerer du ikke kontinuerlig - i beste fall hyppig!'","title":"Monorepo med Git og Maven - hvordan lære gamle hunder nye triks","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T11:00:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/790ae4eb4356bdf1b11b7dc0a12e845a?d=mm","name":"Anders Gjendem","bio":"Utvikler og hjemmeautomatiseringsentusiast"},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/8bc2d5eca7d24b117c68d2665f9bd597?d=mm","name":"Jonas Nordstrand","bio":"Brinner för förenkling, automatisering och vikten av att lösa de rätta problemen."}],"startTime":"2019-09-11T13:00","endTime":"2019-09-11T13:45"},{"intendedAudience":"Alle utviklere med interesse for å lære bort kunnskap og videreføre interesse for utvikling","endTimeZulu":"2019-09-11T10:00:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"f4e1d638-e10a-4b0d-ac05-d89d044d3350","video":"365284755","abstract":"Vi utviklere har et ansvar i vår daglige jobb for bedriften vi sitter hos. Et annet ansvar vi også har er å lære fremtidens utviklere. Med gode initiativer som Sommerskolen i Oslo og Lær Kidsa Koding er vi allerede godt i gang med å lære neste generasjon utviklere, men vi kan alltid bli bedre! Enten om det er til nevøer, nieser eller til og med våre egne barn så har hver enkelt utvikler et ansvar for å videreføre vår kunnskap og interesse for utvikling. Det er tross alt disse menneskene som skal ta over våre skjermer og tastaturer i fremtiden.","title":"Utviklerens ansvar som lærere","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T09:40:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/ca22346f14d07c60be3c2e9222a1872b?d=mm","name":"Uy Tran","bio":"Jeg har tidligere jobbet for Sommerskolen i Oslo og har blitt super fan av den grafiske motoren Processing på grunn av dette. På Sommerskolen lærte jeg bort barn spillprogrammering for å vekke interesse for barn rundt IT.\n\nEllers så jobber jeg som konsulent for Dfind Consulting og liker å skrive både backend og frontend. På fritiden skyter jeg pil og bue og liker en god og kald øl ute på byen."}],"startTime":"2019-09-11T11:40","endTime":"2019-09-11T12:00"},{"intendedAudience":"Users of Asciidoctor and those who plan to create documents as part of their CI/CD pipeline.","endTimeZulu":"2019-09-11T14:25:00Z","format":"presentation","length":"45","language":"en","sessionId":"2ce23346-3722-4afd-a38b-b52babc91379","video":"362759622","abstract":"When you use AsciiDoc, you can track your documentation in your version control system together with your source code. This enables commit history, diffing, branching and tagging for documentation. Your IDE shows you a live preview when you change document. Your continuous integration pipeline creates ready-to-publish HTML and PDF documents.\nThis talk is for those who have first experience with AsciiDoc and want to go for the next level: structuring large documents, creating nice diagrams from PlantUML, using external sources to create docs, styling of PDFs, adding hyphenation, and getting the most out of your IDE for editing the docs.\n","title":"Asciidoctor Deep Dive","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T13:40:00Z","speakers":[{"twitter":"ahus1de","pictureUrl":"https://www.gravatar.com/avatar/5f528a3f6814d28b583f31842e3e8d9e?d=mm","name":"Alexander Schwartz","bio":"Alexander Schwartz is a Principal IT Consultant at msg. He’s been in Web development for more than 15 years and enjoys productive working environments, agile projects, automated tests and automated builds. He cares for scripted infrastructure and state of the art monitoring. At conferences and user group meetings he talks about the things he is passionate about.\n"}],"startTime":"2019-09-11T15:40","endTime":"2019-09-11T16:25"},{"intendedAudience":"Denne lyntalen vil passe bra for relativt nye utviklere som har tatt steget inn i et stort prosjekt med en stor kodebase, og ønsker å få en mer behagelig hverdag med terminalen.","endTimeZulu":"2019-09-12T10:20:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"b05ed912-db9e-4cff-8b0d-837dff4c7622","video":"363509862","abstract":"Terminalen er et morsomt verktøy! Har du satt deg ned å brukt litt tid på den noen gang? Med enkle konfigurasjoner kan du gjøre hverdagen mye enklere og fjerne mye frustrasjon som man møter på hver dag!","title":"Kommandoninja","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T10:00:00Z","speakers":[{"twitter":"caroline_odden","pictureUrl":"https://www.gravatar.com/avatar/48667f1d1d33c904a26eebe0b9f1a605?d=mm","name":"Caroline Odden","bio":"Jeg er en fersk utvikler, jeg begynte å jobbe i Bekk høsten 2018. Til daglig sitter jeg hos Entur og jobber med app og web der, med teknologier som react, react native og redux. Jeg er også med i React-faggruppen i Bekk og har med motviasjon fra faggruppa skrevet min første Medium-artikkel som ble publisert hos Kode24: https://www.kode24.no/kodenytt/devtools-4-far-temaer/70784292"}],"startTime":"2019-09-12T12:00","endTime":"2019-09-12T12:20"},{"intendedAudience":"Everyone who cares about quality, testing or strange edge cases from the real world.\n\nWe'll show examples from our working software. You'll learn new ways to look at testing, and new ways to improve legacy code at the same time.","endTimeZulu":"2019-09-12T11:45:00Z","format":"presentation","length":"45","language":"en","sessionId":"31684fcf-7dc4-4b3d-ae1a-1d4e46e0b9e4","video":"360781128","abstract":"Even with perfect naming and perfect code, it is hard to read the story of your domain straight out of it. You can be certain that you’ll have forgotten some of the nuances about the code the next time you see it. Or someone else sees it, because very few of us live our professional coding lives in an area where it’s only me ever handling the code. Someone is going to come back to your code - in five days, three months or five years. \n\nLuckily, if you write your tests the right way, they can tell the story of your domain in a way your production code can't. Let us show you how to create your tests so you can get rid of your stale documentation.","title":"Make your tests tell the story of your domain","room":"Room 7","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T11:00:00Z","speakers":[{"twitter":"madsopheim","pictureUrl":"https://www.gravatar.com/avatar/52482b46b478633a2b766bbf36916fd3?d=mm","name":"Mads Opheim","bio":"Technical architect\n\nPassionate about quality, care and making people awesome. Believe in DDD, TDD and putting pride into our work."},{"twitter":"annelandro","pictureUrl":"https://www.gravatar.com/avatar/bf8c4587e09f512385543f72bc82cc7a?d=mm","name":"Anne Landro","bio":"People > technology\n\nAs a functional architect and service designer, Anne is always seeking to ask the right questions so we'll make the best IT solutions we possibly can. \n\nHer favorite topics are finding the real user needs to make sure we solve the right problems, and that people and their domain are more important than technology."}],"startTime":"2019-09-12T13:00","endTime":"2019-09-12T13:45"},{"intendedAudience":"Anyone, specifically developers and architects.","endTimeZulu":"2019-09-11T13:05:00Z","format":"presentation","length":"45","language":"en","sessionId":"f41b8b90-2b4d-44ff-8717-a996267dd0dc","video":"362497454","abstract":"Edge computing helps to break beyond the limitations imposed by, now, traditional cloud solutions. Some of the reasons might be privacy concerns, reducing the need for heavy processing resources, reducing the amount of data that is sent over the network – just to mention a few.\n\nIn this talk, we will introduce the concept and benefits of Edge Computing, how such devices can be built using affordable hardware and we will look at examples on how IoT Edge devices are in practice as well as comparing Edge Computing with other options.\n\nAs a live demo, we will be using a system built using Google Coral IoT Edge device. This is an example to process video streams on the Edge and designed to keep the privacy of the people intact; without leaking faces and identity of the people to a 3rd party. In addition to standard video processing, we will show advanced ML techniques and models that are processed on to the device to demonstrate the power and flexibility of the Edge devices nowadays.","title":"IoT Edge to the rescue 🛡️","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T12:20:00Z","speakers":[{"twitter":"@rmehmandarov","pictureUrl":"https://www.gravatar.com/avatar/1372c39a2c5d43b924ba08059e268ee6?d=mm","name":"Rustam Mehmandarov","bio":"Passionate computer scientist. Chief engineer, and a competency network lead for IT architecture and integration at work. Leader of JavaZone; ex-leader of Norwegian JUG – javaBin. Course instructor. Speaker. Java Champion. Google Developers Expert (GDE) for Cloud.\n"},{"twitter":"@tannaznvr","pictureUrl":"https://www.gravatar.com/avatar/b6ec7ea4ac048aa58859ede9f5a598a2?d=mm","name":"Tannaz N. Roshandel","bio":"Tannaz works as a head engineer at the University of Oslo, where she is building an open source cloud service for research and education.\nIn her spare time, Tannaz is the deputy chairwoman of javaBin board - Norwegian Java User Group, one of the organizers of JavaZone, and a robot builder. She is also passionate about computer ethics."}],"startTime":"2019-09-11T14:20","endTime":"2019-09-11T15:05"},{"intendedAudience":"Are you starting out as a developer or maybe you have a few years under your belt?\n\nDo you want to gain an important skill that will set you apart from the crowd? \n\nDo you want to come up with stronger ideas? \n\nDo you want to be part of a high-powered team? \n\nThen this workshop my friend is for you. There will be fun, there will be challenging exercises, there will be some tears…of joy on how inspired you will be by experiencing the power of sketching first hand. You don't want to miss this jam-packed workshop. :)","endTimeZulu":"2019-09-10T15:45:00Z","registerLoc":"https://moosehead.javazone.no/#/register/you_too_can_be_a_sketching_machine","format":"workshop","length":"120","language":"en","sessionId":"717ba231-57f9-40c0-9a7c-bc8bd26e2671","abstract":"Sketching is a crucial skill that spans all job titles. It helps with brainstorming ideas, iterating through concepts, and communicating our ideas to others. Whether working individually or in a group, our ability to sketch helps take the abstract ideas out of heads and into the real world. With the addition of a few simple approaches to your daily routine, you too can harness the power of sketching and become a sketching machine. Come prepared to do fun yet challenging sketching exercises so you can experience the power of sketching firsthand.","title":"You Too Can Be A Sketching Machine!","room":"Room B","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-10T13:45:00Z","speakers":[{"twitter":"@rizwanjavaid","pictureUrl":"https://www.gravatar.com/avatar/db946449753ca102b8f6f1bf53d50595?d=mm","name":"Rizwan Javaid","bio":"Rizwan is a User Experience Designer. He creates intuitive, persuasive, and profitable user experiences for global brands. He loves sharing his passion for sketching at meetups and conferences. When he isn't designing, he is usually at home drawing dinosaurs and cars, dinosaurs in cars, and other combinations of dinosaurs and cars with his boys."}],"startTime":"2019-09-10T15:45","endTime":"2019-09-10T17:45"},{"intendedAudience":"This session is for Java developers who are interested in Java performance. Also, this session will be interesting for those who want to know what new features are planned for the JDK. \n\nThe session will begin with very basic concepts and introduce some of the performance pitfalls in the JVM.\n\nThe ideal audience member is someone who has decent low level knowledge (OS, threading, etc.).","endTimeZulu":"2019-09-12T07:45:00Z","format":"presentation","length":"45","language":"en","sessionId":"3a38ba00-86c5-44f5-9181-cd8deb92bb0f","video":"362782352","abstract":"InlineTypes are coming to Java!  But what does that mean for you?  This session explains the advances being made in Project Valhalla to improve Java's memory density by making it easy to create compact, cache efficient data structures. If you are interested in making your code run faster come to this session to hear what tools Project Valhalla will give developers to speed up their application. ","title":"InlineTypes: The next big feature in Java!","room":"Room 6","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T07:00:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/f739ad439fdaeec3bee0ef16b9459447?d=mm","name":"Tobi Ajila","bio":"Tobi is a Java Runtime developer for the J9 VM team in Ottawa, Canada. In the past he has worked on Interpreter optimizations, JVMTI enhancments, JSR 335 and more. Currently, his main focus is on Project Jigsaw and Project Panama where he collaborates with other developers in the Panama expert group.\n\nTobi has an interest in optimizing the Java Runtime for cloud environments. He previously worked on a JVM multi-tenant incubator project and has investigated enhancements for Java application deployments on Bluemix.\n\nIn his spare time Tobi enjoys playing soccer and is an avid supporter of Arsenal F.C. Apart from sports Tobi also enjoy listening to music and catching the odd live show.\n"}],"startTime":"2019-09-12T09:00","endTime":"2019-09-12T09:45"},{"intendedAudience":"Software Engineers and Operators interested in building observable systems in modern micro service environments.","endTimeZulu":"2019-09-10T13:30:00Z","registerLoc":"https://moosehead.javazone.no/#/register/observability_workshop_instrumenting_cloud_native_applications","format":"workshop","length":"120","language":"en","sessionId":"865548cf-7ba1-4277-ac80-960876aa05bb","abstract":"The goal of this workshop is to familiarize application and site reliability engineers with the benefits that modern observability tools provide to the builders and curators of cloud native applications.\n\nIn this workshop attendees will configure a RBAC-enabled vanilla K8S cluster in GKE, deploy Prometheus and Jaeger in support of observing and monitoring a distributed microservice application, instrument that application by introducing libraries and tooling to support capturing business metrics as well.","title":"Observability Workshop: Instrumenting Cloud Native Applications","room":"Room A","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-10T11:30:00Z","speakers":[{"twitter":"notsureifkevin","pictureUrl":"https://www.gravatar.com/avatar/4ff4fc094925bc5e29c7b28de6a3811b?d=mm","name":"Kevin Crawley","bio":"Kevin has been recognized as a Docker Captain and has recently spoke on using open source tools, AI and automation for real time monitoring of cloud native applications. He organizes several local meetup groups in the Nashville, TN area including Docker, Go, and Serverless and is the lead organizer for this years DevOpsDays Nashville."}],"startTime":"2019-09-10T13:30","endTime":"2019-09-10T15:30"},{"intendedAudience":"Developers and anyone who has any opinion on how their product should work","endTimeZulu":"2019-09-11T15:45:00Z","format":"presentation","length":"45","language":"en","sessionId":"dda9db1d-0693-40b3-b48f-419e22c4af3f","video":"362504262","abstract":"How to make the web accessible when our ideals don't match reality? The award winning accessibility group in FINN has worked for five years to make FINN more accessible. We will demonstrate some examples you can learn from to make your code more accessible even when real-world constraints work against you.","title":"Solve your Accessibility Traps!","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T15:00:00Z","speakers":[{"twitter":"@lotte_johansen","pictureUrl":"https://www.gravatar.com/avatar/4cc4e26bc6708ddb1a36163f63904a9c?d=mm","name":"Lotte Johansen","bio":"Lotte Johansen is a senior developer at FINN.no. Although she is primarily a backend Java developer, she has been engaged in accessibility since 2014 when she founded the accessibility group at FINN with other developers and designers. She has given talks at JavaZone in 2015, 2017 and 2018 and also other conferences like WebRebels, CSUN and MicroXchg."},{"twitter":"@twidero","pictureUrl":"https://www.gravatar.com/avatar/49a8e2929bf63d958d1231ef4dd906d3?d=mm","name":"Tom Widerøe","bio":"Tom Widerøe is a front-end developer at FINN.no, and was one of the founders of the grassroots accessibility movement, whose mission is to inspire the organization to make our products more accessible. He also blogs about accessibility and has given talks about it at several conferences."},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/9acdb93d6be51ee0e6234195c462eb1d?d=mm","name":"Tor-Martin Storsletten","bio":"Tor-Martin Storsletten is a developer and accessibility specialist at FINN.no. He is totally blind and helps developer teams making their solutions accessible."}],"startTime":"2019-09-11T17:00","endTime":"2019-09-11T17:45"},{"intendedAudience":"Any one who wants to know how you can use the transaction like pattern (with commits and rollbacks) in a distributed environment which micro-services are.\nThere is no specific knowledge required (other then java maybe) but people interested in keeping the data in an eventual consistent state will benefit the most of this talk.","endTimeZulu":"2019-09-12T14:25:00Z","format":"presentation","length":"45","language":"en","sessionId":"eac60c02-b036-4b8b-b517-fbe3d06440e0","video":"360783601","abstract":"How can you make different pieces of your unit of work consistent in the distributed setup of your micro-service application?\nYou associate the term transaction probably with a database, but the data source can be anything including a database in the micro-service world.\nThe MicroProfile Long Running Actions specification is based on sagas and the OASIS LRA transaction model specification. It defines the framework to guarantee the eventual consistency requirement using compensating actions for example.\nThis session will explain you the challenges and concepts of the MP LRA framework. And of course, you can see it in action with various demos.","title":"Transactions in your micro-services architecture","room":"Room 6","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T13:40:00Z","speakers":[{"twitter":"@rdebusscher","pictureUrl":"https://www.gravatar.com/avatar/2440c2ac33efce59ce1527f671a29c69?d=mm","name":"Rudy De Busscher","bio":"I love to create (web) applications with the Java EE platform and MicroProfile implementations.\n\nI have spent the last 10 years implementing various projects in a team for customers, helped various Open Source projects  (MicroProfile, DeltaSpike, PrimeFaces, Apache Myfaces, ...), and do support for Payara Server customers. I'm also already working 4 years around Web Application Security using OAuth2, OpenId Connect, and JWT."}],"startTime":"2019-09-12T15:40","endTime":"2019-09-12T16:25"},{"intendedAudience":"Seasoned Spring developers will get the most out of it. That said, the talk will be general enough for a wider audience, from Spring newbies to people with an interest in Java platform technologies and other current infrastructure themes.","endTimeZulu":"2019-09-11T10:40:00Z","format":"presentation","length":"60","language":"en","sessionId":"40e33282-ac28-4183-8119-70e9cf3d043e","video":"362775148","abstract":"Spring Framework 5.2 takes Spring 5's common themes to the next level: embracing new reactive technologies such as R2DBC and RSocket through Spring's transaction and messaging abstractions, and revisiting the core component container for GraalVM support and compile-time annotation indexing.\n\nThis talk focuses on core facilities for optimized application architectures in modern deployment environments, with support for Java as well as Kotlin, as a foundation for higher-level features in Spring Data and Spring Boot.","title":"Spring Framework 5.2: Core Container Revisited","room":"Room 6","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T09:40:00Z","speakers":[{"twitter":"@springjuergen","pictureUrl":"https://www.gravatar.com/avatar/ba9686d8c567aabedc1b7f8b6a7fb3d6?d=mm","name":"Juergen Hoeller","bio":"Juergen Hoeller is co-founder of the Spring Framework open source project and has been serving as the project lead and release manager for the core framework since 2003. Juergen is an experienced software architect and consultant with outstanding expertise in code organization, transaction management and enterprise messaging."}],"startTime":"2019-09-11T11:40","endTime":"2019-09-11T12:40"},{"intendedAudience":"Java developers interested in building microservices and/or exploring Micronaut.\n\nIt's recommended that you have a laptop capable of running Docker containers, and that you have JDK 8 or higher installed. Although not needed for the workshop, the Micronaut CLI is recommended for bootstrapping projects.","endTimeZulu":"2019-09-10T13:30:00Z","registerLoc":"https://moosehead.javazone.no/#/register/micro_my_java_%C2%B5%C2%B5j","format":"workshop","length":"120","language":"en","sessionId":"40741cc4-d5cb-48c1-a8e0-5e076141ba17","abstract":"We all know the world has gone crazy for μ. μ this and μ that. Java is often used for microservices. Quite a few of them use Spring Boot, which I think is overkill for simpler services. The Eclipse Foundation has worked quite a bit on the Java EE Microprofile, which is another option, where you use Java EE features and small containers. Another popular approach is the use of the many micro frameworks that have flourished, e.g. Spark, Javalin, Ktor and the up and coming Micronaut.\n\nLet's build a small microservice application with Micronaut, Graal, Substrate (ahead of time compiler that's part of Graal) and Docker containers. The service will be your standard, wonderfully CURLable To Do list RESTful JSON API, and we will see just how small we can get this service, and how fast we can make it start up. This will give you a quick and dirty introduction to the spanking new Micronaut microframework, that released version 1.0 in late October. It will also be an intro to very basic use of Graal and Substrate. You are expected to know Java and very basic use of Docker (although the application(s) will be possible to run without containers).\n\nAfter this workshop, you should hopefully feel like running back to your hotel room, start building Java microservices and throw them at the clouds in the sky. Or at least inspired to experiment further with Java microframeworks and GraalVM.","title":"Micro My Java (µµJ)","room":"Room C","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-10T11:30:00Z","speakers":[{"twitter":"Sardtok","pictureUrl":"https://www.gravatar.com/avatar/4506243191b2f02c1844ae0494de8224?d=mm","name":"Sigmund Hansen","bio":"Sigmund is currently a Java and Clojure developer at Uptime Consulting, and has worked with clients like Animalia, Schibsted Media, Aker Solutions and the Norwegian courts administration. He has worked on everything from monolithic behemoths and Swing clients to microservices with Angular or React frontends, and pretty much poked at everything in between. He has held workshops and talks at conferences since he started working, but also held quite a few at university during his studies."}],"startTime":"2019-09-10T13:30","endTime":"2019-09-10T15:30"},{"intendedAudience":"This workshop is designed for developers who want to learn how reinforcement learning works, without necessarily having any prior experience. Q-learning is one of the classic algorithms for reinforcement learning, but this workshop will also cover a basic variant of Deep Q, which lately has taken part in beating the champions of different board games and real-time strategy games.\n\nWe will cover the necessary theory and only basic programming experience is required. ","endTimeZulu":"2019-09-10T11:00:00Z","registerLoc":"https://moosehead.javazone.no/#/register/reinforcement_learning_pacman","format":"workshop","length":"240","language":"en","sessionId":"0213adb3-47cb-4fc6-b482-40ffc24ec453","abstract":"Reinforcement learning (RL) has achieved promising results, in recent years, and is currently being explored in a wide range of fields. In areas such as self driving cars, gaming and medicine, RL is the frontier of state-of-the-art results. In this workshop we will explore what the fuss is all about! \n\nThis workshop serves as an introduction to reinforcement learning where the participants implement a Pac-Man agent. The Pac-Man agent will learn how to solve different maps using Q-learning and Deep Q-learning. We start out by exploring Q-learning, a cornerstone in RL. Expanding further, we continue on to deep Q-learning, which utilizes neural networks. The code is executed in the cloud on Jupyter notebooks, and for training the neural networks we use GPUs in the cloud. Everything is written in python. \n\nIf reinforcement learning has been a mysterious domain to you, this session will most likely leave you with a greater understanding of the process and aid you in how to set up projects of your own.","title":"Reinforcement Learning: Pac-Man","room":"Room B","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-10T07:00:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/eae1de2acf2e6781bae62c1bcff65f15?d=mm","name":"Manu Gopinathan","bio":"Manu is a machine learning enthusiast who works as a software developer for Knowit, a Nordic consultancy company. Currently, he is a part of a team tasked with building a new sales and ticketing solution for public transportation in Norway. During his MSc studies at UCSB and the Norwegian University of Science and Technology, he specialized in artificial intelligence, with his thesis doing an extensive study on gender identification of authors using deep learning and natural language processing. Additionally, he is one of the leaders of Artificial Chapter, an initiative in Knowit for learning and sharing knowledge about artificial intelligence. "},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/24ef6bfc9f0f461f437c83849275c8ff?d=mm","name":"Malte Loller-Andersen","bio":"Malte is a passionate software engineer and IT consultant for the Nordic consultancy Knowit. Currently, he helps NSB (Vy?) optimize their prices on ticket sales. He spends his time writing code and leading Artificial Chapter, Knowits internal group for sharing knowledge related to artificial intelligence. Here, he manages summits and workshops, in addition to holding presentations about artificial intelligence."}],"startTime":"2019-09-10T09:00","endTime":"2019-09-10T13:00"},{"intendedAudience":"Alle som er interessert i fart på utvikling.","endTimeZulu":"2019-09-12T10:25:00Z","format":"presentation","length":"45","language":"no","sessionId":"3ce32827-57ab-4208-befb-6105b697fb24","video":"360827531","abstract":"Oslo kommune må gjennom en radikal digital transformasjon for å speile den teknologiske utviklingen ellers i samfunnet. For å få til må utviklerene våre kunne fokusere på den som er viktigst: innbyggeren. I denne presentasjonen får du høre om hvordan vi jobber med god utvikleropplevelse slik at de autonome produktutviklingsteamene våre kan lage gode innbyggeropplevelser, og slipper å bruke tid på a finne opp hjulet på nytt.\n\nVi deler våre tanker om hva en utvikler bør kunne forvente i en moderne teknologiorganisasjon, og erfaringene våre med å bygge den gode utvikleropplevelsen i en stor, distribuert organisasjon.","title":"God utvikleropplevelse for å gi fart på digitalisering","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T09:40:00Z","speakers":[{"twitter":"andreaja","pictureUrl":"https://www.gravatar.com/avatar/597ae83421cde9905ca8d069c7f2ec14?d=mm","name":"Andreas Jacobsen","bio":"Andreas Jacobsen er teknologisjef i Oslo Origo. Origo er kommunens satsing på digital transformasjon og skal sørge for at det satses mer samlet og helhetlig på tvers av kommunens virksomheter. Han har bakgrunn som utvikler, tech lead og virksomhetsarkitekt og er generelt lite glad i å skrive om seg selv i tredje person."}],"startTime":"2019-09-12T11:40","endTime":"2019-09-12T12:25"},{"intendedAudience":"Developers and architects (front end and back end) interested in enabling web annotations in their solutions so that users can discuss web pages, conduct peer reviews and provide feedback, organize research, or take private notes, all with no or minimal changes to the original content, and without requiring special client software or plugins.\n\nDevelopers and architects interested in lessons learned from integrating and partly rewriting an open source service into an existing product.","endTimeZulu":"2019-09-11T13:20:00Z","format":"presentation","length":"60","language":"en","sessionId":"1dbb330c-98c4-4c00-a54e-4d6611698c9a","video":"362761614","abstract":"Looking for a way to add notes to web pages and PDFs and discuss content, without changing the source files or requiring users to install custom software? The open source Hypothesis service (https://web.hypothes.is/) enables annotating any web page, without needing to modify or even having write access to the original content, and without requiring the user to install additional software or plugins. Rather than reimplementing the wheel, Inspera adapted Hypothesis to allow graders to make notes and provide feedback to students in our digital exam solution.\n\nThis talk will\n- introduce you to the wonderful world of web annotations and the related W3C standards (https://www.w3.org/annotation/)\n- demonstrate how to annotate any web page or PDF document\n- describe the architecture and how annotations are robust in the face of content or URL changes\n- tell the story of how we integrated and partly rewrote an open source service to fit our use case\n\nTechnologies involved: Python (original backend), Java (new backend), Elasticsearch, PostgreSQL, Oracle, AWS SQS, and JavaScript with Angular and Redux.","title":"Annotate the web: Adapting Hypothesis","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T12:20:00Z","speakers":[{"twitter":"markusbk","pictureUrl":"https://www.gravatar.com/avatar/952d0900ac9246e340473314ef78ec40?d=mm","name":"Markus Krüger","bio":"Markus Krüger is a senior DevOps engineer at Inspera, building solutions for online assessments. He has held several presentations at JavaZone and other venues previously, on various subjects such as performance testing, scheduling, scaling systems, and cloud architectures. He likes making large things go fast."}],"startTime":"2019-09-11T14:20","endTime":"2019-09-11T15:20"},{"intendedAudience":"APi-utviklere eller de som aspirerer til å bli det.","endTimeZulu":"2019-09-12T10:30:00Z","format":"lightning-talk","length":"10","language":"no","sessionId":"3d23a90b-e2c5-4156-a53d-10d99604e0e9","video":"365288428","abstract":"Å stadig måtte publisere nye API'er som ikke er bakoverkompatible er en byrde både for deg som API-utvikler og for dine klienter.\nMen noen grep og litt godt håndverk kan du lage API'er som varer lengre før de må byttes ut, til glede for alle.\nJeg vil gjerne dele mine erfaring fra to runder med redesign av en sentral API-komponent i en større norsk virksomhet, og hva vi har gjort for å minimere smerten ved API-endringer for alle parter.","title":"Building an API to stand the test of time®","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T10:20:00Z","speakers":[{"twitter":"havardw","pictureUrl":"https://www.gravatar.com/avatar/bcb4ce98e285374dc8a224d15d71be8d?d=mm","name":"Håvard Wigtil","bio":"Håvard er arkitekt og utvikler (og likeverdig medeier) i Kantega AS. Der har han fått lov til å følge det samme systemet av og på i 13 år, og har fått prøve seg på å bytte motoren mens bilen kjører."}],"startTime":"2019-09-12T12:20","endTime":"2019-09-12T12:30"},{"intendedAudience":"No experience needed but this is for developers and people who like to see what the future will bring","endTimeZulu":"2019-09-12T08:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"8d50f11e-cd4f-4f15-a6cb-7bef26449834","video":"365523792","abstract":"The future is now. Implants the size of a grain of rice are being used by people to open doors, hold payment information and where a handshake can literally exchange digital business cards. We are also seeing major advances in medical tech with new smaller hearing aids with Wi-Fi, AR/VR to help the visually impaired and even Wi-Fi enabled hearts.\nWe now need to look at the connected human and see how the threat landscape is changing. Soon it may be possible for you to get a computer virus.","title":"Hacking a cat - Going beyond traditional attack vectors","room":"Room 4","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T07:00:00Z","speakers":[{"twitter":"nmerrigan","pictureUrl":"https://www.gravatar.com/avatar/ed4cf5aaa515ce51deef0a17cbaa09e9?d=mm","name":"Niall Merrigan","bio":"Niall is an Irish guy living in Norway. He works in Capgemini in Stavanger as the Head of CyberSecurity and is also a Microsoft ASP.NET MVP since 2010, Friend Of RedGate and general rugby nut (which means he shouts a lot). He has a passion for security, web technologies, cooking and whiskey."}],"startTime":"2019-09-12T09:00","endTime":"2019-09-12T10:00"},{"intendedAudience":"Developers who aren't familiar with mutation testing and want to learn what it is, when to use it and how to use it.\n\n","endTimeZulu":"2019-09-11T10:25:00Z","format":"presentation","length":"45","language":"en","sessionId":"31d05e05-4928-40d5-ba63-4fd64bf8798c","video":"362761953","abstract":"In this talk we will enter the world of mutation testing.\nBy generating mutants, i.e., faulty versions of your code, we can measure how well your tests perform in detecting bugs.\nWe will cover mutation tools, how they work, how to get started and how to integrate mutation testing in your build pipelines.","title":"Mutants to the rescue: How effective are your unit tests?","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T09:40:00Z","speakers":[{"twitter":"@DevPaco","pictureUrl":"https://www.gravatar.com/avatar/2b47e954a6f5e39eaf763f3945256f4f?d=mm","name":"Paco van Beckhoven","bio":"Perfectionist. Software Engineer. Likes to make things move using code and some electronics. Challenges the world around him.\n"}],"startTime":"2019-09-11T11:40","endTime":"2019-09-11T12:25"},{"intendedAudience":"Programmers, architects, managers, testers, anyone interested in joining the discussion of how to develop software in the most effective way.","endTimeZulu":"2019-09-12T10:25:00Z","format":"presentation","length":"45","language":"en","sessionId":"34cff1ed-ea55-4b39-805a-7c0a40c1b032","video":"360782295","abstract":"4 years ago I got an sms from a friend of a friend.\n\"We are organising a summer school program and need a way to organise the application process. Oh and it needs to be ready in 3 weeks. Can you help us?\"\n\"Sure\" I said.\nI'd like to share my story of how we made this work. A Minimum Viable Product (MVP) in practice. Priorities, risks, successes and problems. ","title":"From initial request, to custom built application in production in 3 weeks","room":"Room 7","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T09:40:00Z","speakers":[{"twitter":"ChristinGorman","pictureUrl":"https://www.gravatar.com/avatar/518318be5a8e96e1788c91100ec9bdf4?d=mm","name":"Christin Gorman","bio":"Christin is a regular speaker at JavaZone and is behind 3 of the 12 most viewed presentations from the conference ever. She's been working as a programmer since 2000, and has experience from both small startups, larger private corporations and the public sector. Now she works as a consultant at Kodemaker."}],"startTime":"2019-09-12T11:40","endTime":"2019-09-12T12:25"},{"intendedAudience":"Audience with some exposure to Reactive Programming, curious about how this can translate at the network level.","endTimeZulu":"2019-09-12T07:45:00Z","format":"presentation","length":"45","language":"en","sessionId":"51424add-f54b-44e7-be3e-0edb252b35ee","video":"362506369","abstract":"In this session, we’ll introduce a new protocol called RSocket, which furthers the ideas behind Reactor and reactive programming on the JVM (Reactive Streams) and make them work across the boundaries of the network.\n\nMultiple semantics, application-level backpressure, load awareness, session resumption… This new kid packs a punch!\n\nThis session will be a lighthearted introduction to this very capable protocol.","title":"Harry Socket and the Prisonner of Ack-aban, an intro to RSocket","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T07:00:00Z","speakers":[{"twitter":"simonbasle","pictureUrl":"https://www.gravatar.com/avatar/056097e00486bcdf172708607f194b1e?d=mm","name":"Simon Baslé","bio":"Simon is a Software Engineer at Pivotal, on project Reactor. He previously worked at Couchbase on the reactive Java driver (and before that in IT services). Simon's interests include OOP, coding tools and best practices, open source, concurrent programming and of course reactive programming."}],"startTime":"2019-09-12T09:00","endTime":"2019-09-12T09:45"},{"intendedAudience":"Backend Engineer, Big data engineer, Architects, machine engineers\nParticipants will get a good understanding about the tech stack Tidal is using in production, specially around the machine learning platform. This architecture could be easily adapted to other use cases. \nRecommended to know the AWS platform but no need to know machine learning.\n","endTimeZulu":"2019-09-12T14:25:00Z","format":"presentation","length":"45","language":"en","sessionId":"aa48c17b-74af-496d-b920-0bc36cf86e49","video":"360822878","abstract":"We will share experiences building and serving machine learning models on AWS at TIDAL.\nWe will show how we build and automate our machine learning pipelines using Spark on EMR and SageMaker, schedule jobs with Airflow, serve models using Spring and Dynamo and monitor models in production and tracking using MLFlow.\n","title":"TIDAL: Building and serving Machine Learning models on AWS","room":"Room 3","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T13:40:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/e03c135231aa68107fd384b522305f7e?d=mm","name":"Johann Eriksen","bio":"Johann is the lead developer of the big data team. He has been working at Tidal for more than 7 years and has been through many changes: from monolith to micro services, migration to AWS, adoption of big data technologies and ML"},{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/915c397a9ef36902c6ca6cda367c59f6?d=mm","name":"Thomas Almenningen","bio":"Thomas is working as a Senior ML Engineer at TIDAL where he has been using\nmachine learning to build personalized playlists, radio stations and other personalized features."}],"startTime":"2019-09-12T15:40","endTime":"2019-09-12T16:25"},{"intendedAudience":"Anyone who is interested in the topic of quantum computers and/or wants to know a little bit more about it. It is expected that this presentation will give inspiration to participants and show that we can take advantage of this technology in the not too distant future.","endTimeZulu":"2019-09-12T09:00:00Z","format":"lightning-talk","length":"10","language":"en","sessionId":"388495d0-bd79-4c8a-a7d3-82e0e8291319","video":"363756311","abstract":"In these latter days many people have been talking about quantum computers. This is mainly discussed as future technology: something that is not soon to be easily available, or can be used to solve practical problems. Is this far from being true? This lightning talk will give you a brief description of the technology and show a prototype for a vehicle routing problem solved with help of the IBM 20-qubit quantum computer.","title":"Stranger spins: what a quantum computer is capable of","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T08:50:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/d9497e703e16b865a9955a20a5f29f8e?d=mm","name":"Anna Piterskaya","bio":"Anna works as a developer at the Accenture Center for IBM Technologies (ACIT) Cloud Studio in a multi-disciplinary team that creates rapid client prototypes to bring innovative ideas to life using emerging technologies. She holds a Master’s degree in Computational Science and Engineering from the University of Oslo, having previously completed BSc from University of Oslo and BSc in Hydraulic Machines, drives and controls from Bauman Moscow State Technical University. "}],"startTime":"2019-09-12T10:50","endTime":"2019-09-12T11:00"},{"intendedAudience":"Alle som må forholde seg til data og metadataene, som skal publisere eller bruke datasett.\nUtviklere, informasjonsforvaltere, saksbehandlere, jurister etc.","endTimeZulu":"2019-09-12T08:50:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"293bd631-215e-4b09-88c3-c1cc77201343","abstract":"Oslo kommune tar nå første steg mot Orden i eget hus; Vi skal finne datasett vi har i kommunen og de skal beskrives. Datasettets sensitivitet og tilgjengelighet er spesielt viktige og vi må og forholde oss til flere forskjellige standarder - men hvilken standard er den riktige?","title":"Kategorisering av data - hvor vanskelig kan det være?","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T08:30:00Z","speakers":[{"twitter":"@FruWarren","pictureUrl":"https://www.gravatar.com/avatar/bfe240a8ff7372adfcf4da6f5736037a?d=mm","name":"Astrid Horgen Warren","bio":"Astrid er informasjonsarkitekt i Origo, Oslo kommunes satsning på mer helhetlig digitalisering og utvikling av innbyggertjenester. \nHun har 18 års erfaring fra informasjonsmodellering og -forvaltning fra kommunal og privat sektor i både inn- og utland.\n"}],"startTime":"2019-09-12T10:30","endTime":"2019-09-12T10:50"},{"intendedAudience":"Anyone working with frontend development","endTimeZulu":"2019-09-12T11:50:00Z","format":"lightning-talk","length":"10","language":"no","sessionId":"e70c1aae-c4de-4908-bf7e-e301057f4490","video":"363513829","abstract":"Accessible web design can seem at times like an ever-expanding field of evolving standards, often in conflict with each other. For a few minutes, I would like to share with you some simple tips and tricks I have found helpfull while working with frontend code. I also hope that I will be able to challenge some of your pre-conceptions of accessible design.","title":"Practical accessibility tips and tricks","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T11:40:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/fde8386d51908da5741806f1f536325a?d=mm","name":"Stine Grumheden","bio":"Jeg heter Stine Grumheden, og har jobber som konsulent i Acando i 2 år"}],"startTime":"2019-09-12T13:40","endTime":"2019-09-12T13:50"},{"intendedAudience":"Code snippets are written in Java, but not much experience with it is necessary. We will focus on some general semantics and which semantics can be associated with what kind of people. You will be able learn to recognise yourself and your colleagues from the examples given. You learn to look at code from another angle.","endTimeZulu":"2019-09-11T09:05:00Z","format":"presentation","length":"45","language":"en","sessionId":"5201ab58-28fb-4c93-be76-64c13ca5dcbe","video":"362497128","abstract":"Some say they can read people and tell by their expressions or body language what kind of personality they have. But what if it is possible to read people from the code they write? It would perhaps be possible to tell who to avoid because they are a little bit aggressive and who to approach because they like to help out other people. In this talk we will explore what research is conducted on the relation between personality traits and programming semantics.","title":"Me, My Code and I","room":"Room 2","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T08:20:00Z","speakers":[{"twitter":"@JoostenRosanne","pictureUrl":"https://www.gravatar.com/avatar/abd0c6032bc95145328f70e9a2c7b95f?d=mm","name":"Rosanne Joosten","bio":"Rosanne is a Software Engineer at OpenValue. She came the long way around in the IT field with her bachelors degree in Psychology. She works for top companies in the Netherlands always questioning the way things are done. Rosanne codes in the language that is required, which she is glad to learn when necessary. She also likes puzzles, meditating and yoga. "}],"startTime":"2019-09-11T10:20","endTime":"2019-09-11T11:05"},{"intendedAudience":"Developers at any level.","endTimeZulu":"2019-09-12T15:45:00Z","format":"presentation","length":"45","language":"en","sessionId":"0864d42d-6b19-49ef-8828-9ca7ff4412cb","video":"363528954","abstract":"Developers, it's midnight. Do you know what your systems are doing?\n\nAs our software is deployed to our users, we lose the ability to directly run and debug it. For many of us, your systems could be down right now or someone could be attacking them. Would you know?\n\nIn order gain insight to the behavior of your system, good looking is criticial. To gain as good control as possible, Johannes has developed a streamlined implementation of SLF4J - the standard logging facade for Java libraries.\n\nIn this talk, you will learn how to optimize what you log with Markers, MDC and formatting and you will learn good options for making sure your logs are available to you at the right time.\n\nThe talk will highlight the open source library Logevents (http://logevents.org), a \"batteries-included\" implementation of the SLF4J API. In addition to the how and what of logging, the talk will cover how to use and misuse Design Patterns to create better libraries. ","title":"Taking control of your system with better logging","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T15:00:00Z","speakers":[{"twitter":"jhannes","pictureUrl":"https://www.gravatar.com/avatar/4f603396c8723741d2665f87beb4d1f2?d=mm","name":"Johannes Brodwall","bio":"Johannes is a programmer and provocateur. He works for Sopra Steria in Oslo where he builds software for a living. In his spare time, he likes to tinker with code, building better versions of stuff that's already been build in his open source libraries like Eaxy (Enjoy XML), Logevents (logging with the batteries included), and Action Controller (annotation-based web applications without black magic)"}],"startTime":"2019-09-12T17:00","endTime":"2019-09-12T17:45"},{"intendedAudience":"The audience should probably have experience with React and Redux. It is not necessary, though, as this talk can function as a way of seeing how good Redux can be when used correctly.","endTimeZulu":"2019-09-11T11:40:00Z","format":"lightning-talk","length":"20","language":"no","sessionId":"853cc4c1-f702-4d9e-97c7-fb6e842e104b","video":"362746622","abstract":"Jeg har et anstrengt forhold til Redux. Jeg elsker tanken som ligger bak – enveis dataflyt er enkelt å forholde seg til, og behagelig å resonnere rundt. At biblioteket i seg selv er lite i størrelse, og at det er passe enkelt å forstå koden, er et stort pluss! Dessverre kommer det også med et unødvendig knotete oppsett. Og ikke minst noen løse koblinger som resulterer i både boilerplate og uoversiktlig intern flyt. Hvordan kan vi få Redux til å spille mer på laget vårt?\n\nVi starter med å se på hva problemene med Redux er i et ganske klassisk React-prosjekt, og så løser vi disse problemene med noen relativt enkle abstraksjoner og konsepter fra et bibliotek som heter Redux Starter Kit. Resultatet er et prosjekt vi forhåpentligvis synes det er lettere å forstå flyten i, og enklere å navigere rundt i.\n\nDette foredraget passer for deg som har brukt Redux tidligere, og har følt at noen av konseptene og løsningene skurrer litt. Og deg som ikke har kjent på disse følelsene, men lurer på hva pokker jeg egentlig snakker om i teksten over.","title":"Fiks Reduxen din med Redux Starter Kit","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T11:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/eb43ac4ff9f1fce5ec695f605170c4e9?d=mm","name":"Bendik Solheim","bio":"Bendik er til daglig utvikler i BEKK, hvor han har jobbet de siste 6-7 årene. Han er over gjennomsnittet glad i programmeringsspråk på et teoretisk plan. Til daglig jobber han for det meste med webløsninger, både på serveren og i nettleseren.\n"}],"startTime":"2019-09-11T13:20","endTime":"2019-09-11T13:40"},{"intendedAudience":"This talk is for anyone who wants to learn Deep Learning from scratch and have no background in Deep Learning or A.I. Anyone who can code in any language. ","endTimeZulu":"2019-09-12T08:30:00Z","format":"lightning-talk","length":"10","language":"en","sessionId":"8a324c11-7368-4383-befd-91446e0df9b7","video":"365274571","abstract":"This short talk will show you the best way to learn Deep Learning. I will provide enough examples and content to get you motivated to start writing your own a.i algorithms and create smart and modern applications. This talk is for anyone who wants to learn Deep Learning from scratch and have no background in Deep Learning or A.I.","title":"The best way to learn Deep Learning","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T08:20:00Z","speakers":[{"twitter":"@MilladDagdoni","pictureUrl":"https://www.gravatar.com/avatar/35079459e05cac07ff747fc4dc21d650?d=mm","name":"Millad Dagdoni","bio":"Millad is a software architect, programmer and Deep Learning Community lead at NAV IT. He enjoys working with many programming languages like Java, Kotlin, Go and Javascript. Deep Learning is something that sparked his interested early on and made him interested in smart A.I systems that learn to make the right decisions."}],"startTime":"2019-09-12T10:20","endTime":"2019-09-12T10:30"},{"intendedAudience":"All developers, both beginners and experienced, can attend. After listening to this talk, you will know more about what a cross-functional developer is, why it's important and the experiences the speaker made through projects at NAV.","endTimeZulu":"2019-09-12T07:20:00Z","format":"lightning-talk","length":"20","language":"en","sessionId":"4f5c5c61-9d25-4d56-9a33-b6a18cd65173","video":"362748967","abstract":"Developing software that truly gives value to its users are hard. Developing software in the public sector is even harder, considering requirements such as security, accessibility, availability, stability and finally also GDPR and privacy. \n\nMaking valuable software requires one more crucial element, and that is the understanding of how the software affects the users emotions, choices and thoughts. In NAV, we deal with these challenges every day in cross-functional teams when developing critical labour and welfare services.\n\nTo address these challenges, developers need to change mindsets. Coding alone is no longer enough. They need to become “Cross-Functional Developers” that understands the users and their journey across a complex chain of services.\n\nIn this talk, I will share my experiences being a developer in a cross-functional team in a large-scale organisation. I will talk about what a cross-functional developer actually is, why it’s important and how it shapes the software we create. I will also talk about what actions you can take in order to really put the focus on your users and their needs.","title":"The Cross-Functional Developer","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T07:00:00Z","speakers":[{"twitter":"dervis_m","pictureUrl":"https://www.gravatar.com/avatar/4b293cca97ecb8264699f1eac8336779?d=mm","name":"Dervis Mansuroglu","bio":"Dervis is a full-stack Java-developer, currently working for the Norwegian Labour and Welfare Administration. He is passionate about programming languages on the JVM, machine learning, electronics and algorithms. Dervis is an active contributor to the Norwegian Java community and is the current Oslo JUG lead (javaBin Oslo). Dervis is also co-organizer for Oslo Software Architecture (OSWA) which is one of the biggest Meetup-communities in Norway."}],"startTime":"2019-09-12T09:00","endTime":"2019-09-12T09:20"},{"intendedAudience":" The audience should have interest in running their services in Kubernetes on Azure. They should have a basic understanding of what Azure,  Kubernetes and APIs are.","endTimeZulu":"2019-09-11T09:20:00Z","format":"presentation","length":"60","language":"en","sessionId":"422fef66-780e-4f27-a921-6dbfaf852ae7","video":"362508355","abstract":"As a successful tech company, Vipps has grown quickly. Through that growth, we managed to go from a centralized management of APIs, to a setup where many teams take responsibility for their services, in a fast and effective way. Join us and see how we overcame this challenge, by setting up a complete API development lifecycle with Azure DevOps, Api Management and Azure Kubernetes Service. Everything in a secure and independent, DevOps-like way.","title":"How Vipps uses Azure to become the No.1 payment service in Norway","room":"Room 4","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T08:20:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/f9fc1e96935da612c1d838eb39fa6f90?d=mm","name":"Sven Malvik","bio":"Sven Malvik is the leader of team platform at Vipps AS that is responsible for providing tools and processes for developer teams working in Azure."}],"startTime":"2019-09-11T10:20","endTime":"2019-09-11T11:20"},{"intendedAudience":"Relevant for alle som er opptatt av kulturbygging og kunnskapsdeling i utviklermiljø.","endTimeZulu":"2019-09-12T14:40:00Z","format":"lightning-talk","length":"10","language":"no","sessionId":"a1660a42-9d42-4f8a-ad1c-28c552f69889","video":"363524112","abstract":"NAV er igang med å bygge opp et av Norges beste utviklermiljø og et ledd i denne oppbyggingen er å skape et godt fagmiljø. Denne lyntalen handler om hvordan vi i NAV nå jobber med å skape en kultur for kunnskapsdeling og faglig utvikling. Hvorfor er det viktig? Hva har vi gjort? Hvilke erfaringer har vi så langt?","title":"Kulturbygging i NAV - faggrupper","room":"Room 1","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T14:30:00Z","speakers":[{"twitter":"","pictureUrl":"https://www.gravatar.com/avatar/f42a14ec8706af88ff9717ff41eb8b64?d=mm","name":"Richard Borge","bio":"Jeg har jobbet med utvikling siden 2005 og har nå jobbet i NAV i halvannet år. Jeg har fått ansvaret for å starte opp faggrupper i NAV IT og kan derfor dele de erfaringene vi har hatt så langt."}],"startTime":"2019-09-12T16:30","endTime":"2019-09-12T16:40"},{"intendedAudience":"Any Java programmer using Hibernate towards relational databases, and who cares about performance and scalability.","endTimeZulu":"2019-09-12T11:45:00Z","format":"presentation","length":"45","language":"en","sessionId":"a40f13e3-5995-497d-a8ea-13fa38f795c7","video":"360785165","abstract":"As performance experts on relational databases, we have so often blamed Hibernate for the trouble. This is wrong! Instead we blame you, the developer. Hibernate is a great tool, IF you use it correctly. In this presentation we'll do a roleplay between a Java Developer and an Oracle DBA when experiencing some performance issues. The conversations starts with the developer calling the DBA: \"We are having a performance issue. Could you please look at the database?\", and the DBA answers: \"Everything looks green on the database side!\".  Then - the fight is on!","title":"Hibernate, the cause of your performance problems? – it’s probably YOU","room":"Room 6","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T11:00:00Z","speakers":[{"twitter":"@lasjen","pictureUrl":"https://www.gravatar.com/avatar/f67f6bd11d7a79bb067df5a077e1dddb?d=mm","name":"Lasse Jenssen","bio":"I'm an developer and database expert, focusing on performance and scalability. I have worked with database technologies for over 20 years, and I strongly believe in using the right technology for the right purpose. This could be anything from NoSQL databases such as MongoDB, Cassandra and ElasticSearch, or RDBM Systems such as MS SQL Server, PostgresSQL, MySQL, DB2 or Oracle.  \n\nI strongly believe that performance is a feature, and that programmers and system owners get the systems they deserve.\n\nIn 2015 I  became an Oracle ACE Associate, for my knowledge and contributions towards the Oracle communities."},{"twitter":"@NiceTheoryVidar","pictureUrl":"https://www.gravatar.com/avatar/07f6bcfa1a34d15231fb00803de09b20?d=mm","name":"Vidar Eidissen","bio":"Vidar Eidissen is a database developer and technical lead in the Norwegian database consultancy Eritec. He participates in projects both as a developer as well as guiding team members in techniques for more maintainable and efficient use of the Oracle database.Oracle has been a focus area since 1998, with work including ETL, development, performance tuning, troubleshooting, and more.He's background also includes 23 years at DIPS ASA, Norway's leading vendor of e-health solutions for hospitals, building the largest hospital databases in Norway.He advocates a holistic approach to application tuning, focusing not only on the database, but on the behavior of the system from the end-user down. As a consequence he likes the SmartDB paradigm.He holds several top certifications within SQL and PL/SQL and has a small blog at nicetheory.io."}],"startTime":"2019-09-12T13:00","endTime":"2019-09-12T13:45"},{"intendedAudience":"The goal of this session is to answer the popular question, why Java process takes too much memory, and how to deal with it. The session will be most useful for developers who deploy, operate or maintain Java applications in a production environment.","endTimeZulu":"2019-09-12T12:00:00Z","format":"presentation","length":"60","language":"en","sessionId":"f8144167-2595-4e65-97be-45da5d752c09","video":"360793912","abstract":"Does JVM option '-Xmx4g' mean that the process will consume up to 4 GB RAM? Certainly not. What else can take virtual memory and how much of it? The question becomes especially important when running Java in a shared environment or in a container with limited resources.\n\nExcessive memory consumption may occur everywhere: from the application code and the libraries to the Java virtual machine and the operating system. While Java memory leaks are usually easy to discover from a heap dump, native memory leaks can be quite confusing.\n\nDuring this session we will discuss what structures contribute to the JVM footprint. We will study the real cases of native memory leaks and explore the tools useful in memory allocation analysis.","title":"Memory footprint of a Java process","room":"Room 5","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-12T11:00:00Z","speakers":[{"twitter":"AndreiPangin","pictureUrl":"https://www.gravatar.com/avatar/3f46693d0565b80b34e2236aaf76c1c3?d=mm","name":"Andrei Pangin","bio":"Andrei Pangin leads the development of Odnoklassniki social network, specializing in high performance Java servers. He previously worked on HotSpot JVM, which became his favorite topic and area of expertise. Andrei is also known as top #JVM answerer on Stack Overflow and the author of Async-profiler."}],"startTime":"2019-09-12T13:00","endTime":"2019-09-12T14:00"},{"intendedAudience":"Anyone grappling with what it means to \"go to the cloud\", the buzzword bingo, the confusion of it all. ","endTimeZulu":"2019-09-11T14:40:00Z","format":"presentation","length":"60","language":"en","sessionId":"82df94de-8650-4e4b-9a6f-ef57d2472287","video":"362776183","abstract":"Every organization has at least a phalanx or two in the Cloud and it is, understandably changing the way we architect our systems. But your application portfolio is full of heritage systems that hail from the time before everything was as a service. Not all of those applications will make it to the valley beyond, how do you grapple with your legacy portfolio? This talk will explore the strategies, tools and techniques you can apply as you evolve towards a cloud native future.","title":"Evolving to Cloud Native","room":"Room 6","conferenceId":"99f71831-fdd3-41e3-962e-f25af5e091b9","startTimeZulu":"2019-09-11T13:40:00Z","speakers":[{"twitter":"@ntschutta","pictureUrl":"https://www.gravatar.com/avatar/db57fc5b2f4827a43e5afea9f636fa48?d=mm","name":"Nathaniel Schutta","bio":"Nathaniel T. Schutta is a software architect focused on cloud computing and building usable applications. A proponent of polyglot programming, Nate has written multiple books and appeared in various videos. Nate is a seasoned speaker regularly presenting at conferences worldwide, No Fluff Just Stuff symposia, meetups, universities, and user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. Driven to rid the world of bad presentations, Nate coauthored the book Presentation Patterns with Neal Ford and Matthew McCullough. Nate recently published Thinking Architecturally available as a free download from Pivotal."}],"startTime":"2019-09-11T15:40","endTime":"2019-09-11T16:40"}]}